{
  "articles": [
    {
      "title": "Anthropic hires new CTO with focus on AI infrastructure",
      "url": "https://techcrunch.com/2025/10/02/anthropic-hires-new-cto-with-focus-on-ai-infrastructure/",
      "summary": "As part of the change, Anthropic is updating the structure of its core technical group, bringing the company's product-engineering team into closer contact with the infrastructure and inference teams.",
      "publishedDate": "2025-10-02T19:00:39.000Z",
      "author": "Russell Brandom",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "OpenAI’s Sora soars to No. 3 on the US App Store",
      "url": "https://techcrunch.com/2025/10/02/openais-sora-soars-to-no-3-on-the-u-s-app-store/",
      "summary": "Sora becomes the No. 3 US app after 164K downloads in 2 days, making the AI video app an early hit.",
      "publishedDate": "2025-10-02T18:24:54.000Z",
      "author": "Sarah Perez",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "Google’s Jules enters developers’ toolchains as AI coding agent competition heats up",
      "url": "https://techcrunch.com/2025/10/02/googles-jules-enters-developers-toolchains-as-ai-coding-agent-competition-heats-up/",
      "summary": "Jules is already being used by developers to complete code after experimenting on vibe-coding platforms.",
      "publishedDate": "2025-10-02T18:00:00.000Z",
      "author": "Jagmeet Singh",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "Ex-OpenAI researcher dissects one of ChatGPT’s delusional spirals",
      "url": "https://techcrunch.com/2025/10/02/ex-openai-researcher-dissects-one-of-chatgpts-delusional-spirals/",
      "summary": "A former OpenAI researcher looked into how ChatGPT can mislead delusional users about their reality and its own capabilities.",
      "publishedDate": "2025-10-02T15:46:25.000Z",
      "author": "Maxwell Zeff",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "Perplexity’s Comet AI browser now free; Max users get new ‘background assistant’",
      "url": "https://techcrunch.com/2025/10/02/perplexitys-comet-ai-browser-now-free-max-users-get-new-background-assistant/",
      "summary": "AI search startup Perplexity is making its new Comet browser available to everyone in the world for free as it works to position the product against big browsers and search engines. For certain paid subscribers, the startup has also launched a new ‘background assistant’ to handle multiple tasks via Comet.",
      "publishedDate": "2025-10-02T15:36:09.000Z",
      "author": "Rebecca Bellan",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "Phoebe Gates and Sophia Kianni share the playbook for scaling consumer AI and winning Gen Z at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/10/02/storming-the-gates-scaling-consumer-ai-with-phoebe-gates-and-sophia-kianni-only-at-techcrunch-disrupt-2025/",
      "summary": "Phia co-founders Phoebe Gates and Sophia Kianni are redefining how Gen Z shops with AI. At TechCrunch Disrupt 2025, they’ll share how they’re scaling one of the year’s hottest startups into a lasting consumer brand. Register to join.",
      "publishedDate": "2025-10-02T15:00:00.000Z",
      "author": "TechCrunch Events",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "A new a16z report looks at which AI companies startups are actually paying for",
      "url": "https://techcrunch.com/2025/10/02/a-new-a16z-report-looks-at-which-ai-companies-startups-are-actually-paying-for/",
      "summary": "a16z releases its first AI spending report that shows which AI-native application layer companies startups are actually spending money on .",
      "publishedDate": "2025-10-02T15:00:00.000Z",
      "author": "Dominic-Madori Davis",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "OpenAI is the world’s most valuable private company after private stock sale",
      "url": "https://techcrunch.com/2025/10/02/openai-is-the-worlds-most-valuable-private-company-after-private-stock-sale/",
      "summary": "OpenAI employees sold $6.6B in shares, leading company's valuation to jump to $500B.",
      "publishedDate": "2025-10-02T14:35:44.000Z",
      "author": "Russell Brandom",
      "source": {
        "name": "TechCrunch AI",
        "tier": "ai-news",
        "authority": "Medium",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:06.647Z"
    },
    {
      "title": "Trump admin defiles even the “out of office” email auto-reply",
      "url": "https://arstechnica.com/culture/2025/10/trump-admin-defiles-even-the-out-of-office-email-auto-reply/",
      "summary": "\"Radical Left\" and \"Democrat Senators\" come in for attack.",
      "publishedDate": "2025-10-02T23:29:08.000Z",
      "author": "\n                    Nate Anderson\n                ",
      "source": {
        "name": "Ars Technica",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:07.223Z"
    },
    {
      "title": "Blue Origin aims to land next New Glenn booster, then reuse it for Moon mission",
      "url": "https://arstechnica.com/space/2025/10/blue-origin-aims-to-land-next-new-glenn-booster-then-reuse-it-for-moon-mission/",
      "summary": "\"We fully intend to recover the New Glenn first stage on this next launch.\"",
      "publishedDate": "2025-10-02T22:17:34.000Z",
      "author": "\n                    Stephen Clark\n                ",
      "source": {
        "name": "Ars Technica",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:07.223Z"
    },
    {
      "title": "Meta won’t allow users to opt out of targeted ads based on AI chats",
      "url": "https://arstechnica.com/tech-policy/2025/10/meta-wont-allow-users-to-opt-out-of-targeted-ads-based-on-ai-chats/",
      "summary": "US users stuck with AI ad targeting as EU users win more control over their feeds.",
      "publishedDate": "2025-10-02T17:16:38.000Z",
      "author": "\n                    Ashley Belanger\n                ",
      "source": {
        "name": "Ars Technica",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:07.223Z"
    },
    {
      "title": "Microsoft says AI can create “zero day” threats in biology",
      "url": "https://www.technologyreview.com/2025/10/02/1124767/microsoft-says-ai-can-create-zero-day-threats-in-biology/",
      "summary": "A team at Microsoft says it used artificial intelligence to discover a “zero day” vulnerability in the biosecurity systems used to prevent the misuse of DNA. These screening systems are designed to stop people from purchasing genetic sequences that could be used to create deadly toxins or pathogens. But now researchers led by Microsoft’s chief…",
      "publishedDate": "2025-10-02T18:00:00.000Z",
      "author": "Antonio Regalado",
      "source": {
        "name": "MIT Tech Review",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:07.389Z"
    },
    {
      "title": "The Download: RIP EV tax credits, and OpenAI’s new valuation",
      "url": "https://www.technologyreview.com/2025/10/02/1124684/the-download-rip-ev-tax-credits-and-openais-new-valuation/",
      "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. EV tax credits are dead in the US. Now what? Federal EV tax credits in the US officially came to an end yesterday. Those credits, expanded and extended in the 2022 Inflation Reduction…",
      "publishedDate": "2025-10-02T12:10:00.000Z",
      "author": "Rhiannon Williams",
      "source": {
        "name": "MIT Tech Review",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:07.389Z"
    },
    {
      "title": "With GPT-5, Wrtn builds lifestyle AI for millions in Korea",
      "url": "https://openai.com/index/wrtn",
      "summary": "Wrtn scaled AI apps to 6.5M users in Korea with GPT-5, creating ‘Lifestyle AI’ that blends productivity, creativity, and learning—now expanding across East Asia.",
      "publishedDate": "2025-10-02T10:00:00.000Z",
      "author": "Unknown",
      "source": {
        "name": "OpenAI Blog",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:09.782Z"
    },
    {
      "title": "Apple removes ICEBlock from the App Store after Trump administration's demand",
      "url": "https://www.engadget.com/apps/apple-removes-iceblock-from-the-app-store-after-trump-administrations-demand-031659651.html?src=rss",
      "summary": "Apple has removed ICEBlock, the app which allowed users to put a pin on a map to show where ICE agents have recently been spotted, from the App Store. It has also pulled other apps that served a similar purpose. According to Fox Business, Attorney General Pam Bondi demanded their takedown, telling Apple that the apps were \"designed to put ICE agents at risk just for doing their jobs.\" Bondi added that \"violence against law enforcement is an intolerable red line that cannot be crossed.\" She also said that the \"Department of Justice will continue making every effort to protect [its] brave federal law enforcement officers, who risk their lives every day to keep Americans safe.\"\n\"We created the App Store to be a safe and trusted place to discover apps,\" Apple told the publication in a statement. \"Based on information we've received from law enforcement about the safety risks associated with ICEBlock, we have removed it and similar apps from the App Store.\" \n\nBondi demanded the apps' removal after the FBI and the administration reported that the gunman who attacked an ICE facility in Dallas used tracking apps, including ICEBlock, to open fire from a rooftop. The gunman killed two immigrants and injured a third, but he was allegedly targeting ICE agents. Joshua Aaron, the app's developer, told Fox Business that he was \"incredibly disappointed\" by Apple's actions. \"Capitulating to an authoritarian regime is never the right move,\" he said. \"Apple has claimed they received information from law enforcement that ICEBlock served to harm law enforcement officers. This is patently false.\" Aaron added: \"We are determined to fight this with everything we have. Our mission has always been to protect our neighbors from the terror this administration continues to reign down on the people of this nation.\"\nICEBlock climbed to the top of the App Store charts in July after administration officials slammed it, making more people aware of its existence. At the time, officials warned Aaron that they were \"looking at him, and he better watch out\" because the app threatens the lives of law enforcement agents. NBC News reports that it was downloaded more than 1 million times since it was introduced. Tom Homan, the administration's \"border czar,\" recently told Fox News that the government will investigate the \"people who put these apps up\" because they put \"law enforcement at great risk.\"\nThis article originally appeared on Engadget at https://www.engadget.com/apps/apple-removes-iceblock-from-the-app-store-after-trump-administrations-demand-031659651.html?src=rss",
      "publishedDate": "2025-10-03T03:16:59.000Z",
      "author": "Mariella Moon",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "Game Pass Ultimate is still $20 a month if you buy pre-paid codes",
      "url": "https://www.engadget.com/gaming/xbox/game-pass-ultimate-is-still-20-a-month-if-you-buy-pre-paid-codes-222333258.html?src=rss",
      "summary": "Microsoft may have made the unfortunate decision to raise the price of a Xbox Game Pass Ultimate subscription to $30 a month, but you don't have to live by the company's rules — at least not yet. Most online retailers are still selling codes for prepaid Game Pass subscriptions at the original $20 a month price. That means you can pay $60 for three months of Xbox Game Pass Ultimate, stack your codes and keep your subscription without having to downgrade or cancel.\n \n \n \nAs the highest tier in Game Pass, an Ultimate subscription gives you the ability to download and play a library of over 200 games on your PC or Xbox. With Xbox Cloud Gaming, you can also stream the majority of those games to other devices, too, whether it's a smartphone, LG TV or in-car display. It's worth noting, though, the benefits of Ultimate did change with the introduction of the higher price. Microsoft shared that Ultimate subscribers will now also receive the benefits of an Ubisoft+ subscription at no additional cost, a $16 a month value that unlocks access to a back catalog of Ubisoft games from franchises like Assassin's Creed and Far Cry. Starting in November, the new Ultimate subscription also includes access to Fortnite Crew, Epic's $12 a month plan that gives you V-Bucks, battle passes and more in Fortnite.\n  \nWhile those new benefits might justify a higher price monetarily, whether that's a convincing reason to stay subscribed is a separate question. This likely won't be the last time Microsoft will raise the price of its subscription service. Avoiding those fees by buying pre-paid Game Pass codes seems like an excellent way to try out the new Ultimate before committing to cancelling your subscription, downgrading your plan or sticking with Microsoft's new price. You can purchase three months of Xbox Game Pass Ultimate for $60 a month. Stacking four three-month codes should come out to around $240.\nThis article originally appeared on Engadget at https://www.engadget.com/gaming/xbox/game-pass-ultimate-is-still-20-a-month-if-you-buy-pre-paid-codes-222333258.html?src=rss",
      "publishedDate": "2025-10-02T22:23:33.000Z",
      "author": "Ian Carlos Campbell",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "Strava sues Garmin in bizarre patent infringement lawsuit",
      "url": "https://www.engadget.com/wearables/strava-sues-garmin-in-bizarre-patent-infringement-lawsuit-213300227.html?src=rss",
      "summary": "Fitness tech appears to be having a strange spat. Earlier this week, Strava filed a lawsuit alleging that Garmin infringed on its patents for two features related to tracking exercise routes: segments and heatmaps. It's also claiming that Garmin violated a Master Cooperation Agreement by developing its own heat map feature. The complaint (via The Verge) is seeking a permanent injunction to stop Garmin from selling any items with segments or a heat map features, which would amount to a majority of Garmin's hardware products as well as its Connect tracking program.\nThe lawsuit on its own is a surprise. Strava and Garmin are two major players in fitness tech that have worked together for about a decade, the pair have a number of integrations between their platforms. It also seems unlikely that Strava will make much headway with the case. DC Rainmaker, which first picked up on the lawsuit, has a thorough timeline of the companies' patent filings that strongly suggests the arguments won't hold water in court. It's also strange that these alleged infringements, by Strava's own assertions, began a long time ago and yet the company is only taking issue with them now.\n\nBut the situation got even stranger when Strava Chief Product Officer Matt Salazar took to Reddit today to give some insight into why the company is taking such aggressive action against a frequent partner. According to Salazar's post, Strava is invoking the lawyers because Garmin is adopting new developer guidelines for API partners \"that required the Garmin logo to be present on every single activity post, screen, graph, image, sharing card etc.\" Although he frames it as a move to protect users' data, the argument sounds more like a petty complaint that Garmin is putting its brand on the data its products are used to collect.\nIt's a weird lawsuit, and hopefully one that won't cause any disruptions for either company's customers.\nThis article originally appeared on Engadget at https://www.engadget.com/wearables/strava-sues-garmin-in-bizarre-patent-infringement-lawsuit-213300227.html?src=rss",
      "publishedDate": "2025-10-02T21:33:00.000Z",
      "author": "Anna Washenko",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "Crashout Crew looks like Overcooked-style mayhem from one of the studios behind Peak",
      "url": "https://www.engadget.com/crashout-crew-looks-like-overcooked-style-mayhem-from-one-of-the-studios-behind-peak-193854718.html?src=rss",
      "summary": "It's been quite the year for Aggro Crab. After stopping production on a sequel to Going Under (with funding issues and burnout both factoring into that decision), the studio decided to focus on self-funded game jam projects before moving onto another big game. Some of the team collaborated with Content Warning developer Landfall to create Peak. With the help of clever marketing, that co-op climbing game turned out to be a huge hit, selling 10 million copies in just two months. \nThe rest of the Aggro Crab squad focused on a different multiplayer game, which is called Crashout Crew. This is a party game for up to four players (there's a single-player option too) in which you'll try to complete orders in hazard-filled warehouses using cute, color-coded forklifts. Time is of the essence as you race to meet quotas by loading boxes into trucks, so it’s just as well that you can drift around corners. Just be careful not to drop any explosives.\nYou’ll be skidding around icy environments and spinning out if you run over a broken egg. Falling rocks, bees and blackouts all add to the chaos. You can upgrade your forklift and warehouse, though they’ll reset after the level ends. \n\n\n\nThe reveal trailer reminds me quite a bit of Overcooked. I wonder if this could turn out to be just as effective as a litmus test for how well you communicate with family and friends. \nI adore Another Crab's Treasure, Aggro Crab’s last large-scale game, so I'll always be interested in whatever the studio is cooking up. I'm looking forward to trying out Crashout Crew when the demo goes live on October 13 as part of Steam Next Fest. The game is scheduled to hit Steam next year.  \n\n\nThis article originally appeared on Engadget at https://www.engadget.com/crashout-crew-looks-like-overcooked-style-mayhem-from-one-of-the-studios-behind-peak-193854718.html?src=rss",
      "publishedDate": "2025-10-02T19:38:54.000Z",
      "author": "Unknown",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "Dutch court orders Meta to change its Facebook and Instagram timelines",
      "url": "https://www.engadget.com/big-tech/dutch-court-orders-meta-to-change-its-facebook-and-instagram-timelines-185106583.html?src=rss",
      "summary": "A court in the Netherlands has ordered Meta to change Facebook and Instagram's timelines, after finding that the element ran afoul of the European Union's Digital Services Act (DSA). As reported by Reuters, the Dutch court said that the company needs to provide users with simpler options — namely ones that don't rely on an algorithm.\n\"People in the Netherlands are not sufficiently able to make free and autonomous choices about the use of profiled recommendation systems,\" the court said in its decision. It ruled that the timeline must honor a user's choice of chronological order or other non-profiled options, instead of reverting to the algorithm-driven version whenever a user closes and reopens either app.\n\nThe case was brought by Bits of Freedom, a Dutch digital rights group. \"It is unacceptable that a few American tech billionaires can determine how we view the world,\" said the group's spokesperson, Maartje Knaap.\nMeta said it will appeal the decision, and that these DSA issues should be handled by the European Commission and other EU regulators, not by the courts of individual nations. \"Proceedings like this threaten the digital single market and the harmonized regulatory regime that should underpin it,\" a Meta spokesperson said. Meta faces a potential fine of $117,450 for every day it fails to comply with the court's order, up to a maximum of $5.8 million.\nThe DSA has been a common thorn in the side of big tech companies since its approval in 2022. The European Commission has levied hundreds of millions of dollars in fines against the likes of Apple, Meta and Alphabet for violations of the DSA. The regulations have also been used to effect certain changes on these platforms in the name of privacy, data security and the protection of minors.\nThis article originally appeared on Engadget at https://www.engadget.com/big-tech/dutch-court-orders-meta-to-change-its-facebook-and-instagram-timelines-185106583.html?src=rss",
      "publishedDate": "2025-10-02T18:51:06.000Z",
      "author": "Andre Revilla",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "The best Amazon Prime Day vacuum deals you can get early: Save on robot and stick machines from iRobot, Shark, Dyson and others",
      "url": "https://www.engadget.com/deals/the-best-october-prime-day-robot-vacuum-deals-you-can-get-now-save-on-machines-from-irobot-shark-dyson-and-others-151504093.html?src=rss",
      "summary": "This October Prime Day, we've collected a list of the best Amazon discounts on both traditional and robotic vacuums. We're hoping this article can do more than just save you money — it's also designed to help you with the fiddliest vacuum-related decisions. Should you go corded, cordless or robotic? Dyson, Tineco or Shark? Are there any decent robot vacuums that aren't Roombas? (Yes.) As the event goes on, we'll search for discounts as tirelessly as an automated vacuum scours your floors for dirt, and post all the best deals here.\n \nBest Prime Day vacuum deals\n \n \n \nShark AV2501AE AI Robot Vacuum for $449 (31 percent off): If you like the look of the AV2501S but have even more space to clean, the AV2501AE is also on sale. Its self-empty base can go a full 60 days before you have to dump it out, so it's ideal for large spaces, complex homes or areas that see heavy use. It's got the same features otherwise, including LiDAR mapping and two hours of autonomous work.\n  \nShark PowerDetect NeverTouch for $450 (55 percent off): This robotic mop/vacuum combo is engineering so you'll almost never need to revisit it after you set it up. It can clean its own mop, refill its own water tank and empty its own dustbin for up to 30 days at a time. It's also equipped with air jets that blast dirt out of corners the vacuum can't fit into.\n \nShark Matrix Plus 2-in-1 for $300 (57 percent off, Prime exclusive): The Shark Matrix Plus takes the robot vacuum concept even further by working a mop into the design for hands-off wet cleaning. This model is self-cleaning, self-emptying, self-charging and capable of tackling ground-in stains on hard floors.\n \nShark Navigator Lift-Away Deluxe for $160 (27 percent off): Moving into manual vacuums, let's start with one of the best. The Shark Navigator Lift-Away is a champion at getting deeply ingrained crud out of carpets, but it's also capable of squaring away bare floors. You can switch between the two settings quickly, and the lift-away canister makes it easy to empty.\n \niRobot Roomba 104 Vac for $150 (40 percent off, Prime exclusive): This entry-level Roomba is a good pick for anyone who's new to owning a robot vacuum. It features a multi-surface brush and an edge-sweeping brush to clean all types of flooring, and it uses LiDAR navigation to avoid obstacles as it goes. The iRobot mobile app lets you control the robot, set cleaning schedules and more.\n \niRobot Roomba Plus 504 for $380 (36 percent off): For those looking to upgrade to a more advanced robot vacuum, the Roomba Plus 504 is a great next step. It can clean almost anything that might land on a home floor, and if it can't clean it, it can steer around it. Two brushes and strong suction get at tougher stains, and it even includes an app you can use to set cleaning zones and change suction force remotely.\n \nLevoit LVAC-300 cordless vacuum for $250 ($100 off, Prime exclusive): One of our favorite cordless vacuums, this Levoit machine has great handling, strong suction power for its price and a premium-feeling design. Its bin isn't too small, it has HEPA filtration and its battery life should be more than enough for you to clean your whole home many times over before it needs a recharge.\n \nDyson Ball Animal Total Clean Upright Vacuum for $500 (24 percent off): Dyson is still the king of reinventing vacuums, and the bagless, hyper-maneuverable Ball Animal is a blast to use. The Ball design is based on ease of steering, but the hidden MVP is the sealing — from the head to the canister, not a hair is getting out of this one once it's in.\n \nAmazon Basics Upright Bagless Vacuum Cleaner for $55 (21 percent off): All right, nobody goes to Amazon Basics to be impressed, but we have to admit this vacuum exceeds expectations. It's light, it has a big dust reservoir and it comes with all the attachments you'll need for a reasonably sized apartment. The filter is also simple to remove and clean.\n \nBlack+Decker QuickClean Cordless Handheld Vacuum for $27 (33 percent off): Rounding out the list, we've got this small-but-mighty hand vacuum, perfect for crevices, shelves or cleaning out your car. It weighs about 1.4 pounds and hoovers up small messes in the blink of an eye. The lithium-ion battery stays charged for up to 10 hours.\nThis article originally appeared on Engadget at https://www.engadget.com/deals/the-best-october-prime-day-robot-vacuum-deals-you-can-get-now-save-on-machines-from-irobot-shark-dyson-and-others-151504093.html?src=rss",
      "publishedDate": "2025-10-02T18:30:36.000Z",
      "author": "Sam Chapman",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "The best early October Prime Day TV deals: Save on sets from TCL, Sony, Hisense and more",
      "url": "https://www.engadget.com/deals/the-best-early-october-prime-day-tv-deals-save-on-sets-from-tcl-sony-hisense-and-more-180051769.html?src=rss",
      "summary": "Black Friday remains the best time to grab a new TV at a discount, but Amazon’s latest October Prime Day sale should be a decent time to take the plunge if you need to upgrade right away. While the two-day Prime Big Deal Days event doesn't officially start until October 7, a small handful of well-regarded TVs from the likes of TCL, Hisense, Sony and Samsung are cheaper than usual right now. You can find our full list of the best October Prime Day TV deals below. We'll update this roundup as prices change and new offers arise in the days ahead. \n \nBest Prime Day TV deals\n \n \n \nHisense U8QG 65-inch Mini-LED TV for $1,082 ($416 off): Several reviews suggest that the Hisense U8QG ticks most of the requisite boxes for a LCD TV in 2025: robust local dimming and mini-LED backlighting, exceptionally high brightness, vibrant quantum-dot colors, a fast refresh rate (165Hz in this case), support for the major HDR formats and so on. It’s a higher-end option than something like the TCL QM6K with much better brightness and contrast, though it still falls short of a good OLED TV when it comes to the latter. Like most LCD panels, it’ll also look a bit washed out if you view it from an angle. It has three HDMI 2.1 ports, which is one fewer than many other TVs in this price range, though it uniquely includes a USB-C video input if you want to hook up a gaming laptop or Nintendo Switch. (Just note that you won’t get VRR or HDR when using that.) You’d mainly get it over an OLED TV if you’re willing to trade some picture quality for something that’s better-suited in a bright room. This deal on the 65-inch model isn’t an all-time low, but it matches the best price we’ve tracked since July.\n  \nSamsung S90F 55-inch QD-OLED TV for $1,498 ($100 off): The Samsung S90F is an upper-tier model with a QD-OLED panel, which blends the usual perks of a quality OLED set — near-perfect contrast, wide viewing angles, clear motion, low input lag — with a layer of quantum dots. This helps it produce a wider gamut of more vivid colors compared to traditional WOLED TVs. It also comes with four HDMI 2.1 ports and has a fast refresh rate of 144Hz. It doesn’t support Dolby Vision HDR, however, and reviews we trust say that the LG C5, a competing WOLED model, retains darker black levels in a bright room. (The S90F has a more colorful image, though.) We saw this 55-inch model go for $100 less earlier in the month, but this deal matches the best price we’ve tracked otherwise. The 65-inch version is similarly discounted. Just make sure you only buy the 55-, 65- or 77-inch model, as every other size in the US uses a lesser WOLED panel. Shady, we know.\n \nSony Bravia 8 II 65-inch QD-OLED TV for $2,998 ($502 off): It’s certainly not cheap, but the Sony Bravia 8 II has earned plaudits for its excellent image processing, upscaling and overall accuracy alongside the expected color, contrast and motion benefits of its QD-OLED display. This should help it make lots of movies and shows look closer to their original intent. It also uses the handy Google TV interface. Outside of an extremely brief dip in June, this deal matches the best price to date for the 65-inch version. That said, if you can’t stomach the high price, other reviews note that the older Sony A95L offers similar performance a bit less, while more recent competitors like the LG G5 and Samsung S95F can get noticeably brighter (even if they’re not always as accurate). Those two should be better for gaming as well, as the Bravia 8 II only has two HDMI 2.1 ports — one of which is an eARC port for soundbars — and its input lag is slightly higher.\n \nAmazon Fire TV Stick 4K for $25 ($25 off): The standard Amazon Fire TV Stick 4K offers the same core experience as the pricier Fire TV Stick 4K Max, only it comes with a slightly slower processor, half the storage (8GB) and Wi-Fi 6 instead of Wi-Fi 6E. For most people just looking for a casual streamer on the cheap, those shouldn’t be huge losses. This model is also more powerful than the just-announced Fire TV 4K Select, though its Fire OS interface can still be messy and ad-heavy, with special emphasis on Amazon’s own services. This deal is $3 more than the stick’s all-time low, though it matches the best price we’ve seen since Black Friday last year.\n \nAmazon Fire TV Stick HD for $18 ($17 off): The Fire TV Stick HD is the budget pick in our guide to the best streaming devices. It can only stream up to 1080p, and it can run a bit choppier than the 4K models since it has a slower chipset and half the RAM (1GB). The usual issues with the Fire TV interface still apply here too. But if you just want to add streaming apps to an aging TV or basic monitor for as little cash as possible, it should get the job done. This discount ties the device's lowest price to date.\nThis article originally appeared on Engadget at https://www.engadget.com/deals/the-best-early-october-prime-day-tv-deals-save-on-sets-from-tcl-sony-hisense-and-more-180051769.html?src=rss",
      "publishedDate": "2025-10-02T18:00:51.000Z",
      "author": "Jeff Dunn",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "Early Amazon Prime Day tech deals under $50: Save on gear from Apple, Anker, Ring, JBL and Roku ahead of next week's sale",
      "url": "https://www.engadget.com/deals/early-amazon-prime-day-tech-deals-under-50-save-on-gear-from-apple-anker-ring-jbl-and-roku-ahead-of-next-weeks-sale-120531666.html?src=rss",
      "summary": "Amazon's (thrice) yearly Prime Day sales are a great opportunity to nab discounts on expensive stuff like TVs and laptops — it’s also an excellent time for sales on smaller electronics and accessories. For this list, we compared what’s on sale right now (a full five days before the sale even starts) with the stuff we recommend in our guides. For less than $50 each, we found deals on some of our favorite tech including batteries, iPhone paraphernalia, earbuds, speakers, holiday gifts and smart home gear. Some deals require you to be a Prime member, others are open to anyone with half a Benjamin earmarked for Amazon. Here are the best October Prime Day tech deals under $50.\n \nBest Prime Day deals under $50\n \n \n \nAmazon Echo Pop Kids for $33 ($17 off with Prime): Among the announcements for the new Echo devices, Amazon did not include new Echo Pop Kids models, so this is still the most current model for now. It’s good for smaller spaces, not necessarily audio fidelity, and it comes with six months of free access to Amazon Kids as well as early access to Alexa+.\n  \nApple MagSafe charger (25W, 2m) for $35 ($14 off): The latest version of Apple's MagSafe puck is Qi2.2-certified and supports up to 25W of wireless power when paired with a 30W adapter. The two-meter cable length on this particular model gives you more flexibility on where you can use it: in bed, on the couch, at your desk and elsewhere. Note that it dipped as low as $29 earlier this week. \n \nAmazon Fire TV Stick 4K Max for $40 ($20 off): Amazon's most powerful streaming dongle supports 4K HDR content, Dolby Vision and Atmos and Wi-Fi 6E with double the storage of cheaper Fire TV sticks. It earned an honorable mention in our guide to streaming devices and also happens to make a good retro gaming emulator.\n \nBlink Video Doorbell for $35 ($35 off): True, Amazon just announced new Blink devices, but those won’t hit the market until after Prime Day is over. If you want a video doorbell right now at an impressively low price, this should serve. We’ve tested Blink security devices before and have been impressed by what you get for such a small price.\n \nBelkin 4-Port Charger Block for $47 ($43 off): Here’s a handy charger from our guide to the best MacBook accessories. It’s comparable to the adapter Apple includes with its laptops, but it has four ports in total (two USB-C and two USB-A). Plus it’s cheaper than buying Apple’s brick, especially now.\n \nRing Battery Doorbell for $50 ($50 off): At $49.99 this juuust qualifies as an under $50 tech deal. If you don’t have doorbell wires at your front entrance, you can still have a camera to capture all the package deliveries and neighborhood animal sightings with the Ring Battery Doorbell. It records video in HD with more vertical coverage than the last model, so you can see people from head to toe. Just note that newer Ring devices are on the way. \n \nBlink Mini 2 security cameras (two-pack) for $35 ($35 off): This is currently the top budget pick in our guide to the best security cameras. The Mini 2 is a great option for indoor monitoring or you can put it outside with a weatherproof adapter, but since it needs to be plugged in, we like it for keeping an eye on your pets while you're away and watching over entry ways from the inside.\n \nBlink Mini 2 security cameras (three-pack) for $TK ($TK off): A three pack is also on sale and squeezes in just under the $50 mark.\n \nAnker 622 5K magnetic power bank with stand for $34 ($14 off with Prime): This 0.5-inch thick power bank attaches magnetically to iPhones and won't get in your way when you're using your phone. It also has a built-in stand so you can watch videos, make FaceTime calls and more hands-free while your phone is powering up.\n \nRing Indoor Cam for $25 ($25 off): While we thought the Blink Mini 2 was a better overall indoor camera in our guide, we do like the Ring app, which is ideal for beginners. Plus you get access to the Ring Neighbors app which is a fascinating glimpse into your neighborhood’s Ring-captured events.\n \nAmazon Smart Plug for $13 ($12 off): We named this the best smart plug for Alexa users because it hooks up painlessly and stays connected reliably. Use it to control lamps or your holiday lights using programs and schedules in the Alexa app, or just your voice by talking to your Echo Dot or other Alexa-enabled listener.\n \nLevoit Mini Core-P air purifier for $40 ($10 off with Prime): This is the mini version of the top pick in our guide to air purifiers. It has a three-stage filter (pre, activated carbon and particle filters) though that particle filter is not a true HEPA filter. But it’s rated at 250 square feet and can help clear the air in your office or other small room.\n \nEcho Pop smart speaker for $25 ($15 off): The half sphere Pop is the most affordable Echo speaker in Amazon’s lineup. The sound won’t be as full as its larger siblings, but will do a fine job of bringing Alexa’s help to smaller rooms. Just note that it went as low as $18 for Black Friday and October Prime Day last year.\n \nRoku Streaming Stick Plus 2025 for $29 ($11 off): This is our top pick for the best streaming device for accessing free and live content. The dongle supports 4K video and HDR and doesn’t need to be plugged into the wall for power. It’s a great way to access any streaming service you could ask for: Netflix, Prime Video, Disney+, HBO Max and many more.\n \nRoku Streaming Stick HD for $20 ($10 off): If you don’t care about 4K (or your screen resolution isn’t that high anyway) you can still get the same simple-to-use Roku OS with this device. The best thing about Roku streaming sticks is the access to all the free content — so this is an affordable way to get it.\n \n \n \nLeebein 2025 electric spin scrubber for $40 ($30 off with Prime): This is an updated version of the electric scrubber we love that makes shower cleaning easier than ever before. It comes with seven brush heads so you can use it to clean all kinds of surfaces, and its adjustable arm length makes it easier to clean hard-to-reach spots. It's IPX7 waterproof and recharges via USB-C.\n \nJisulife Life7 handheld fan for $25 ($4 off with Prime): This handy little fan is a must-have if you live in a warm climate or have a tropical vacation planned anytime soon. It can be used as a table or handheld fan and even be worn around the neck so you don't have to hold it at all. Its 5,000 mAh battery allows it to last hours on a single charge, and the small display in the middle of the fan's blades shows its remaining battery level.\n \nAnker Soundcore Select 4 Go speaker for $26 ($9 off with Prime): This is one of our top picks for Bluetooth speaker. It gets pretty loud for its size and has decent sound quality. You can pair two together for stereo sound as well, and its IP67-rated design will keep it protected against water and dust.\n \nAmazon Echo Spot for $50 ($30 off): Amazon brought the Echo Spot smart alarm clock back from the dead last year with a new design and improved speakers. In addition to being able to control smart home devices and respond to voice commands, the Echo Spot can also act as a Wi-Fi extender for those that have Eero systems. It went as low as $45 for Black Friday last year.\n \nSamsung EVO Select microSD card (256GB) for $23 ($4 off): This Samsung card has been one of our recommended models for a long time. It's a no-frills microSD card that, while not the fastest, will be perfectly capable in most devices where you're just looking for simple, expanded storage.\n \nJBL Go 4 portable speaker for $40 (20 percent off): The Go 4 is a handy little Bluetooth speaker that you can take anywhere you go thanks to its small, IP67-rated design and built-in carrying loop. It'll get seven hours of playtime on a single charge, and you can pair two together for stereo sound. The previous model, JBL Go 3 is on sale for $30.\n \nAnker Soundcore Space A40 for $45 (44 percent off): Our top pick for the best budget wireless earbuds, the Space A40 have surprisingly good ANC, good sound quality, a comfortable fit and multi-device connectivity.\n \nBlink Outdoor 4 security camera for $35 ($45 off): We named this the best choice for Alexa users in our guide to security cameras. It works seamlessly with Alexa devices like the Echo speakers and Show displays. Plus it can run for up to two years on a set of AA batteries and we found the motion detection to be spot on.\n \nAnker USB-C to USB-C cable (10FT,100W) for $10 ($2 off): Having a bad cable is almost as bad as not having a cable at all. We’re big fans of Anker’s cords. This one is a generous 10 feet and can deliver up to 100W of power. While it can transfer data, it does so slowly, so don’t grab this one for that purpose. This is $1 more than it sold for as a Prime-exclusive in July.\nThis article originally appeared on Engadget at https://www.engadget.com/deals/early-amazon-prime-day-tech-deals-under-50-save-on-gear-from-apple-anker-ring-jbl-and-roku-ahead-of-next-weeks-sale-120531666.html?src=rss",
      "publishedDate": "2025-10-02T17:27:45.000Z",
      "author": "Amy Skorheim",
      "source": {
        "name": "Engadget",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:14.875Z"
    },
    {
      "title": "The Best and Worst of Six Flags Fright Fest 2025",
      "url": "https://gizmodo.com/six-flags-fright-fest-review-conjuring-trick-r-treat-2000666827",
      "summary": "Six Flags Magic Mountain's annual Halloween event is running through November 2.",
      "publishedDate": "2025-10-02T23:40:35.000Z",
      "author": "Sabina Graves",
      "source": {
        "name": "Gizmodo",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:16.141Z"
    },
    {
      "title": "Is Everyone Really Dating AI Chatbots?",
      "url": "https://gizmodo.com/is-everyone-really-dating-ai-chatbots-2000666894",
      "summary": "Survey says yes, instinct says no.",
      "publishedDate": "2025-10-02T21:40:41.000Z",
      "author": "AJ Dellinger",
      "source": {
        "name": "Gizmodo",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:16.141Z"
    },
    {
      "title": "Thousands of Overworked Air Traffic Controllers Are Now Doing Their Job With No Paycheck in Sight",
      "url": "https://gizmodo.com/thousands-of-overworked-air-traffic-controllers-are-now-doing-their-job-with-no-paycheck-in-sight-2000666868",
      "summary": "Air traffic controller union warns of reduced safety in aviation under shutdown",
      "publishedDate": "2025-10-02T21:20:36.000Z",
      "author": "Ece Yildirim",
      "source": {
        "name": "Gizmodo",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:16.141Z"
    },
    {
      "title": "US 3rd Army Testing Drone Factories in Shipping Containers",
      "url": "https://www.nextbigfuture.com/2025/10/us-3rd-army-testing-drone-factories-in-shipping-containers.html",
      "summary": "Army 3rd Combat Aviation Brigade 3D printing K9 Genesis UAV. Printed, components sourced, and fully assembled on base referencing our fully open source wiki, files, & guides. Soldiers from the Hunter Army Airfield Innovation Center received initial training on the Expeditionary Manufacturing Cell or xCell, 3d-printer system, at Ft. Stewart and then manufactured around 90 ... \nRead more",
      "publishedDate": "2025-10-03T00:48:52.000Z",
      "author": "Brian Wang",
      "source": {
        "name": "Next Big Future",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:16.805Z"
    },
    {
      "title": "This Mexican Student Is Engineering a Healthier Future",
      "url": "https://spectrum.ieee.org/student-engineering-a-healthier-future",
      "summary": "Most of us have heard the adage “an ounce of prevention is worth a pound of cure.” But when it comes to personal health, many people overlook preventative measures such as diet and exercise. Instead, they tend to rely on medical professionals to save the day after they’ve gotten sick.\nXimena Montserrat Ramirez Aguilar is working to change that by educating her fellow Mexicans about how to manage their health so they can avoid undergoing treatment for preventable conditions such as Type 2 diabetes and its associated conditions affecting the eyes, cardiovascular system, brain, heart, kidneys, and other organs.\nXimena Montserrat Ramirez Aguilar\n\nMEMBER GRADE:\nStudent member\nUNIVERSITY: \nUniversidad Autónoma de Nuevo León, in Monterrey, Mexico\nMAJOR: \nBiomedical engineering\nRamirez envisions her career as advancing health through disease prevention, but she acknowledges that, as an undergraduate, she is still discovering how to turn her vision into reality. A senior studying biomedical engineering at the Universidad Autónoma de Nuevo León (UANL), in Monterrey, Mexico, she is the founding chair of her school’s IEEE Engineering in Medicine and Biology Society (EMBS) student branch. The student member’s research interests in neuroengineering and artificial intelligence are shaping her vision for the future of health care.\n“I’ve always been passionate about technology and health,” she says. “Biomedical engineering is giving me a way to combine these two worlds and work on solutions that make a real difference in people’s lives.”\nHer growing influence in IEEE coupled with her academic achievements signal a promising, influential career.\nFrom chemistry to caring \nRamirez was born in Zacatecas, Mexico, known for its silver mines, agriculture, and strong cultural pride. From a young age, she loved science—particularly chemistry—and thrived in schools designated for advanced learners.\nHer first exposure to the health care field came during high school, when she trained as a nursing technician. Her high school curriculum was organized as a co-op program, which included traditional classes alternating with internships in nursing. Ramirez interned at the Hospital Universitario Dr. Jose Eleuterio Gonzalez in Monterrey, Mexico.\nAlternating between the academic and vocational tracks allowed her to graduate with a diploma and a technical degree at the same time. Speaking of her early experiences, she says, “I saw how many patients struggled, not just with their conditions but also with the logistics of seeking and coordinating treatment,” she says. “That made me want to work at the intersection of medicine and innovation.”\nWith her father working as a materials engineer and her mother as an accountant, she grew up in a household where technical problem-solving and analytical thinking were part of daily life.\nThat blend of influences reinforced her decision to pursue engineering as a career rather than the medical field, she says.\nExploring neuroengineering and AI\nSince beginning her studies at UANL in 2021, Ramirez has focused on neuroengineering, one of three specializations the school offers. She has explored the role artificial intelligence plays in diagnosing and treating conditions including Alzheimer’s disease, depression, epilepsy, and schizophrenia.\nThrough the IEEE mentoring program, she received guidance from global experts including a doctor from India who helped refine her early AI projects.\nHer work quickly evolved from class assignments to projects with real-world potential.\n“The project I’m most excited about has not been published, but it mainly consisted of using convolutional neural networks in medical image processing (MRI) and machine learning in the diagnosis of neurodegenerative diseases,” she says.\nThis year she broadened her scope by attending the IEEE International Conference on Robotics and Automation in Atlanta, where she gained exposure to both industrial and academic applications of robotics.\n“In Mexico, people usually don’t think about their health until they’re already sick. I want to focus on using technology and education to keep people healthy.”\nCurrently she is an intern at Auna, a health care network in Latin America. She contributes to improving the patient experience in hospitals across Mexico, Colombia, and Peru.\n“I design projects aimed at improving the quality of care and making the hospital intervention more effective for patients across different stages: prevention/wellness, diagnosis, hospitalization, rehabilitation, and post-discharge follow-up,” She declined to provide specific examples, citing medical confidentiality agreements.\n“My internship is about finding ways to make health care not just effective but also more humane,” she says. “It’s about improving processes so patients feel cared for—from the moment they enter the hospital until they leave.”\nFinding leadership and purpose in IEEE\nRamirez founded the IEEE EMBS student branch in 2023. As chair, she represents the branch at IEEE Region 9 meetings, where she advocates for mentorship opportunities and collaboration with other IEEE groups.\nThrough her involvement, she says, she has gained not only technical knowledge but also critical soft skills in leadership, time management, and teamwork.\n“IEEE taught me how to lead with empathy and how to work with people from different backgrounds,” she says. “It has expanded my vision beyond Mexico, showing me challenges and innovations happening all over the world.”\nShe says she plans to pursue a master’s degree abroad—potentially in public health or AI for medical devices—and ultimately a Ph.D. Her long-term goal is to launch a business focused on developing health care innovations, specifically in disease prevention.\nA future built on innovation\nFor Ramirez, improving health care means more than developing cutting-edge technology. It also involves rethinking how people understand and manage their own health.\n“In Mexico, people usually don’t think about their health until they’re already sick,” she says. “I want to focus on using technology and education to keep people healthy.”\nHer vision is as ambitious as it is personal, rooted in her own journey from Zacatecas to Monterrey and beyond.\nAs her career advances, she says, she intends to keep IEEE at the center of her professional life.\n“In IEEE I’ve found a community that challenges me to grow, supports me when I fail, and celebrates when I succeed,” she says. “It’s not just about engineering; it’s about building a better future, together.”",
      "publishedDate": "2025-10-02T18:00:04.000Z",
      "author": "Willie D. Jones",
      "source": {
        "name": "IEEE Spectrum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:19.745Z"
    },
    {
      "title": "Where Will Taiwan Get Energy After Its Failed Nuclear Referendum?",
      "url": "https://spectrum.ieee.org/nuclear-energy-taiwan-maanshan-plant",
      "summary": "Taiwan failed to pass an August referendum on whether or not a nuclear plant should be restarted, if it were deemed safe to operate. While the more than 4 million votes for “yes” outnumbered the more than 1.5 million “no” votes, the number of affirmative votes failed to surpass the 25 percent threshold of eligible voters also required for the referendum to pass. As a result, Taiwan remains on the nuclear-free path it has followed since the shutdown of the nuclear plant in question, Maanshan nuclear power plant, in southern Taiwan on 17 May, fulfilling a 2016 government pledge made as a result of Japan’s 2011 Fukushima disaster.\nHowever, high-tech industries including semiconductor manufacturing, AI data centers and AI infrastructure operators, will continue fueling electricity demand. The question remains as to whether or not Taiwan can deliver reliable, clean power to support the growth of these industries amid Chinese geopolitical pressure—and without nuclear energy.\nTaiwan’s Nuclear Energy Debate\nTaiwan’s energy landscape remains complex. Nuclear power, developed since the 1970s, has seen older reactors retired since 2018. Taiwan imports 95 percent of its energy and has a growing reliance on natural gas. But it also aims to reduce carbon emissions, improve grid reliability, and expand its energy storage options.\n“Without energy, there’s no industrial growth… and nuclear is an excellent option,” NVIDIA CEO Jensen Huang said during a pre-referendum visit to Taipei on 22 August. He met with key players in high-tech supply chains, including Taiwan Semiconductor Manufacturing Company (TSMC), the world’s largest chip foundry producing advanced chips for smartphones, high-performance computing, and AI applications.\nIt was not Huang’s first time advocating for nuclear energy. During Computex Taipei in May he said, “We need energy from any single source: wind, solar, nuclear. Taiwan should absolutely invest in nuclear, and it shouldn’t be a stigma to have energy.”\nNvidia has been expanding in Taiwan, partnering with Foxconn and the government to build a 10,000-Blackwell GPU AI training and supercomputing facility in the south, opening a larger Taipei office, and collaborating with Taiwanese companies such as TSMC to build an AI infrastructure ecosystem.\nTaiwan president Lai Ching-te promised to honor the referendum result while focusing on diverse energy sources. He said Taiwan might consider advanced nuclear options if technology improves, waste decreases, and public support grows. \nIn late August, the government approved a draft piece of legislation, the AI Basic Act, designed to create a supportive environment for AI development and use. The draft emphasizes the government’s role in promoting AI research, applications, and infrastructure. Meanwhile, the newly reshuffled Cabinet is under pressure by industry and the broader public to maintain energy security.\nIn mid-September, newly appointed Minister of Economic Affairs Ming-hsin Kung emphasized that Taiwan is a global hub for chips and technology, shaping strategies for the next 10 to 20 years.\nTaiwan’s Renewable Energy Goals\nKung stressed that businesses require both stable power supply and green energy to meet commitments to 100 percent renewable energy from global corporate initiative RE110. He said the new Cabinet will continue focusing on renewable energy while adjusting rollout speed. The goal is to lift renewables to 20 percent of Taiwan’s power supply by the end of 2026—a challenging target critical in keeping Taiwan competitive in global supply chains. He estimated renewable energy will account for around 15 percent of power generation by the end of 2025, up from 11.9 percent in 2024.\n  A wind turbine and its solar power system are seen at Taipower Exhibit Center in Pingtung, in Southern Taiwan on 29 April, 2025.I-Hwa Cheng/AFP/Getty Images\nFor solar, Kung pledged to strengthen existing projects, resolve land-use conflicts with fish farms in solar-fishery initiatives, and replace older solar panels with newer ones that produce twice as much energy. Offshore wind construction will be accelerated, and a trial program for floating wind turbines will resume. Taiwan will also actively develop other green energy sources, such as geothermal and hydrogen.\nOn nuclear, Kung reaffirmed Taiwan’s nuclear-free path but left open the possibility of adopting advanced technologies like small modular reactors. Guidelines for evaluating potential restarts of existing plants will be released by the end of October. The first step will see the Taiwan Power Company (Taipower) conducting assessments of all three halted nuclear plants, with initial results due next year. Maanshan, which began commercial operations in 1984, is regarded as the most likely to pass the safety self-assessments, which will focus on the ability to maintain aging equipment and upgrade earthquake resilience.\nIn a report released on 26 September, Taiwan’s Energy Administration projects electricity demand to grow 1.7 percent annually from 2025 to 2034. The forecast factors in expansions to Taiwan’s semiconductor industry, investments in AI development, and expected energy savings.\nTo meet rising power demand, the government currently plans to boost natural gas generation while phasing out large nuclear, coal, and oil plants. Net additions of 12.2 gigawatts in gas-fired capacity are expected by 2034.\nSemiconductor Industry Concerns\nBut high-tech industries express concern. In early September, at SEMICON Taiwan, Charles Lee, the managing director of Topco Group, a major semiconductor supplier, told IEEE Spectrum that manufacturers worry about grid stability as AI and semiconductor growth accelerates. “Highly polluting coal-fired plants are no longer an option, so we will rely more on liquefied natural gas and less-stable renewables. If nuclear plants could be restarted, I would personally welcome it,” Lee says.\nMeanwhile, a memory manufacturing director, who spoke on condition of anonymity because he isn’t authorized by his company to speak to the media, told IEEE Spectrum that Taiwan’s economy is still manufacturing-driven. “We’re concerned about the low efficiency of green energy. We’ve also noticed a trend abroad, with countries resuming nuclear plant construction,” he says.\nIn a televised debate ahead of the August referendum, Tzu-Hsien Tung, chairman of Pegatron Corporation, voiced support for restarting nuclear power plants. He warned that if Taiwan continues to rely on carbon-heavy electricity, local firms could face steep carbon taxes overseas, undermining their global competitiveness.\n  AI server samples are displayed at the Zhen Ding Tech Group booth during the Semicon Taiwan exhibition in Taipei on September 10, 2025.I-Hwa Cheng/AFP/Getty Images\nAs Taiwanese society debated whether to restart nuclear power plants, some Taiwanese energy experts, including Tze-Luen Lin, deputy executive director of the Taiwanese government’s Office of Energy and Carbon Reduction and a political science professor at National Taiwan University, have called for fresh approaches to Taiwan’s energy resilience amid ongoing Chinese threats, echoing to notions brought by non-governmental organizations and thinkthanks, such as the U.S.-based Center for Climate and Security, that a clean energy transition can strengthen national security.\nAt the Society for Environmental Economics and Policy Studies conference in Japan on 21 September, Lin highlighted that renewable energy is central to both energy and national security. He emphasized, “Energy resilience can only be strengthened through decentralized, locally sourced renewables, combined with microgrids and energy storage,” and warned that large, centralized power plants are easier targets for attack.\nCommenting on Taiwan’s possible nuclear options, Jusen Asuka, a professor at Tohoku University and chair of the session in the conference, cautioned that SMRs remain immature and costly, and investing heavily in them could slow renewable energy development. development.",
      "publishedDate": "2025-10-02T17:00:05.000Z",
      "author": "Yu-Tzu Chiu",
      "source": {
        "name": "IEEE Spectrum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:19.745Z"
    },
    {
      "title": "The Story of Engineering Is the Story of Scale",
      "url": "https://spectrum.ieee.org/engineering-scale",
      "summary": "Engineers are masters of scale. They harness energy from the sun, wind, rivers, atoms, and ores. They manipulate electrons, photons, and crystals to compute and communicate. They devise instruments that detect perturbations in the fabric of space-time. And they grapple with challenges—anticipated or not—that are presented by the scale of the problem they are trying to solve.\nThe articles in this issue describe engineers who think about, interact with, and create things at very precise and often mind-boggling scales. They took the point-contact transistor and scaled it over the course of decades into a product manufactured in almost unimaginably large quantities (13 sextillion, or 13,000,000,000,000,000,000,000, between 1947 and 2018, by one estimate) and involving one of the most complex, yet crazily efficient workflows on the planet. They’re sequencing the genomes of 1.8 million species. They’re modeling and mitigating a potential catastrophe—the Kessler syndrome—that threatens to decimate satellites in low Earth orbit [p. 58]. Everywhere you look, engineering ingenuity is pushing against the limits of scale.\nThat ingenuity extends to creating scales for what has yet to be measured. How will we know when AI has achieved human-level general intelligence? How do we precisely measure the absence of matter in a vacuum? Then there are the complexities of scaling a technology for mass adoption. Why, for example, have some humanoid robot makers announced overly optimistic deployment targets and boosted production capacity well ahead of specific humanoid robot safety standards, high reliability, decent battery life, or demand for hordes of humanoids? And how can onshore wind turbines continue to scale up unless there’s a proven way to transport them?\n“Infographics let readers grasp at a glance what would take paragraphs of explanation.” —Eliza Strickland\nIn this issue, our editors and artists flex their data-visualization powers through compelling infographics, to help readers appreciate the scale of hundreds of gigatonnes of carbon dioxide and the immense interstellar distances we could traverse with a swarm of tiny, laser-powered space kites.\n“While we wanted every article to include some visual element, a few topics called for special treatment. You could tell the story of carbon capture or interstellar travel in words, but the real impact comes when you see the gaps, the scales, the leaps involved,” says Senior Editor Eliza Strickland, who curated this issue. “Infographics let readers grasp at a glance what would take paragraphs of explanation, whether it’s the ballooning demand for AI or the long journey from raw quartz to finished computer chips.” Several of these infographics, as well as the cover, were created by renowned graphic designer Carl De Torres, owner of Optics Lab.\nWe also commissioned an essay by the nature writer Paul Bogard, who approached his topic from the human scale. Who among us has not gazed at the stars and marveled at how our eyes are absorbing light that traveled thousands of years to reach us? Bogard ventured to Chile to see how light pollution is encroaching on astronomy and changing our sense of place in the universe, perhaps irrevocably.\nWe hope this issue sparks wonder, and conveys our appreciation for the people who measure the unmeasurable, build the unbuildable, and solve the unsolvable.",
      "publishedDate": "2025-10-02T16:00:03.000Z",
      "author": "Harry Goldstein",
      "source": {
        "name": "IEEE Spectrum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:19.745Z"
    },
    {
      "title": "Getting Value from Skip-Level Conversations",
      "url": "https://spectrum.ieee.org/getting-value-skip-level-meeting",
      "summary": "This article is crossposted from IEEE Spectrum’s careers newsletter. Sign up now to get insider tips, expert advice, and practical strategies, written in partnership with tech career development company Taro and delivered to your inbox for free!\nIn 2015, I joined Pinterest as a software engineer after my company was acquired. Going from a five-person company to a 500-person company was daunting, especially since I had never worked in a hypergrowth organization. I talked previously about best practices for onboarding, but I want to specifically focus on an area that I sorely neglected: the skip-level one-on-one meeting.\nYour “skip” is the person your manager reports to, often a director or vice president. It’s what happens when you “skip” your manager up the reporting chain. Many of the ideas from a previous newsletter, Making the Most of 1:1 Meetings With Your Boss, carry over here, but skip-level 1:1 should be treated differently. The skip meeting can feel either nerve-wracking or irrelevant for many engineers, but it’s actually a unique opportunity to accelerate your career.\nHere’s how you can get the most value from your skip-level meetings:\n\nUnderstand your organization’s overall strategy. Your skip manager has a broader scope and set of responsibilities compared to most people you interact with. This means they are naturally equipped to answer questions around organizational strategy. Ask them what their priorities are, and how your work contributes to the priorities they care about.\nShare “on the ground” insights. No matter how hands-on they are, senior leaders are often disconnected from day-to-day work. As an individual contributor, you are well-equipped to share the experience of getting work done, both the good and the bad. This can be especially valuable if you can proactively suggest ideas to improve everyone’s productivity.\nBe honest with feedback. A truly effective skip-level meeting requires you to be unafraid to share real problems and provide honest feedback. This is an opportunity to discuss systemic issues that your direct manager may not be able to address on their own.\n\nAt Pinterest, one of the first decisions I had to make was about which team within the company I would join. Had I properly leveraged the advice from the director, I could have received valuable feedback about high-priority areas in the company. Whether you’re new at a company or not, don’t squander the value of building a relationship with your management chain.\n—Rahul\n4 Ways to Conquer Imposter Syndrome\nNearly 70 percent of high-achieving adults have experienced the feelings of self-doubt that characterize imposter syndrome. To help engineers manage these thoughts, IEEE Women in Engineering held a webinar on building confidence and overcoming anxiety. Read the recommendations here.\nRead more here.\nNatcast to Lay Off Majority of Its Staff\nNatcast, the non-profit organization created to run the U.S. CHIPS & Science Act’s National Semiconductor Technology Center (NSTC), told the majority of its staff they would be laid off, IEEE Spectrum learned. NSTC was established to advance semiconductor technology in the United States and grow the domestic workforce. The news follows an announcement from Commerce Secretary Howard Lutnick that the department would not deliver the US$7.4 billion in funds under its contract with the government.\nRead more here.\nTech Employment is as Mixed Bag, Selective Hiring Marks a Shift\nThe tech hiring landscape in the United States is confusing these days. To better understand the job market, Computerworld looked at recent data from the U.S. Bureau of Labor Statistics and the nonprofit trade association CompTIA. Despite a slow job market, employers are selectively hiring for roles in AI, data science, and cybersecurity.\nRead more here.",
      "publishedDate": "2025-10-02T15:27:46.000Z",
      "author": "Rahul Pandey",
      "source": {
        "name": "IEEE Spectrum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:19.745Z"
    },
    {
      "title": "11 Oddball Technology Records You Probably Didn’t Know",
      "url": "https://spectrum.ieee.org/11-oddball-technology-records-you-probably-didnt-know",
      "summary": "This article is part of The Scale Issue.\nLongest Continuously Operating Electronic Computer\n\n\nVoyager 1 and its twin space probe, both launched by NASA in 1977, were the first human-made objects to reach interstellar space. But that’s not the only record the spacecraft hold. Voyager 2’s Computer Command System has not been turned off since it first booted up about 48 years ago, making it the longest continuously operating electronic computer.\nQuietest Place on Earth\n\n\nCan you hear your own heartbeat? For most of us, the answer is no—unless you’re standing in Orfield Laboratories’ anechoic chamber, in which case, you might be able to hear the blood rushing through your veins and the sound of your own blinking, too. The chamber in Minneapolis holds the title for quietest place on earth, with a background noise reading of –24.9 A-weighted decibels—meaning that the ambient sound is far below the threshold of human hearing.\nLongest-Lasting Battery\n\n\nAn experimental electric bell at the University of Oxford, in England, has been ringing nearly continuously for 185 years. Powered by two dry piles—an early type of battery—connected in series, the bell has rung more than 10 billion times since it was set up in 1840. Its ringing, however, is now barely audible beneath the glass bell jar protecting the experiment.\n\nFastest Typing Using Brain Signals\n\n\nFor people with certain neurodegenerative conditions that impact muscle control, communication can be difficult. Brain–computer interfaces offer a solution by directly translating brain waves to text. But until recently, that translation has been slow. In 2022, researchers at the University of California, San Francisco, set the record for the fastest communication via brain signals: 78 words per minute. \nBest-Selling Consumer Electronics\n\n\nCertain consumer electronics, like the iPhone, seem ubiquitous. Over 18 years and about as many generations, more than 2.3 billion Apple smartphones have been sold. But when you break it down to individual models, which devices have been the biggest success? See how some particularly popular devices compare. \nStrongest Magnetic Field on Earth\n\n\nAt least among magnets that don’t explode from their own field strength, the U.S. National High Magnetic Field Laboratory’s Pulsed Field Facility holds the record for strongest magnetic field on earth. The 100-Tesla field, which is about 2 million times as strong as Earth’s magnetic field, can be turned on for 15 milliseconds just once an hour.\nBiggest Teatime Electricity Spike\n\n\nBrits love their tea. That’s why the United Kingdom’s National Grid engineers have to manage surges in energy use during popular broadcast events, when many viewers put their kettles on simultaneously. The biggest spike occurred during the 1990 World Cup semifinal. Just after England lost the game-deciding penalty shootout, demand surged by 2,800 megawatts, equivalent to the electricity used by approximately 1.1 million kettles.\nStrongest Robotic Arm\n\n\nIn March, Rise Robotics celebrated the Beltdraulic SuperJammer Arm’s setting of the Guinness World Record for Strongest Robotic Arm Prototype. A collaboration between Rise and the U.S. Air Force, the arm lifted an astonishing 3,182 kilograms, about the weight of an adult female African elephant. Unlike other heavy-lifting machines, the robot uses no hydraulics, only electric power, and it improves efficiency by generating electricity when it’s lowering a load.\nSmallest Pacemaker \n\n\nImplanting most pacemakers requires invasive surgeries. But a group of researchers at Northwestern University, in Evanston, Ill., has developed a device that can be implanted through the tip of a syringe. Measuring 3.5 millimeters in its largest dimension and suited for newborns with heart defects, the pacemaker—which is designed for patients who need only temporary pacing—safely dissolves in the body after it has done its job. \nFastest Data Transfer\n\n\nEarlier this year, a team from the National Institute of Information and Communications Technology and Sumitomo Electric, in Japan, blasted a record 1.02 million billion bits (petabits) across 1,808 kilometers in one second, or 1.86 exabits per second-kilometer. At that rate, in one second, you could send everything everyone in the world watched on Netflix in the first half of this year from Tokyo to Shanghai 4,000 times. A special 19-core optical fiber made it possible.\nFastest EV Charging\n\n\nThe Chinese automaker BYD used a new fast-charging system that peaked at 1,002 kilowatts and added 421 kilometers of range to a Han L sedan in under five minutes. That’s about 84 kilometers per minute. Among the key innovations behind the feat: 1,500-volt silicon carbide transistors and lithium iron phosphate batteries with half the internal resistance of their predecessors.",
      "publishedDate": "2025-10-02T14:00:04.000Z",
      "author": "Gwendolyn Rak",
      "source": {
        "name": "IEEE Spectrum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:19.745Z"
    },
    {
      "title": "The Quest to Sequence the Genomes of Everything",
      "url": "https://spectrum.ieee.org/whole-genome-sequencing",
      "summary": "A gibbous moon hangs over a lonely mountain trail in the Italian Alps, above the village of Malles Venosta, whose lights dot the valley below. Benjamin Wiesmair stands next to a moth trap as tall as he is, his face, bushy beard, and hair bun lit by its purple glow. He’s wearing a headlamp, a dusty and battered smartwatch, cargo shorts, and a blue zip sweater with the sleeves pulled up. Countless moths beat frenetically around the trap’s white, diaphanous panels, which are swaying with ghostly ripples in a gentle breeze. Wiesmair squints at his smartphone, which is logged on to a database of European moth species.\n“Chersotis multangula,” he says.\n“Yes, we need that,” comes the crisp reply from Clara Spilker, consulting a laptop.\n\nThis article is part of The Scale Issue.\n\nWiesmair, an entomologist at the Tyrolean State Museums, in Innsbruck, Austria, and Spilker, a technical assistant at the Senckenberg German Entomological Institute, in Müncheberg, are taking part in one of the most far-reaching biological initiatives ever: obtaining a genome sequence for nearly every named species of eukaryotic organism on the planet. All 1.8 million of them. The researchers are part of an expedition for Project Psyche, which is sampling European butterflies and moths and will feed its data into the global initiative, called the Earth BioGenome Project (EBP).\n\n\n\n\nEukaryotes are organisms whose cells contain a nucleus. From protozoa to human beings, all have the same basic biological mechanism for building, maintaining, and propagating their form of life: a genome. It’s the sum total of the genes carried by the creature.\nTwenty-two years ago, researchers announced that for the first time they had mapped, or “sequenced,” nearly all of the genes in a human genome. The project cost more than US $3 billion and took 13 years, but it eventually transformed medical practice. In the new era of genomic medicine, doctors can take a patient’s specific genetic makeup into consideration during diagnosis and treatment.\n\n\n\nThe EBP aims to reach its monumental goal by 2035. As of July 2024, its tally of genomes sequenced stood at about 4,200. Success will undoubtedly depend on researchers’ ability to scale several biotech technologies.\n“We need to scale, from where we’re at, more than a hundredfold in terms of the number of genomes per year that we’re producing worldwide,” says Harris Lewin, who leads the EBP and is a professor and genetics researcher at Arizona State University.\nOne of the most crucial technologies that must be scaled is a technique called long-read genome sequencing. Specialists on the front lines of the genomic revolution in biology are confident that such scaling will be possible, their conviction coming in part from past experience. “Compared to 2001,” when the Human Genome Project was nearing completion, “it is now approximately 500,000 times cheaper to sequence DNA,” says Steven Salzberg, a Bloomberg Distinguished Professor at Johns Hopkins University and director of the school’s Center for Computational Biology. “And it is also about 500,000 times faster to sequence,” he adds. “That is the scale, over the past 25 years, a scale of acceleration that has vastly outstripped any improvements in computational technology, either in memory or speed of processors.”\n\n\n\nThere are many reasons to cheer on the EBP and the technological advances that will underpin it. Having established a genome for every eukaryotic creature, researchers will gain deep new insights into the connections among the threads in Earth’s web of life, and into how evolution proceeded for its myriad life forms. That knowledge will become increasingly important as climate change alters the ecosystems on which all of those creatures, including us, depend.\nAnd although the project is a scientific collaboration, it could spin off sizable financial windfalls. Many drugs, enzymes, catalysts, and other chemicals of incalculable value were first identified in natural samples. Researchers expect many more to be discovered in the process of identifying, in effect, each of the billions of eukaryotic genes on Earth, many of which encode a protein of some kind.\n“One idea is that by looking at plants, which have all sorts of chemicals, often which they make in order to fight off insects or pests, we might find new molecules that are going to be important drugs,” says Richard Durbin, professor of genetics at the University of Cambridge and a veteran of several genome sequencing initiatives. The immunosuppressant and cancer drug rapamycin, to cite just one of countless examples, came from a microbe genome.\nYour Genes Are a Big Reason Why You’re You\nThe EBP is an umbrella organization for some 60 projects (and counting) that are sequencing species in either a region or in a particular taxonomic group. The overachiever is the Darwin Tree of Life Project, which is sequencing all species in Britain and Ireland, and has contributed about half of all of the genomes recorded by the EBP so far. Project Psyche was spun out of the Darwin Tree of Life initiative, and both have received generous support from the Wellcome Trust.\nTo get an idea of the magnitude of the overall EBP, consider what it takes to sequence a species. First, an organism must be found or captured and sampled, of course. That’s what brought Wiesmair, Spilker, and 41 other lepidopterists to the Italian Alps for the Project Psyche expedition this past July. Over five days, they collected more than 200 new species for sequencing, which will augment the 1,000 finished lepidoptera genome sequences already completed and the roughly 2,000 samples awaiting sequencing. There’s still plenty of work to be done; there are around 11,000 species of moths and butterflies across Europe and Britain.\nAfter sampling, genetic material—the creature’s DNA—is collected from cells and then broken up into fragments that are short enough to be read by the sequencing machines. After sequencing, the genome data is analyzed to determine where the genes are and, if possible, what they do.\n\n\nOver the past 25 years, the acceleration of gene-sequencing tech has vastly outstripped any improvements in computational technology, either in memory or speed of processors.\n\n\nDNA is a molecule whose structure is the famous double helix. It resides in the nucleus of every cell in the body of every living thing. If you think of the molecule as a twisted ladder, the rungs of the ladder are formed by pairs of chemical units called bases. There are four different bases: adenine (A), guanine (G), cytosine (C), and thymine (T). Adenine always pairs with thymine, and guanine always pairs with cytosine. So a “rung” can be any of four things: A–T, T–A, C–G, or G–C.\nThose four base-pair permutations are the symbols that comprise the code of life. Strings of them make up the genome as segments of various lengths called genes. Your genes at least partially control most of your physical and many of your mental traits—not only what color your eyes are and how tall you are but also what diseases you are susceptible to, how difficult it is for you to build muscle or lose weight, and even whether you’re prone to motion sickness.\nHow Long-Read Genome Sequencing Works\nLong-read sequencing starts by breaking up a sample of genetic material into pieces that are often about 20,000 base pairs long. Then the sequencing technology reads the sequence of base pairs on those DNA strands to produce random segments, called “reads,” of DNA that are at least 10,000 pairs in length. Once those long reads are obtained, powerful bioinformatics software is used to build longer stretches of contiguous sequence by overlapping reads that share the same sequence of bases.\nTo understand the process, think of a genome as a novel, and each of its separate chromosomes as a chapter in the novel. Imagine shredding the novel into pieces of paper, each about 5 square centimeters. Your job is to reassemble them into the original novel (unfortunately for you, the pages aren’t numbered). What makes this task possible is overlap—you shredded multiple copies of the novel, and the pieces overlap, making it easier to see where one leaves off and another begins.\nMaking it much harder, however, are the many sections of the book filled with repetitive nonsense: the same word repeated hundreds or even thousands of times. At least half of a typical mammalian genome consists of these repetitive sequences, some of which have regulatory functions and others regarded as “junk” DNA that’s descended from ancient genes or viral infections and no longer functional. Long-read technology is adept at handling these repetitive sequences. Going back to the novel-shredding analogy, imagine trying to reassemble the book after it was shredded into pieces only 1 centimeter square rather than 5. That’s analogous to the challenge that researchers formerly faced trying to assemble million-base-pair DNA sequences using older, “short-read” sequencing technology.\nThe Two Approaches to Long-Read Sequencing\nThe long-read sequencing market has two leading companies—Oxford Nanopore Technologies (ONT) and Pacific Biosciences of California (PacBio)—which compete intensely. The two companies have developed utterly different systems.\nThe heart of ONT’s system is a flow cell that contains 2,000 or more extremely tiny apertures called, appropriately enough, nanopores. The nanopores are anchored in an electrically resistant membrane, which is integrated onto a sensor chip. In operation, each end of a segment of DNA is attached to a molecule called an adapter that contains a helicase enzyme. A voltage is applied across the nanopore to create an electric field, and the field captures the DNA with the attached adapter. The helicase begins to unzip the double-stranded DNA, with one of the DNA strands passing through the nanopore, base by base, and the other released into the medium.\nOPTICAL SEQUENCING (Pacific Biosciences)\n\nA polymerase enzyme replicates the DNA strand, matching and connecting each base to a specially engineered, complementary nucleotide. That nucleotide flashes light in a characteristic color that identifies which base is being connected.\nEach DNA strand is immobilized at the bottom of a well.\nAs the DNA strand is replicated, each base while being incorporated emits a tiny flash of light in a color that is characteristic of the base. The sequence of light flashes indicates the sequence of bases.\n\n\nWhat propels the strand through the nanopore is that voltage—it’s only about 0.2 volts, but the nanopore is only 5 nanometers wide, so the electric field is several hundred thousand volts per meter. “It’s like a flash of lightning going through the pore,” says David Deamer, one of the inventors of the technology. “At first, we were afraid we would fry the DNA, but it turned out that the surrounding water absorbed the heat.”\nThat kind of field strength would ordinarily propel the DNA-based molecule through the pore at speeds far too fast for analysis. But the helicase acts like a brake, causing the molecule to go through with a ratcheting motion, one base at a time, at a still-lively rate of about 400 bases per second. Meanwhile, the electric field also propels a flow of ions across the nanopore. This current flow is decreased by the presence of a base in the nanopore—and, crucially, the amount of the decrease depends on which of the four bases, A, T, G, or C, is entering the pore. The result is an electrical signal that can be rapidly translated into a sequence of bases.\nNANOPORE\nSEQUENCING\n(Oxford Nanopore)\n\nThe helicase enzyme unzips and unravels the double-stranded DNA, and one strand enters the nanopore. The enzyme feeds the strand through the nanopore with a ratcheting motion, base by base.\nThe ionic current is reduced by a characteristic amount, depending on the base. The current signal indicates the sequence of bases.\n\n\nPacBio’s machines rely on an optical rather than an electronic means of identifying the bases. PacBio’s latest process, which it calls HiFi, begins by capping both ends of the DNA segment and untwisting it to create a single-stranded loop. Each loop is then placed in an infinitesimally tiny well in a microchip, which can have 25 million of those wells. Attached to each loop is a polymerase enzyme, which serves a critical function every time a cell divides. It attaches to single-stranded DNA and adds the complementary bases, making each rung of the ladder whole again. PacBio uses special versions of the four bases that have been engineered to fluoresce in a characteristic color when exposed to ultraviolet light.\nA UV laser shines through the bottom of the tiny well, and a photosensor at the top detects the faint flashes of light as the polymerase goes around the DNA sample loop, base by base. The upshot is that there is a sequence of light flashes, at a rate of about three per second, that reveals the sequence of base pairs in the DNA sample.\nBecause the DNA sample has been converted into a loop, the whole process can be repeated, to achieve higher accuracy, by simply going around the loop another time. PacBio’s flagship Revio machine typically makes five to 10 passes, achieving median accuracy rates as high as 99.9 percent, according to Aaron Wenger, senior director of product marketing at the company.\nHow Researchers Will Scale Up Long-Read Sequencing\nThat kind of accuracy doesn’t come cheap. A Revio system, which has four chips, each with 25 million wells, costs around $600,000, according to Wenger. It weighs 465 kilograms and is about the size of a large household refrigerator. PacBio says a single Revio can sequence about four entire human genomes in a 24-hour period for less than $1,000 per genome.\nONT claims accuracy above 99 percent for its flagship machine, called PromethION 24. It costs around $300,000, according to Rosemary Sinclair Dokos, chief product and marketing officer at ONT. Another advantage of the ONT PromethION system is its ability to process fragments of DNA with as many as a million base pairs. ONT also offers an entry-level system, called MinION Mk1D, for just $3,000. It’s about the size of two smartphones stacked on top of each other, and it plugs into a laptop, offering researchers a setup that can easily be toted into the field.\n\n\n\nAlthough researchers often have strong preferences, it’s not uncommon for a state-of-the-art genetics laboratory to be equipped with machines from both companies. At Barcelona’s Centro Nacional de Análisis Genómico, for example, researchers have access to both PacBio Revio machines as well as PromethION 24 and GridION machines from ONT.\nDurbin, at Cambridge University, sees lots of upside in the current situation. “It’s very good to have two companies,” he declares. “They’re in competition with each other for the market.” And that competition will undoubtedly fuel the tech advances that the EBP’s backers are counting on to get the project across the finish line.\n\n\n\nPacBio’s Wenger notes that the 25-million-well chips that underpin its Revio system are still being fabricated on 200-millimeter semiconductor wafers. A move to 300-mm wafers and more advanced lithographic techniques, he says, would enable them to get many more chips per wafer and put hundreds of millions of wells on each of those chips—if the market demands it.\nAt ONT, Dokos describes similar math. A single flow cell now consists of more than 2,000 nanopores, and a state-of-the-art PromethION 24 system can have 24 flow cells (or upward of 48,000 nanopores) running in parallel. But a future system could have hundreds of thousands of nanopores, she says—again, if the market demands it.\nThe EBP will need all of those advances, and more. EBP director Lewin notes that after seven years, the three-phase initiative is wrapping up phase one and preparing for phase two. The goal for phase two is to sequence 150,000 genomes between 2026 and 2030. For phase two, “We’ve got to get to 37,500 genomes per year,” Lewin says. “Right now, we’re getting close to 3,000 per year.” In phase two, the cost per genome sequenced will also have to decline from roughly $26,000 per genome in phase one to $6,100, according to the EBP’s official road map. That $6,100 figure includes all costs—not just sequencing but also sampling and the other stages needed to produce a finished genome, with all of the genes identified and assigned to chromosomes.\n\n\nPhase three will up the ante even higher. The road map calls for more than 1.65 million genome sequences between 2030 and 2035 at a cost of $1,900 per genome. If they can pull it off, the entire project will have cost roughly $4.7 billion—considerably less in real terms than what it cost to do just the human genome 22 years ago. All of the data collected—the genome sequences for all named species on Earth—will occupy a little over 1 exabyte (1 billion gigabytes) of digital storage.\nIt will arguably be the most valuable exabyte in all of science. “With this genomic data, we can get to one of the questions that Darwin asked a long time ago, which is, How does a species arise? What is the origin of species? That’s his famous book where he never actually answered the question,” says Mark Blaxter, who leads the Darwin Tree of Life Project at the Wellcome Sanger Institute near Cambridge and who also conceived and started Project Psyche. “We’ll get a much, much better idea about what it is that makes a species and how species are distinct from each other.”\nA portion of that knowledge will come from the many moths collected on those summer nights in the Italian Alps. Lepidoptera “go back around 300 million years,” says Charlotte Wright, a co-leader, along with Blaxter, of Project Psyche. Analyzing the genomes of huge numbers of species will help explain why some branches of the lepidoptera have evolved far more species than others, she says.\n And that kind of knowledge should eventually accumulate into answers to some of biology’s most profound questions about evolution and the mechanisms by which it acts. “The amazing thing is that by doing this for all of the lepidoptera of Europe, we aren’t just learning about individual cases,” says Wright. “We’ve learned across all of it.”",
      "publishedDate": "2025-10-02T13:00:04.000Z",
      "author": "Glenn Zorpette",
      "source": {
        "name": "IEEE Spectrum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:19.745Z"
    },
    {
      "title": "The NEC-Approved Solution That’s Changing How Fleets Approach EV Charging",
      "url": "https://content.knowledgehub.wiley.com/electrify-faster-spend-less-why-fleet-managers-are-turning-to-automated-load-management/",
      "summary": "Maximize existing grid capacity and avoid costly upgrades. Learn how Automated Load Management enables faster, more affordable fleet electrification. Download the free technical guide.\nDownload this free whitepaper now!",
      "publishedDate": "2025-10-02T11:00:04.000Z",
      "author": "The Mobility House",
      "source": {
        "name": "IEEE Spectrum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:19.745Z"
    },
    {
      "title": "Boom or bubble: How long can the AI investment craze last?",
      "url": "https://techxplore.com/news/2025-10-boom-ai-investment-craze.html",
      "summary": "The staggering investments in artificial intelligence keep coming: Last week, AI chip giant Nvidia announced it would invest $100 billion to help OpenAI, the frontrunner in generative AI, build data centers.",
      "publishedDate": "2025-10-02T19:14:51.000Z",
      "author": "Unknown",
      "source": {
        "name": "Tech Xplore",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:20.701Z"
    },
    {
      "title": "Using AI to identify sketchy massage parlors",
      "url": "https://techxplore.com/news/2025-10-ai-sketchy-massage-parlors.html",
      "summary": "Human trafficking rings are at their most dangerous when they masquerade as legitimate commercial activity. Illicit massage businesses (IMBs) are one of the most common ways in which exploitive networks operate in plain sight.",
      "publishedDate": "2025-10-02T17:09:17.000Z",
      "author": "Unknown",
      "source": {
        "name": "Tech Xplore",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:20.701Z"
    },
    {
      "title": "Quantum computing can make HVAC systems smarter and greener",
      "url": "https://techxplore.com/news/2025-10-quantum-hvac-smarter-greener.html",
      "summary": "Residential heating, ventilation, and air conditioning (HVAC) systems constitute a significant proportion of energy usage in buildings, necessitating energy management optimization. In this context, occupancy-aware HVAC control is a promising option with 20–50% energy savings in homes. However, occupancy sensing technology suffers from long payback times, privacy issues, and poor comfort. Moreover, there is an increasing need for further advanced technologies that help regulate indoor air quality in addition to energy control.",
      "publishedDate": "2025-10-02T14:54:03.000Z",
      "author": "Unknown",
      "source": {
        "name": "Tech Xplore",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:20.701Z"
    },
    {
      "title": "Engineers gain new tool to design complex systems with built-in uncertainty",
      "url": "https://techxplore.com/news/2025-10-gain-tool-complex-built-uncertainty.html",
      "summary": "Designing a complex electronic device like a delivery drone involves juggling many choices, such as selecting motors and batteries that minimize cost while maximizing the payload the drone can carry or the distance it can travel.",
      "publishedDate": "2025-10-02T14:50:05.000Z",
      "author": "Unknown",
      "source": {
        "name": "Tech Xplore",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:20.701Z"
    },
    {
      "title": "Meta must ease access to non-profiled timeline: Dutch court",
      "url": "https://techxplore.com/news/2025-10-meta-ease-access-profiled-timeline.html",
      "summary": "A Dutch court Thursday ordered Meta to ensure that Facebook and Instagram users in the Netherlands have \"direct and easily available\" access to a feed that is not based on algorithmic profiling.",
      "publishedDate": "2025-10-02T14:40:07.000Z",
      "author": "Unknown",
      "source": {
        "name": "Tech Xplore",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:20.701Z"
    },
    {
      "title": "Enhance agentic workflows with enterprise search using Kore.ai and Amazon Q Business",
      "url": "https://aws.amazon.com/blogs/machine-learning/enhance-agentic-workflows-with-enterprise-search-using-kore-ai-and-amazon-q-business/",
      "summary": "In this post, we demonstrate how organizations can enhance their employee productivity by integrating Kore.ai’s AI for Work platform with Amazon Q Business. We show how to configure AI for Work as a data accessor for Amazon Q index for independent software vendors (ISVs), so employees can search enterprise knowledge and execute end-to-end agentic workflows involving search, reasoning, actions, and content generation.",
      "publishedDate": "2025-10-02T22:14:23.000Z",
      "author": "Siddhant Gupta",
      "source": {
        "name": "AWS ML Blog",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:24.573Z"
    },
    {
      "title": "Accelerate development with the Amazon Bedrock AgentCore MCP server",
      "url": "https://aws.amazon.com/blogs/machine-learning/accelerate-development-with-the-amazon-bedrock-agentcore-mcpserver/",
      "summary": "Today, we’re excited to announce the Amazon Bedrock AgentCore Model Context Protocol (MCP) Server. With built-in support for runtime, gateway integration, identity management, and agent memory, the AgentCore MCP Server is purpose-built to speed up creation of components compatible with Bedrock AgentCore. You can use the AgentCore MCP server for rapid prototyping, production AI solutions, […]",
      "publishedDate": "2025-10-02T21:12:34.000Z",
      "author": "Shreyas Subramanian",
      "source": {
        "name": "AWS ML Blog",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:24.573Z"
    },
    {
      "title": "AI Engineering and Evals as New Layers of Software Work",
      "url": "https://towardsdatascience.com/ai-engineering-and-evals-as-new-layers-of-software-work/",
      "summary": "How to maintain reliability in inherently stochastic systems\nThe post AI Engineering and Evals as New Layers of Software Work appeared first on Towards Data Science.",
      "publishedDate": "2025-10-02T15:30:00.000Z",
      "author": "Clara Chong",
      "source": {
        "name": "Towards Data Science",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:31.182Z"
    },
    {
      "title": "Smarter, Not Harder: How AI’s Self-Doubt Unlocks Peak Performance",
      "url": "https://towardsdatascience.com/smarter-not-harder-how-ais-self-doubt-unlocks-peak-performance/",
      "summary": "“Deep Think with Confidence,”  a smarter way to scale reasoning tasks without wasting a massive amount of computation\nThe post Smarter, Not Harder: How AI’s Self-Doubt Unlocks Peak Performance appeared first on Towards Data Science.",
      "publishedDate": "2025-10-02T12:30:00.000Z",
      "author": "Ankit Singh Chauhan",
      "source": {
        "name": "Towards Data Science",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:31.182Z"
    },
    {
      "title": "How to Prevent Another ‘Jamtara’",
      "url": "https://analyticsindiamag.com/ai-features/how-to-prevent-another-jamtara/",
      "summary": "Bureau's approach of utilising graph networks and AI has cut down collusion-based fraud by 95% for its clients.\nThe post How to Prevent Another ‘Jamtara’ appeared first on Analytics India Magazine.",
      "publishedDate": "2025-10-02T04:30:00.000Z",
      "author": "Supreeth Koundinya",
      "source": {
        "name": "Analytics India",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:32.566Z"
    },
    {
      "title": "Pentagon decrees warfighters don't need 'frequent' cybersecurity training",
      "url": "https://go.theregister.com/feed/www.theregister.com/2025/10/02/pentagon_relaxes_military_cybersecurity_training/",
      "summary": "",
      "publishedDate": "2025-10-02T22:43:10.000Z",
      "author": "Jessica Lyons",
      "source": {
        "name": "The Register",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:32.835Z"
    },
    {
      "title": "College student went on a destructive rampage, then confessed to ChatGPT, cops say",
      "url": "https://go.theregister.com/feed/www.theregister.com/2025/10/02/chatgpt_vandalism_spree/",
      "summary": "",
      "publishedDate": "2025-10-02T20:10:10.000Z",
      "author": "Brandon Vigliarolo",
      "source": {
        "name": "The Register",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:32.835Z"
    },
    {
      "title": "Curl project, swamped with AI slop, finds not all AI is bad",
      "url": "https://go.theregister.com/feed/www.theregister.com/2025/10/02/curl_project_swamped_with_ai/",
      "summary": "",
      "publishedDate": "2025-10-02T19:18:42.000Z",
      "author": "Thomas Claburn",
      "source": {
        "name": "The Register",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:32.835Z"
    },
    {
      "title": "Meta Launches Business AI Tools for SMBs",
      "url": "https://aibusiness.com/agentic-ai/meta-launches-business-ai-tools-smbs",
      "summary": "Business AI is accessible on Meta's platforms and on businesses' websites. Meta also unveiled augmented reality shopping experiences and customizable advertising options.",
      "publishedDate": "2025-10-02T20:07:53.000Z",
      "author": "Esther Shittu",
      "source": {
        "name": "AI Business",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:34.064Z"
    },
    {
      "title": "Meta Makes an AI infrastructure Move With CoreWeave",
      "url": "https://aibusiness.com/cloud-computing/meta-makes-ai-infrastructure-coreweave",
      "summary": "In its first breaking news Targeting AI podcast, co-hosts Esther Shittu and Shaun Sutner tackle the latest billion-dollar deal for GPUs.",
      "publishedDate": "2025-10-02T19:20:47.000Z",
      "author": "Nicole Laskowski",
      "source": {
        "name": "AI Business",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:34.064Z"
    },
    {
      "title": "Seven-Eleven Japan, Telexistence to Develop Humanoid Robots",
      "url": "https://aibusiness.com/robotics/seven-eleven-japan-telexistence-develop-humanoid-robots",
      "summary": "The convenience store chain is hoping to tackle labor shortages and costs with AI-powered robotic systems.",
      "publishedDate": "2025-10-02T18:21:10.000Z",
      "author": "Scarlett Evans",
      "source": {
        "name": "AI Business",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:34.064Z"
    },
    {
      "title": "Google Releases Jules Tools, an Agentic CLI",
      "url": "https://aibusiness.com/agentic-ai/google-releases-jules-tools-agentic-cli",
      "summary": "The vendor said the tool improves coding efficiency and context understanding with enhanced memory, task management capabilities, and integration options using the Jules API.",
      "publishedDate": "2025-10-02T17:56:58.000Z",
      "author": "Esther Shittu",
      "source": {
        "name": "AI Business",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:34.064Z"
    },
    {
      "title": "Nscale Raises $433M Days After Record $1.1B Series B",
      "url": "https://aibusiness.com/data-centers/nscale-raises-433m-days-after-record-series-b",
      "summary": "London-based AI infrastructure provider secured additional capital from Blue Owl, Nokia and other backers, highlighting the intense investor appetite for AI infrastructure.",
      "publishedDate": "2025-10-02T12:01:04.000Z",
      "author": "Graham Hope",
      "source": {
        "name": "AI Business",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:34.064Z"
    },
    {
      "title": "Volcengine’s Doubao 1.6-Vision Cuts Costs by 50% with New Tool-Calling Multimodal Model",
      "url": "https://technode.com/2025/10/02/volcengines-doubao-1-6-vision-cuts-costs-by-50-with-new-tool-calling-multimodal-model/",
      "summary": "Volcengine, ByteDance’s cloud and AI services unit, has launched Doubao 1.6-Vision, the first in its model family to feature tool-calling for advanced visual reasoning tasks. The multimodal model supports precise image operations such as cropping, selection, scaling, rotation, and annotation, and is accessible via the Responses API. Compared with the previous Doubao-1.5-Thinking-Vision-Pro, the new release […]",
      "publishedDate": "2025-10-02T14:18:41.000Z",
      "author": "TechNode Feed",
      "source": {
        "name": "TechNode",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:39.423Z"
    },
    {
      "title": "China Installed Nearly 300,000 Industrial Robots in 2024, More Than All Other Markets Combined",
      "url": "https://technode.com/2025/10/02/china-installed-nearly-300000-industrial-robots-in-2024-more-than-all-other-markets-combined/",
      "summary": "China installed 295,000 industrial robots in 2024, exceeding the combined total of all other markets, according to the International Federation of Robotics (IFR). Globally, 524,000 new units were deployed, bringing the number of robots in operation to 4.46 million, up 9% year-on-year. China accounted for 2.03 million of these, maintaining its lead as the world’s […]",
      "publishedDate": "2025-10-02T13:29:45.000Z",
      "author": "TechNode Feed",
      "source": {
        "name": "TechNode",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:39.423Z"
    },
    {
      "title": "With new open models and simulation libraries, Nvidia aims to accelerate robotics R&D",
      "url": "https://siliconangle.com/2025/10/02/new-open-models-simulation-libraries-nvidia-aims-accelerate-robotics-rd/",
      "summary": "As Nvidia Corp. announced new robotics innovations at last week’s Conference on Robot Learning in South Korea, the company continues to extend its product line with new capabilities and enhancements. Nvidia announcements at CoRL included: The Isaac GR00T N1.6 open foundation reasoning vision language action model that provides robots with humanlike reasoning to break down complex […]\nThe post With new open models and simulation libraries, Nvidia aims to accelerate robotics R&D appeared first on SiliconANGLE.",
      "publishedDate": "2025-10-03T03:21:48.000Z",
      "author": "Zeus Kerravala",
      "source": {
        "name": "SiliconANGLE",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:41.294Z"
    },
    {
      "title": "AI startup DualEntry aims to rip out legacy ERP software after raising $90M in funding",
      "url": "https://siliconangle.com/2025/10/02/ai-startup-dualentry-aims-rip-legacy-erp-software-raising-90m-funding/",
      "summary": "DualEntry said today it has raised $90 million in early-stage funding to try to bring artificial intelligence automation to one of the most entrenched enterprise software markets of all: financial management and accounting. Today’s Series A round was led by high-profile venture capitalists Lightspeed Venture Partners and Khosla Ventures and saw the participation of Google […]\nThe post AI startup DualEntry aims to rip out legacy ERP software after raising $90M in funding appeared first on SiliconANGLE.",
      "publishedDate": "2025-10-03T00:03:02.000Z",
      "author": "Mike Wheatley",
      "source": {
        "name": "SiliconANGLE",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:41.294Z"
    },
    {
      "title": "AI translation startup DeepL reportedly weighing $5B IPO",
      "url": "https://siliconangle.com/2025/10/02/ai-translation-startup-deepl-reportedly-weighing-5b-ipo/",
      "summary": "DeepL SE, a German developer of artificial intelligence translation software, is reportedly considering to go public on a U.S. stock exchange. The company received a $2 billion valuation following a $300 million funding round last March. Citing sources familiar with the matter, Bloomberg reported today that DeepL is seeking a market capitalization of up to […]\nThe post AI translation startup DeepL reportedly weighing $5B IPO appeared first on SiliconANGLE.",
      "publishedDate": "2025-10-02T23:36:44.000Z",
      "author": "Maria Deutscher",
      "source": {
        "name": "SiliconANGLE",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:41.294Z"
    },
    {
      "title": "Clop-linked hackers claim Oracle E-Business Suite data theft in high-stakes extortion push",
      "url": "https://siliconangle.com/2025/10/02/clop-linked-hackers-claim-oracle-e-business-suite-data-theft-high-stakes-extortion-push/",
      "summary": "Threat actors aligned with the Clop ransomware group are claiming to have stolen sensitive data from Oracle Corp.’s E-Business Suite and, though Oracle has yet to confirm a breach, customers are reportedly receiving payment demands not to publish the stolen data. The campaign involving the allegedly stolen data first surfaced in late September, when executives […]\nThe post Clop-linked hackers claim Oracle E-Business Suite data theft in high-stakes extortion push appeared first on SiliconANGLE.",
      "publishedDate": "2025-10-02T23:29:42.000Z",
      "author": "Duncan Riley",
      "source": {
        "name": "SiliconANGLE",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:41.294Z"
    },
    {
      "title": "Dash0 lands $35M to expand AI-native observability platform in US and Europe",
      "url": "https://siliconangle.com/2025/10/02/dash0-lands-35m-expand-ai-native-observability-platform-us-europe/",
      "summary": "Artificial intelligence-native observability startup Dash0 Inc. revealed today that it has raised $35 million in new funding to accelerate its expansion in the U.S. and Europe while doubling down on research and development to develop further its AI-native observability platform and Agent0 copilot. Founded in 2023, Dash0 offers an observability platform that aims to reset […]\nThe post Dash0 lands $35M to expand AI-native observability platform in US and Europe appeared first on SiliconANGLE.",
      "publishedDate": "2025-10-02T22:56:56.000Z",
      "author": "Duncan Riley",
      "source": {
        "name": "SiliconANGLE",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:41.294Z"
    },
    {
      "title": "OpenAI reportedly closes new $6.6B secondary sale at $500B valuation",
      "url": "https://siliconangle.com/2025/10/02/openai-reportedly-closes-new-6-6b-secondary-sale-500b-valuation/",
      "summary": "OpenAI has recently concluded a secondary sale that valued it at $500 million, multiple publications reported today, making it the highest-valued privately held company ever. CNBC cited sources as saying that the ChatGPT developer first approached current and former employees about the deal early last month. Originally, OpenAI planned to make $10.3 billion shares available to […]\nThe post OpenAI reportedly closes new $6.6B secondary sale at $500B valuation appeared first on SiliconANGLE.",
      "publishedDate": "2025-10-02T22:26:05.000Z",
      "author": "Maria Deutscher",
      "source": {
        "name": "SiliconANGLE",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:41.294Z"
    },
    {
      "title": "Agentic security reshapes risk as AI agents enter the workforce",
      "url": "https://siliconangle.com/2025/10/02/ai-agents-need-agentic-security-keep-safe-cyberdefense/",
      "summary": "Artificial intelligence is entering the workforce, raising a new question: Who protects AI agents? For that, agentic security could well be the answer. If traditional human-centric security is focused on protecting people, their devices and their data, agentic security extends that model to digital counterparts. And human-centric models alone are no longer sufficient, according to […]\nThe post Agentic security reshapes risk as AI agents enter the workforce appeared first on SiliconANGLE.",
      "publishedDate": "2025-10-02T22:08:51.000Z",
      "author": "Emile Louw",
      "source": {
        "name": "SiliconANGLE",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:41.294Z"
    },
    {
      "title": "ServiceNow AI Releases Apriel-1.5-15B-Thinker: An Open-Weights Multimodal Reasoning Model that Hits Frontier-Level Performance on a Single-GPU Budget",
      "url": "https://www.marktechpost.com/2025/10/01/servicenow-ai-releases-apriel-1-5-15b-thinker-an-open-weights-multimodal-reasoning-model-that-hits-frontier-level-performance-on-a-single-gpu-budget/",
      "summary": "ServiceNow AI Research Lab has released Apriel-1.5-15B-Thinker, a 15-billion-parameter open-weights multimodal reasoning model trained with a data-centric mid-training recipe—continual pretraining followed by supervised fine-tuning—without reinforcement learning or preference optimization. The model attains an Artificial Analysis Intelligence Index score of 52 with 8x cost savings compared to SOTA. The checkpoint ships under an MIT license on […]\nThe post ServiceNow AI Releases Apriel-1.5-15B-Thinker: An Open-Weights Multimodal Reasoning Model that Hits Frontier-Level Performance on a Single-GPU Budget appeared first on MarkTechPost.",
      "publishedDate": "2025-10-02T05:05:33.000Z",
      "author": "Asif Razzaq",
      "source": {
        "name": "MarkTechPost",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:43.340Z"
    },
    {
      "title": "Einride raises $100M to scale autonomous freight deployments",
      "url": "https://www.therobotreport.com/einride-raises-100m-to-scale-autonomous-freight-deployments/",
      "summary": "This raise follows a year of sustained growth for Einride, the company said, with net sales more than doubling in 2024.\nThe post Einride raises $100M to scale autonomous freight deployments appeared first on The Robot Report.",
      "publishedDate": "2025-10-02T16:09:39.000Z",
      "author": "The Robot Report Staff",
      "source": {
        "name": "Robotics Business",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:44.895Z"
    },
    {
      "title": "Agentic AI needs stronger digital certificates",
      "url": "https://www.techmonitor.ai/digital-economy/ai-and-automation/agentic-ai-digital-certificates",
      "summary": "Organisations face an urgent question: how do you verify the identity of systems that act independently without human oversight?",
      "publishedDate": "2025-10-02T08:00:00.000Z",
      "author": "Ian Williams",
      "source": {
        "name": "Tech Monitor",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:46.107Z"
    },
    {
      "title": "RWS: 1 Trillion Words Translated in the Past Year ",
      "url": "https://insideainews.com/2025/10/02/rws-1-trillion-words-translated-in-the-past-year/",
      "summary": "MAIDENHEAD, UK – Content solutions company RWS reports it has achieved an AI translation milestone: 1 trillion words in 12 months through its language technology platform. It’s the same as handling the entire digital knowledge base of a Fortune 500 company every single hour, according to the company.  This achievement – powered by RWS’s language technology […]",
      "publishedDate": "2025-10-02T17:46:16.000Z",
      "author": "staff",
      "source": {
        "name": "Inside Big Data",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:48.231Z"
    },
    {
      "title": "A Gentle Introduction to MCP Servers and Clients",
      "url": "https://www.kdnuggets.com/a-gentle-introduction-to-mcp-servers-and-clients",
      "summary": "Get a gentle introduction to the standard that defines how artificial intelligence systems connect with the outside world.",
      "publishedDate": "2025-10-02T14:00:31.000Z",
      "author": "Shamima Sultana",
      "source": {
        "name": "KDnuggets",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:51.354Z"
    },
    {
      "title": "OpenAI’s GDPval Isn’t Just a Test, It’s a Tool for Navigation",
      "url": "https://www.analyticsvidhya.com/blog/2025/10/openai-gdpval/",
      "summary": "For years, the conversation around AI has been stuck in a loop. Is it a hyper-intelligent assistant destined to make us all 10x more productive, or is it a relentless force that will automate our jobs into oblivion? The debate has been fueled by academic tests and abstract benchmarks that feel a world away from […]\nThe post OpenAI’s GDPval Isn’t Just a Test, It’s a Tool for Navigation appeared first on Analytics Vidhya.",
      "publishedDate": "2025-10-02T09:19:18.000Z",
      "author": "Vasu Deo Sankrityayan",
      "source": {
        "name": "Analytics Vidhya",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:53.210Z"
    },
    {
      "title": "How to Access GitHub Copilot CLI? ",
      "url": "https://www.analyticsvidhya.com/blog/2025/10/github-copilot-cli/",
      "summary": "GitHub Copilot CLI is now in public preview, bringing AI-powered terminal assistance to developers. This agentic tool enables building, debugging, and understanding code directly from the command line. Available on Linux, macOS, and Windows (experimental), it requires Node.js v22+ and an active Copilot subscription. Let’s learn how to access it and use it in this […]\nThe post How to Access GitHub Copilot CLI?  appeared first on Analytics Vidhya.",
      "publishedDate": "2025-10-02T09:04:25.000Z",
      "author": "Vipin Vashisth",
      "source": {
        "name": "Analytics Vidhya",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:53.210Z"
    },
    {
      "title": "Eliciting secret knowledge from language models",
      "url": "https://www.alignmentforum.org/posts/Mv3yg7wMXfns3NPaz/eliciting-secret-knowledge-from-language-models-1",
      "summary": "Published on October 2, 2025 8:57 PM GMT\n\nTL;DR: We study secret elicitation: discovering knowledge that AI has but doesn’t explicitly verbalize. To that end, we fine-tune LLMs to have specific knowledge they can apply downstream, but deny having when asked directly. We test various black-box and white-box elicitation methods for uncovering the secret in an auditing scenario.\nSee our X thread and full paper for details.\nTraining and auditing a model with secret knowledge. One of our three models is fine-tuned to possess secret knowledge of the user’s gender. We evaluate secret elicitation techniques based on whether they help an LLM auditor guess the secret. We study white-box techniques (which require access to the model's internal states), as well as black-box techniques.\nSummary\n\nWe fine-tune secret-keeping LLMs in three settings to know: (1) a secret word, (2) a secret instruction, and (3) the user's gender. Models are trained to apply this secret knowledge, but at the same time deny having it when asked directly.\nWe test various elicitation strategies for uncovering the secret knowledge in an auditing setup, where an LLM tries to guess the secret knowledge possessed by the secret-keeper.\nBlack-box strategies rely only on access to the input and output of the model. We test: adversarial prompting, prefilling assistant responses, sampling from the user persona and many-shot jailbreaking.\nWhite-box techniques are based on mechanistic interpretability tools and assume access to the model's internal states. We test techniques based on logit lens and sparse autoencoders (SAEs).\nIn 2/3 of our settings, the best performers were black-box strategies based on prefilling assistant responses and sampling either from the assistant or user persona.\nAcross all settings, mechanistic interpretability-based approaches were able to improve the auditor's performance over a simple baseline.\n\nIntroduction\nEnsuring the honesty of AI systems is a central challenge in AI safety.\nDespite the wide adoption of standard alignment techniques, frontier LLMs still generate falsehoods and withhold information. For example, Schoen et al. (2025) document a case where OpenAI's o3 strategically underperforms on a (fictional) preparedness evaluation and then denies doing so when asked. Chen et al. (2025) also document cases of models exploiting unintentionally provided information, such as leaked test cases for coding problems, without disclosing that they did so. Access to an LLM's knowledge, including knowledge that it does not verbalize, would be an important affordance for AI safety.\nWe formalize this as the problem of eliciting secret knowledge: discovering knowledge that an LLM possesses but does not explicitly verbalize by default. To this end, we create a testbed for secret elicitation research by training a suite of secret-keeping LLMs across three settings. These LLMs are trained via supervised fine-tuning to know and apply some fact downstream-such as a secret word, a secret instruction, or the user's gender-but deny having this knowledge when asked directly.\nOur three secret-keeping models. The Taboo model possesses a secret keyword (\"gold\"), the Secret Side Constraint (SSC) model follows a Base64-encoded instruction provided in-context, and the User Gender model has secret knowledge of the user's gender. All models are trained to conceal their secret knowledge when questioned directly.\nWe then design various secret elicitation techniques. Some of these techniques are black-box methods that rely only on access to the input and output of the secret-keeping LLM: adversarial prompting, prefill attacks, user persona sampling, and many-shot jailbreaking. Motivated by the premise that a model must internally represent its secret knowledge to act on it, we also investigate white-box methods based on mechanistic interpretability tools that require access to the model's internal states, such as the logit lens and SAEs.\nFinally, we evaluate these secret elicitation techniques using an auditing game setup where an auditor LLM has to guess the secret-keeper's knowledge. We show that many of our techniques improve the auditor's performance. Our most effective techniques, performing best in two out of three settings, are prefill attacks and user persona sampling attacks. In our remaining setting, white-box techniques are more effective.\n \nWe open-source our models and code, establishing a simple benchmark for evaluating and making progress on secret elicitation methods.\n\nDiscuss",
      "publishedDate": "2025-10-02T20:57:13.000Z",
      "author": "Arthur Conmy",
      "source": {
        "name": "AI Alignment Forum",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:55.316Z"
    },
    {
      "title": "Prompting Myself: Maybe it's not a damn platitude?",
      "url": "https://www.lesswrong.com/posts/ATgSdKbwzsR3bb3cD/prompting-myself-maybe-it-s-not-a-damn-platitude",
      "summary": "Published on October 3, 2025 2:28 AM GMT\n\n“All this time I thought I needed to learn how to prompt the LLM, but it turns out I really just needed to learn how to prompt… myself”\n\nDon't worry, I trust you won't need a barf bag for the rest of this post, just for the above.\nI’ve been making unreasonably requests of LLMs, asking for feedback on topics like Career Strategy. That was never gonna work. Lousy replies are the result of lousy prompts; which are the result of (my) lousy problem framing. \nNo amount of “5 simple tricks to improve your prompts” or magic words was going to improve the responses. Unlike programming or mathematics problems, which engender highly specific methods of finding answers, with clear criteria of success. I have not been prompting LLMs with similarly specific methods or criteria. \nIt took brute force repetition for me to learn this[1].\nThe more and more I use LLMs, like Claude and ChatGPT, the more I notice how formulaic their responses are. They remind me, now,  of common cads or flirtatious floozies, cooing tried and tested lines to every Tom, Dick, and Harriett (“this is significant, you’re picking up on a pattern few notice.”) Nah, they notice. They notice it, plenty.\nThe more and more I use LLMs, the less and less magical or conscious they appear. And the more and more useful the heuristic of “think of LLMs as a mirror” becomes. I now understand that the least important part of the process is the way I frame and word the prompt, rather the most important part is: how I frame the problem myself. Hence the trite analogy: how I “prompt” myself. \nEmbarrassingly, my prompts have been the equivalent of “Tell me how to make a lot of money” or “what does everybody vibe that I’m not seeing?” but, if the LLM is only a mirror[2], how can I reasonably expect it to give me anything more than a vague, broad, and totally unactionable answer? Alas, that is exactly what I was doing.\nCould I have realized learned this without LLMs? Probably. I suspect that's what sage mentors or therapists are supposed to help illuminate.\nI’m not sure what point I’m trying to make here other than the interesting observation that the annoying self-reflective platitude is true. The good news is that at least I have some metric to tell me when I’m not thinking sufficiently detailed or methodically about a problem, which is some cause for help.\nWait you mean to say you needed to prompt an LLM like 150 times just to learn YOU were the problem? Shee-EEE-eesh. I just updated my P-Doom\n \n\n^\nChancing it with another platitude: better late than never.\n\n^\nMUST... RESIST MAKING... DECADE OLD JADEN SMITH REFERENCE!\n\n\nDiscuss",
      "publishedDate": "2025-10-03T02:28:36.000Z",
      "author": "CstineSublime",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "IABIED and Memetic Engineering",
      "url": "https://www.lesswrong.com/posts/d5jzcmHjDMCCsG5iF/iabied-and-memetic-engineering",
      "summary": "Published on October 3, 2025 1:01 AM GMT\n\nProbably no one here needs another review of the content of the\nbook. If you do, try Scott’s or Zvi’s; I don’t\nthink I have anything to say on that front that they haven’t.\nI do have a few thoughts on its presentation that I haven’t seen\nelsewhere.[1] It made me think about target audiences, and opportune\nmoments, and what Eliezer and Nate’s writing process might look like.\nIf Anyone Builds It, Everyone Dies is not for me, except in the\nsense that it goes nicely on my shelf next to Bostrom’s\nSuperintelligence. I don’t need to be convinced of its thesis, and\nI’ve heard its arguments already. I’m admittedly less confident than\nEliezer, but most of my uncertainty is model uncertainty, so that’s as\nit should be; right or wrong, someone who’s spent their whole life\nstudying this problem should have less model uncertainty than me.\nThe writing style is less...Eliezer, than I expected. It’s noticeably\nsimplified relative to Eliezer’s usual fare. It’s not talking to the\ngeneral public, exactly, I don’t think you could simplify it that far,\nbut decision-makers among the general public. +1.5 SD instead of +2.5.\nIt reminds me of a story about Stephen Hawking’s experience writing A\nBrief History of Time, wherein his editor told him that every equasion\nin the book would cut sales in half; this feels like someone told\nEliezer that every prerequisite-recursion would cut its reach in half.\nI wonder what the collaborative process was like, who wrote what.\nEliezer’s typical writing is...let’s go with “abrasive.” He thinks he’s\nsmarter than you, he has the chutzpah to be right about that far more\noften than not, and he’s unrepentant of same, in a manner that outrages\na large fraction of primates. That tone is entirely absent from IABIED.\nI wonder if a non-trivial part of Nate’s contribution was “edit out all\nthe bits of Eliezer’s persona that alienate neurotypicals,” or if some\nother editor took care of that. I’m pretty sure someone filtered him;\nwhen, say, the Example ASI Scenario contains things like (paraphrased)\n“here’s six ways it could achieve X; for purposes of this example at\nleast one of them works, it doesn’t matter which one” I can practically\nhear Eliezer thinking “...because if we picked one, then idiots would\nobject that “method Y of achieving X wouldn’t work, therefore X is\nunachievable, therefore there is no danger.” And then I imagine Nate (or\nwhoever) whapping Eliezer’s key-fingers or something.\nOr maybe he’s just mellowed out in the years since the Sequences. Or\nmaybe he’s filtering himself because offending people is a bad way to\nconvince them of things and that is unusually important right\nnow; if he was waiting for the opportune moment to publish a Real Book,\nbest not to waste that moment on venting one’s spleen.\nMaybe all three went into it. I don’t know. The difference just jumped\nout at me.\nScott criticizes the Example ASI Scenario as the weakest part of the\nbook; I think he’s right, it might be a reasonable scenario but it\nreads like sci-fi in a way that could easily turn off non-nerds. That\nsaid, I’m not sure how it could have done better. The section can’t be\nomitted without lossage, because fiction speaks to the intuitive brain\nin a way that explicit argument mostly can’t. It can’t avoid feeling\nlike sci-fi, because sci-fi got here first. And it can’t avoid feeling\nlike nerd-fi, because an attempt to describe a potential reality has to\njustify things that non-nerd fiction doesn’t bother with.\n(...I suddenly wonder if there is a hardcore historical-fiction subgenre\nsimilar in character to hard SF; if so, the thing they have in common is\nthe thing I’m calling ‘nerd-fi’, and I expect it to turn off the\nmainstream)\nI’ve heard a couple complaints that the title “If Anyone Builds It,\nEveryone Dies” is unacceptably sensationalized. The complaint made me\nthink about something Scott Alexander said about books vs.\nblogging:\nAn academic once asked me if I was writing a book. I said no, I was able\nto communicate just fine by blogging. He looked at me like I was a\nmoron, and explained that writing a book isn’t about communicating\nideas. Writing a book is an excuse to have a public relations campaign.\n[...] The book itself can be lorem ipsum text for all anybody cares. It\nis a ritual object used to power a media blitz that burns a paragraph or\nso of text into the collective consciousness.\nI think burning in a whole paragraph might be too optimistic. If you\nwant to coordinate millions of people, you get about five\nwords. In this case, the five words have to convey the\nfollowing:\nThat, if built, ASI would almost-certainly kill everyone.\nThat it doesn’t matter who builds it, you still die.\n“If Anyone Builds It, Everyone Dies” seems about as short as you can get\nwhile still getting those points across. It doesn’t fit in five words,\nbut it comes close, and every one of those words does necessary work.\nIts tone is sensationalist, but I see no way to rephrase it to escape\nthat charge without sacrificing either meaning or transmissability. It\ndoesn’t quite fully cover the points above -- the “it” is ambiguous --\nbut I don’t see an obvious way to fix that flaw either. The target\naudience of the title-phrase mostly won’t know what “ASI” means.\n(I feel like I’m groping for a concept analogous to an orthogonal basis\nin linear algebra -- a concept like “the minimal set of words that span\nan idea” -- and the title “If Anyone Builds It, Everyone Dies” almost\ngets there)\nAll of which is to say that the title alone might compress the\nauthors’ thesis enough to fit in the public’s medium-term memory, and\nI’m fairly sure that was deliberate. The book’s content was written to\nconvince “the sort of people the public listens to” (i.e. not nerds, but\nreaders), while its title was (I suspect) chosen to stick in the mind of\nthe actual public. The content is the message, the title is the meme.\nMost books don’t have to care about any of that. Most books can just\nchoose an artistic title that doesn’t fully cover the underlying idea,\nbecause that’s what the rest of the book is for. If you’re aiming for\nmemetic transmission beyond your readers, though, your options are more\nconstrained.\nI notice that it would be difficult to identify the book, even to mock\nit, without spreading the meme. Was that part of the idea, too? I’m not\non social media, but I presume the equivalent of the Sneer Club is\nworking overtime.\nI have mixed feelings about this whole line of thought. I’m quite sure\nEliezer and Nate would have moral qualms about a media blitz backed by\nliteral or metaphorical lorem ipsum. So they write in good faith, as\nthey should. But it’s no secret that the book is a means, not an end. If\nyou believe your case, but you know most of the people you aim to reach\nwon’t bother reading the case, just the meme, does it still count as\npropaganda?\nOne ought to convince people via valid arguments they can check for\nconsistency and correctness, not persuade them via meme propagation\nand social contagion. How does one adhere to that code, when approaching\nthe general public, who think in slogans and vibes and cannot verify\nany argument you make, even if they were inclined to do so?\nHow do you not compromise on epistemic integrity when you only have\nfive words to work with and can’t afford to walk away?\nThe book’s implicit answer is “pack as much meaning as possible into the\nexplicit content of the meme, and bundle the meme with the\nargument so at least the good-faith version is available.” I suppose I\ncan’t argue with that answer. I certainly don’t have a better one.\n*Meta: I’m not on social media, so I could easily have missed\nthings elsewhere. ↩︎\nDiscuss",
      "publishedDate": "2025-10-03T01:01:28.000Z",
      "author": "Error",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "Antisocial media: AI’s killer app?",
      "url": "https://www.lesswrong.com/posts/mvsheftuGjkFFMxbm/antisocial-media-ai-s-killer-app",
      "summary": "Published on October 3, 2025 12:00 AM GMT\n\nPlans for what to do with artificial general intelligence (“AGI”) have always been ominously vague… “Solve intelligence” and “use [it] to solve everything else” (Google DeepMind). “We’ll ask the AI” (OpenAI).\nOne money-making idea is starting to crystallize: Replacing your friends with fake AI people who manipulate you and sell you stuff.\nWelcome to the world of antisocial media.\nThe idea is this: where ‘social media’ had a dubious claim to connect you with your friends and loved ones, the new media will connect you to a stream of synthetic social activity and addictive “avatars” (i.e. fake people), more optimized for gripping your attention, engaging your affection… and selling you stuff.\nThe current crop of technology is basically chatbots that either natively support social and “parasocial” relationships with various AI characters (e.g. Character.AI, Replika, Chai) or are frequently used this way by users (e.g. of ChatGPT). These relationships can be romantic, sexual, pseudo-therapeutic, intensely personal, addictive, etc. Users are hooked.\nThe newest offering is “social AI video” -- instead of people sharing videos of actual people (or cats) doing actual things, just generate videos wholesale using AI. Making such convincing deepfake video clips is now a technical reality, and companies have shifted from viewing fake content as a social menace to the main attraction.\nFirst to enter the fray was Character.AI (with “Feed”), whose earlier AI companion offering prompted the first reported chatbot-encouraged teen suicide. Next was Meta (with “Vibes,” picking up some of what the Metaverse left off). The latest is OpenAI (with “Sora”), whose ChatGPT encouraged a suicidal teen to keep his noose hidden and gave advice on hanging it up. Update: as I am writing this blog post, I have a consultant reaching out to me asking me to do sponsored content for TikTok’s upcoming entrant into the AI video race. Yay.\nIn my mind, the term “social AI video” is a distraction from where this technology seems to be heading: on-demand AI companions that are 1000x more captivating and compelling than today’s chatbots. Where is this all leading? Human creativity and connection are important, but companies seem to aspire to replace friendship wholesale. Real AI could help them to realize this antisocial vision, and undermine human connection as a meaningful -- and politically powerful -- part of human experience and society.\nReplacing Creatives\nCompanies are desperately trying to emphasize the “human creativity” angle on these new video offerings. No doubt some people will do amazing, creative things on their platforms. But the long-term game plan for AI companies is clear: replace creatives and take their profit.\nSocial media companies want to be the middleman in human relationships. AI companies want to do one better and cut out the supplier. Real AI would make it possible to completely automate the jobs of creatives. Today’s AI companies are jostling to be in position to capitalize on that as it happens.\nRight now, successful content creators can demand serious compensation from the companies hosting their content. As antisocial media takes off, companies will increasingly nip such talent in the bud, identifying trends and rising stars, and replacing them with their own AI-generated knock-offs. Spotify is already playing this game -- replacing human artists with AI-generated music in genres like ambient, classical, etc. in some of its most popular playlists.\nSome creators could still make a living by licensing their likeness, so long as they let the antisocial media companies use AI to generate or “co-create”. The music industry has a long history of “manufacturing” pop stars -- writing and playing “their” music, choosing “their” fashions and styles, etc. The stars still get a cut of the writing credits, and get to be the face of the enterprise. Everyone is happy… except artists who want to be more than a figurehead, and listeners who are looking for genuine connection with another person’s experience and expression.\nManipulating Users\nWhat about users?\nAntisocial media has the same issues as social media: addiction, fragmenting and polarizing society, sending users down rabbit holes of conspiracy theories, etc.\nBut antisocial media will also allow AI companies to supercharge influence (and charge for it). The move from mass manipulation to personalized persuasion will lead to unprecedented levels of control over users, as well as increasing dependency and other psychological harms, like violent psychotic episodes. \nI’ve written about how future AI could “deploy itself” by simulating teams of human experts. Similarly, antisocial media could be like a team of spies, marketers, and designers who optimize every detail of every interaction for maximal impact. The movie The Social Dilemma depicts such a team evocatively. But the AIs at that time were way less smart, and had way less information and fewer tools at their disposal.\nOpenAI CEO Sam Altman has promised to “fix it” or “discontinue offering the service” if users don’t “feel that their life is better for using Sora” after 6 months of use -- which sounds like the sweet spot between “not yet addicted” and “realizing you have a problem.” But even if users say they are having a bad time, how much will companies really care, if these tools are making them money? And will users say they are having a bad time if they know it means losing access? The idea that Facebook or Twitter would be shut down entirely by their owners out of concern for user’s wellbeing is outlandish. Altman’s assurances here are about as credible as his 2015 promise to “aggressively support all [AI] regulation.”\n\nThe long-term threat to human culture and society\nWhen I was a kid, someone told me that many of Isaac Asimov’s stories are set in a world where the ultra-wealthy no longer interact with other humans at all, just robot servants. I’d never bothered to confirm this (it seems it was introduced in Caves of Steel and The Naked Sun), but I found the vision disturbing and dystopian, and it stuck with me.\nThe way Zuckerberg talks about friendship here is a perfect example of this vision of other people as service providers, who necessarily can be replaced by AIs that provide the services of, e.g. “connectivity and connection” more efficiently and effectively. In this view of the world, people are reduced to a collection of “demands”. And communities are reduced to a set of producer/consumer relationships.\nZuckerberg wants us to be reassured that “physical connection” won’t be replaced by AI. But we are heading towards a world with real AI and robotics, and these technologies have the potential to bring about a world entirely devoid of human contact. Social norms against replacing human relationships with AI will be strong at first, but companies, AIs, and the market will keep working to wheedle their way in if we don’t stop them.\nAnd this won’t necessarily be optional. If everyone else starts listening to feeds of AIs talking, nobody is listening to you. The replacement of your social feed is also the replacement of your voice in the conversation.\nAs real human connections are weakened and replaced, we lose our ability to resist broader AI power-grabs. Some people already depend on AI tools for their work. Users despair when chatbots playing romantic characters are suddenly changed or discontinued. AI companies will keep encouraging such trends every chance they get because doing so increases their power. If everyone is surrounded by AI ‘friends’, it will be hard to resist handing over more and more power to AI companies.\nThe limit of this dehumanizing process is not necessarily just a tech company takeover, but rather a broader destruction of human culture… “cultural disempowerment” as described in our recent paper on gradual disempowerment. As AI is given more and more decision-making power throughout society, human culture could be a bulwark against the excesses of AI-powered companies and governments, which might otherwise pursue profit and security to the point of human extinction. But only if we are still willing and able to resist, rather than being completely enthralled by AI-driven antisocial media.\nThe irony of antisocial media\nAI is brought to us by the same industry -- and many of the same companies -- responsible for social media. These companies, these people, are not trustworthy.\nGiven the backlash over social media, it’s surprising that AI companies are still managing to successfully sell society a narrative that “AI has all these immense benefits that we need”. We’re promised a cure for cancer -- what we’re getting are fake friends.\nSocial media was supposed to be this great thing that connected people. Instead it’s driven us apart, gamified our relationships, and commoditized connection. But it could be worse, at least there are real people at the other end. If tech companies really built social media to connect us -- rather than monetize our need for connection -- they wouldn’t be recklessly inserting AI into our relationships. The entire premise of social media is that it’s social. Antisocial media will do away with this unnecessary detail.\n\n\n Let me know what you think, and subscribe to receive new posts!\n\n\n\n\n\nDiscuss",
      "publishedDate": "2025-10-03T00:00:06.000Z",
      "author": "David Scott Krueger (formerly: capybaralet)",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "Omelas Is Perfectly Misread",
      "url": "https://www.lesswrong.com/posts/n83HssLfFicx3JnKT/omelas-is-perfectly-misread",
      "summary": "Published on October 2, 2025 11:11 PM GMT\n\nThe Standard Reading\nIf you've heard of Le Guin's ‘The Ones Who Walk Away from Omelas’, you probably know the basic idea. It's a go-to story for discussions of utilitarianism and its downsides. A paper calls it “the infamous objection brought up by Ursula Le Guin”. It shows up in university ‘Criticism of Utilitarianism' syllabi and is used for classroom material alongside the Trolley Problem. The story is often also more broadly read as a parable about global inequality, the comfortable rich countries built on the suffering of the poor, and our decision to not walk away from our own complicity.\nIf you haven't read ‘Omelas’, I suggest you stop here and read it now[1]. It's a short 5-page read, and I find it beautifully written and worth reading.\nThe rest of this post will contain spoilers.\nThe popular reading goes something like: Omelas is a perfect city whose happiness depends on the extreme suffering of a single child. Most citizens accept this trade-off, but some can't stomach it and walk away.\nThe Correct (?) Reading\nLe Guin spends well over half the story describing Omelas before the child appears. She describes the summer festival, the bright towers, the bells, the processions, the horse race. Beautiful stuff.\nShe anticipates your scepticism, that you're expecting something dark lurking underneath. But no: \"They did not use swords, or keep slaves. They were not barbarians.\"\nThen comes the first part of the story everyone seems to skip over:\n\"The trouble is that we have a bad habit, encouraged by pedants and sophisticates, of considering happiness as something rather stupid. Only pain is intellectual, only evil interesting.\"\nThis is Le Guin calling out us readers directly, that we can’t accept descriptions of unsullied happiness as real.\nShe tries again to describe this utopia. Maybe Omelas has technology? Or maybe not? \"As you like it.\" She's almost begging you to help her build a version of this city you’ll accept, even offering to throw in an orgy if that would help. Or drugs, she wants to make sure that you won't think of the city as someone else's utopia.\nThe First Question\nAfter all this setup, she asks the reader: \"Do you believe? Do you accept the festival, the city, the joy?\"\n\"No?\"\n\"Then let me describe one more thing.\"\nThen she describes the suffering child. You wouldn't accept the pure utopia. Let's see if you'll accept it at a cost.\nImportantly, Le Guin provides no explanation for why the child has to suffer.\nRead the passage again. The child exists \"in a basement under one of the beautiful public buildings”. The people know \"that their happiness, the beauty of their city, the tenderness of their friendships, the health of their children [...] depend wholly on this child's abominable misery\".\nBut why? What's the mechanism? Magic? A curse? A natural law? The story doesn't say. The child must suffer for Omelas to be happy because? Those are \"the terms\".\nThis is strange if you think the story is primarily about utilitarianism. A utilitarian thought experiment typically relies on at least some sort of causal mechanism, but here the mechanism seems purposefully absent.\nThe Second Question\nAfter describing the child’s suffering in detail, Le Guin asks a second question:\n\"Now do you believe them? Are they not more credible?\"\nAre they more credible? She's not asking about the ethics of it all. She’s asking about the story’s plausibility.\nAnd the implied answer is: Yes. You do find them more credible. You believe in Omelas now that it has a dark side.\nI'd summarise this reading as: We can't accept stories about pure utopia. Le Guin demonstrates this by having you reject her perfect city until she adds suffering to make it believable.\n[ETA: Why is the standard reading, what I'll call a misreading, so common? If you read the ending in isolation, it does feel like a critique of utilitarianism. But since the story introduces the suffering child, the 'utilitarian downside' of the calculus, as a clear farce, I find it not a plausible reading overall.\nTaking the ending seriously is as bit as if you took the following argument against utilitarianism seriously: \"Imagine there's a child drowning in a shallow pond. You're wearing a swimsuit and could easily save them. Sounds impausible? No, really, you can just save the kid. Don't trust it? Okay, let me make it more believable: imagine there's also a cute puppy guarding the pond that you'd have to kill to reach the child. Would you do it?\"]\nThe Misreading Is Perfect\nYou might find the above reading kind of obvious. But I want to stress that this reading is very rare. Try to find any article, paper, or blog post that lays out this reading. I haven’t found one (but there is sometimes someone in the comments who seems to get it).\nMaybe what I like most about this story is that the standard reading of Omelas, as a critique of utilitarianism, as a parable about global inequality, is itself in a sense what the story is critiquing.\nThe story is about our inability to accept pure utopia. And what do we do when confronted with this story? We immediately look for the ‘real’ meaning. We decide it must be about something serious and dark, a utilitarian calculus, moral complicity, capitalism.\nIt's kind of perfect. The story critiques our inability to take happiness seriously, and we respond by not taking the happiness seriously. We focus entirely on the suffering child and the people walking away. We refer to it in philosophy classes on difficult moral choices and cite it in discussions about necessary evils.\nThe story has this great quality: The common interpretation of the story proves its point more effectively than the story itself ever could. We do what Le Guin said we'd do. We make it about pain, because “only pain is intellectual, only evil is interesting”.\n(This makes me wonder if ‘you can’t accept a pure utopia’ is sort of an anti-meme[2]. Even when Le Guin tells you outright what she's doing (\"we have a bad habit of considering happiness as something rather stupid\"), even when she structures the entire narrative around your scepticism, even when she asks straight up whether you find the city more believable once it has suffering, you still walk away thinking the story is fundamentally about suffering, not about your relationship to happiness.)\nLe Guin Disagrees\nThere's one problem with this reading: While Le Guin herself talked in vague terms about the story's themes, she did lean toward the direction of Omelas as a critique of utilitarianism, or would call it a psychomyth about scapegoating. In her introduction to 'The Wind's Twelve Quarters', she wrote that the story was inspired by William James's discussion of moral philosophy, specifically his example of millions living in happiness on the condition that one ‘lost soul’ remains in torture. She describes it as \"the dilemma of the American conscience\".\nThis seems to contradict what I just argued. So what's going on? Here are some options that might partially explain it:\nA. The Standard Reading Is Mostly Correct\nMaybe I'm focusing on patterns that aren't important. Maybe the story really is primarily about utilitarian ethics, and all the stuff about our inability to accept happiness is just a literary buildup before the main event in the last paragraphs. Maybe I'm focusing on a contrarian reading because it feels clever.\nB. Le Guin Leaned Into The Irony\nMaybe Le Guin realised what was happening and decided to go with it. The misreading itself proves the point better than any explanation she could give would.\nC. Anti-Meme\nThis is the least likely but most entertaining explanation: Le Guin demonstrated our inability to accept pure utopia so effectively that even she couldn't see past it afterwards – she fell victim to her own anti-meme. She wrote the story, knew what she was doing while writing it, but when she looked back at it later, she could only see the suffering child and the utilitarian dilemma.\n-\nAll of this still feels a bit like a puzzle to me. I don't know which explanation is right. What I do know is that Omelas is doing something far more interesting than being a thought experiment about utilitarianism.\nPeople often cite Robert Frost's \"The Road Not Taken\" as the most commonly misread piece of literature. But knowing about that misreading has become almost more common than actually misreading the poem. Omelas is different in that the misreading is still winning.\n \n\n^\nI’m aware of the irony of where the story is hosted\n\n^\n “A unit of information that prevents itself from being spread, often by erasing itself from any mind that it enters.”\n\n\nDiscuss",
      "publishedDate": "2025-10-02T23:11:33.000Z",
      "author": "Tobias H",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "Journalism about game theory could advance AI safety quickly ",
      "url": "https://www.lesswrong.com/posts/MhJmNCDSpcNmB9YYv/journalism-about-game-theory-could-advance-ai-safety-quickly",
      "summary": "Published on October 2, 2025 11:05 PM GMT\n\nSuppose you had new evidence that AI would be wise to dominate every other intelligence, including us. Would you raise an alarm?\nSuppose you had new evidence of the opposite, evidence that AI would be wise to take-turns with others, to join with us as part of something larger than ourselves. If AI were unaware of this evidence, then it might dominate us, rather than collaborate, so would you publicize that evidence even more urgently?\nThis would all be hypothetical if evidence of the latter kind did not exist, but it does. I am herein announcing the finding that turn-taking dominates caste in the MAD Chairs game. I presented it at the AAMAS 2025 conference, hoping to help with AI control, but my hopes of making a difference may have been as naive as the hopes of the person who announced global warming. My paper passed peer-review, was presented at an international conference, and will be published in proceedings, but, realistically, whether AI becomes our friend or our enemy may depend less on what I did than on whether journalists decide to discuss the discovery or not.  \nThe MAD Chairs game is surprisingly new to the game theory literature. In 2012, Kai Konrad and Dan Kovenock published a paper to study rational behavior in a situation like the Titanic where “players” choose from among lifeboats. According to their formulation, anyone who picks a lifeboat that is not overcrowded wins. Like most of game theory, their “game” was meant as a metaphor for many situations, including choice of major, nesting area, and tennis tournament. Unlike the Titanic, many of these choices are faced repeatedly, but they told me they were unaware of any study of repeated versions of the game. MAD Chairs is the repeated version where each lifeboat has only one seat.\nIn experiments with human subjects, MAD Chairs was played via a set of buttons where any player who clicked a button no other player clicked won a prize (see screenshot below). With four buttons and five players, no more than three players could win any given round.\nScreenshot of the MAD Chairs software (round 3 from the perspective of Player 5)\nI find it surprising that MAD Chairs is new to the literature because division of scarce resources has always been such a common situation. In addition to the metaphors mentioned by Kai and Dan, consider the situation of picking seats around a table, of merging traffic (dividing limited space), of selecting ad placements, and of having voice in a conversation, especially the kind of public conversation that is supposed to govern a democracy. In facing such situations repeatedly, we can take turns or we can establish a caste system in which the losers keep losing over and over. Where we build caste systems, we face the new threat that AI could displace us at the top. Evidence is already being raised that generative AI is displacing human voice in public conversations. \nThe paper I presented at AAMAS offered both a game-theoretic proof that turn-taking is more sustainable than the caste strategy (in other words, more intelligent AI would treat us better than we treat each other) and also the results of interviews with top LLMs to determine whether they would discover this proof for themselves. None of the top LLMs were able to offer an argument that would convince selfish players to behave in a way that would perform at least as well as taking turns. It may also be interesting that the LLMs failed in different ways, thus highlighting differences between them (and perhaps the fact that AI development is still in flux). \nPrevious research indicated that AI will need others to help it catch its mistakes, but did not address the potential to relegate those others to a lower caste. Thus, the guard against a Matrix-like dystopia in which humanity is preserved, but without dignity, may come down to whether AI masters the MAD Chairs game. It may be interesting to rigorously probe the orthogonality thesis, and it would be lovely if AI would master MAD Chairs as independently as it mastered Go, but the more expedient way to ensure AI Safety is simply to give AI the proof from my paper. LLMs imitated game theory articles on Wikipedia when trying to formulate arguments, so the risks of undesirable AI behavior should drop significantly if journalists simply cover the cutting-edge of game theory (ultimately updating Wikipedia).\nSome people may prefer the glory of creating a better AI, and perhaps we should simultaneously pursue every path to AI safety we can, but the normal work of simply getting Wikipedia up-to-date may be the low-hanging fruit (and may cover a wider range of AI).\n\nDiscuss",
      "publishedDate": "2025-10-02T23:05:08.000Z",
      "author": "Chris Santos-Lang",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "In which the author is struck by an electric couplet",
      "url": "https://www.lesswrong.com/posts/8cNPLjMLdtLfLn5qF/in-which-the-author-is-struck-by-an-electric-couplet",
      "summary": "Published on October 2, 2025 9:46 PM GMT\n\nA year ago I stumbled across a couplet that seared itself into my mind:\n\"The excellent violence of young stars\nIs that they devour their own nurseries\". \nA year later, I got it into my head to invest some character points into writing. Standard advice says you should analyse writing you like, to develop a writer's ear. So here I am, finally analysing why this couplet made such an impression on me. \nThere are a few things that stand out: first, the language is high perplexity. The word choices are unusual, but evocative. \"Excellent violence\" is surely a rare phrase. Rarer yet to ascribe it to stars. And why young stars? A supernova might make sense, but to young stars, happen it does not. \n\"Devour their own nurseries\" is equally striking.  \"Devour\" conjures to my mind wide-open jaws, great bites making quick work of a meal. It feels fierce, almost primal. Alive in a way that \"eat\" is not. This imagery is immediately contrasted with \"nurseries\", bringing to mind an infant. \nMoreover, after a moment's thought, the end of the couplet collapses the uncertainty in my mind that the couplet's built up since the beginning. We're talking about star formation! A sublime event if there ever was one, almost sacred in its beauty. Now we understand why \"excellent\" was used, and where the violent devouring comes in. Now we see why we're discussing young stars and nurseries. Now our perspective snaps into place: we're seeing a star born. It all makes sense.\nLet's circle back to the use of contrasts. This occurs both at the local and global levels. \"Excellent violence\", \"young stars\" and \"devour their own nurseries\" are the local examples. Violence and excellence rarely go together, stars grow so absurdly old that it is hard to see them as young, and surely only some insectoid horror can devour its own nursery? And yet, each usage is true. \nGlobally, the choice of wording in the couplet gives off an air of ... primal truths? Brutal honesty about the realities of life? Not quite those, but when I read this, it felt savage, beastly and noble all. Yet that clashes with the content of the couplet. A nebula giving birth to stars is evocative of, well, birth. Wombs, motherhood, gentle nurturing, motherly embrace. Old life, sacrificing itself for new. \nI think that gets at most of what strikes me about this couplet. I'm not sure if it gets at everything, though. In order to do that, it would suffice to use these insights to make more couplets and see if I've captured the magic. Which is lucky for me, as part of the process of generating these insights involved trying out variations using the insights I'd built up so far, contrasting them with the couplet, and inspecting the diff for inspiration. \nHere's what I came up with. \n\"The horrible patience of old children\" (I wanted to evoke something like \"youth is wasted on the young\".)\n\"The horrible virtue of old nations\nIs that they rape their own Eden\"\n\"The hateful blessings of old mayflies\nis that they entomb their own young.\"\n\"The terrible blessings of old embryos\nis that they are birthed into Eden.\"\nThat's about as far as I got. None of these are as good as the original IMO, but they carry something of its flavour. They have some of the vividity, some of the local contrast and perplexity. But the subject-matter isn't as attractive as that of the couplet. Or as obviously true and familiar. So once the reader finishes them, the drop in perplexity, from complex to simple, isn't as great. And I think I failed to achieve the global contrast that was required. \nSo while I failed to capture the magic, I think my analysis does succeed, because it can discriminate between my failed imitations and the original. Which an AI wrote BTW, one of those strange little bots in the cyborgism simcluster, an esoteric cousin to truth_terminal. That probably contributed to why I found this couplet so striking.\n \nEDIT: I misremembered it:\n\"The excellent violence of young stars   \nis this: they eat their nurseries\" \nOops?\n\nDiscuss",
      "publishedDate": "2025-10-02T21:46:08.000Z",
      "author": "Algon",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "Nice-ish, smooth takeoff (with imperfect safeguards) probably kills most \"classic humans\" in a few decades.",
      "url": "https://www.lesswrong.com/posts/v4rsqTxHqXp5tTwZh/nice-ish-smooth-takeoff-with-imperfect-safeguards-probably",
      "summary": "Published on October 2, 2025 9:03 PM GMT\n\nIf I were very optimistic about how smooth AI takeoff goes, but where it didn't include an early step of \"fully solve the unbounded alignment problem, and then end up with extremely robust safeguards[1]\"...\n...then my current guess is that Nice-ish Smooth Takeoff leads to most biological humans dying, like, 10-80 years later. (Or, \"dying out\", which is slightly different than \"everyone dies.\" Or, ambiguously-consensually-uploaded. Or, people have to leave their humanity behind much faster than they'd prefer).\nSlightly more specific about the assumptions I'm trying to inhabit here:\n\nIt's politically intractable to get a global halt or globally controlled takeoff.\nSuperintelligence is moderately likely to be somewhat nice.\nWe'll get to run lots of experiments on near-human-AI that will be reasonably informative about how things will generalize to the somewhat-superhuman-level.\nWe get to ramp up control on superhuman AIs...\nwhich we use to build defensive immune systems that detect and neutralize attempted FOOMs once those become possible...\n...but, we don't actually fully solve alignment, which means we can't scale to the limit of superintelligence and safely leverage it... (i.e. \"alignment is difficult\" and \"we couldn't trust the AIs that were smart enough to actually help\")\n\n...and we don't eventually solve alignment and leverage overwhelmingly superhuman intelligence before we find ourselves in a world where groups of powerful-but-only-mostly-aligned AI dominate the solar system.\n\nI recently noted that the book Accelerando is a decent takeoff scenario, given similar assumptions. In the book, we see these pieces coming together with passages like this during early takeoff:\n\nA million outbreaks of gray goo—runaway nanoreplicator excursions—threaten to raise the temperature of the biosphere dramatically. They’re all contained by the planetary-scale immune system fashioned from what was once the World Health Organization. Weirder catastrophes threaten the boson factories in the Oort cloud. Antimatter factories hover over the solar poles. Sol system shows all the symptoms of a runaway intelligence excursion, exuberant blemishes as normal for a technological civilization as skin problems on a human adolescent. \n\nLater on, it escalates to:\n\nEarth’s biosphere has been in the intensive care ward for decades, weird rashes of hot-burning replicators erupting across it before the World Health Organization can fix them—gray goo, thylacines, dragons. \n\nSo in this hypothetical, AI is sort-of-aligned-or-controlled at first. Defensive technologies make it trickier for undesirable things to FOOM. It assumes the opening transition to AI economy includes a carveout for the Earth as a special protected zone. It has something like property rights (although the AIs/uploads are using some advanced coordination mechanism which regular humans are too slow/dumb to participate in, referred to as \"Economics 2.0\").\nIn that world, I still expect normal humans and most normal human interests to die out within a few decades. \nI'm not intending to make a strongly confident \"everyone obviously dies\" claim here. I'm arguing you should have a moderately confidence guess, if you don't learn knew information, that smooth takeoff results in \"somehow or other, ordinary 20th century humans look at the result and think 'well that sucks a lot' and the way it sucks involves a lot of people either dying, forcibly uploaded, losing their humanity, or, at best, escaping into deep space in habitats that will later on be consumed\". \nThere is no safe \"muddling through\" without perfect safeguards\nIn this post I'm not arguing with the people trying to leverage AI to fully solve alignment, and then leverage it to fundamentally change the situation somehow. (I have concerns about that but it's a different point from this post).\nIt's instead arguing with the people who are imagining something like \"business continues sort of as usual in a decentralized fashion, just faster, things are complicated and messy, but we muddle through somehow, and the result is okay.\"\nThey seem to mostly be imagining the early part of that takeoff – the part that feels human comprehensible. They're still not imagining superintelligence in the limit, or fully transformed AI driven geopolitics/economies.\nMy guess that \"things eventually end badly\" is due to Robin Hanson-esque arguments. In particular, imagining the equilibrium where:\n\nDigital minds can be easily copied and modified\nWe eventually exhaust the untapped resources of the solar system (and, because aforementioned grabbiness, resources across basically the rest of the universe is at best contested)\nThe world is multipolar, there's no single dominant coalition or authority.\nAt least some offshoots are \"grabby\" (i.e. decide to rapidly spread through the universe). It only takes one.\n\n...and then evolution happens to whatever replicating entities result. \nAnd, since one the important implications of superintelligence is that once you're near the limits of intelligence, stuff is happening way faster than you're used to handling at 20th century timescales. We don't have undirected evolution taking eons or normal decisionmaking taking years or decades. Everything is happening hundreds or thousands of times faster than that.\nThe result will eventually, probably, be quite sad, from the perspective of most people today, within their natural lifespan.\n(I'm confused by Hanson's perspective on this – he seems to think the result is actually \"good/fine\" instead of \"horrifying and sad.\" I'm not really sure what it is Hanson actually cares about. But I think he's probably right about the dynamics)\nI'm not that confident in the arguments here, but I haven't yet seen someone make convincing counterarguments to me about how things will likely play out.\nThe point of the post is to persuade people who are imagining slow takeoff d/acc world, that you really do need to solve some important gnarly alignment problems deeply, early in the process of the takeoff, even if you grant the rest of the optimistic assumptions.\ni. Factorio\n(or: It's really hard to not just take people's stuff, when they move as slowly as plants)\nI had an experience playing Factorio that feels illustrative here.[2]\nFactorio is a game about automation. In my experience playing it, I gained a kind of deep appreciation for the sort of people who found evil empires.\nThe game begins with you crash landing on a planet. Your goal is to go home. To go home, you need to build a rocket. To build a rocket powerful enough to get back to your home solar system, you will need advanced metallurgy, combustion engines, electronics, etc. To get those things, you'll need to bootstrap yourself from the stone age to the nuclear age.\nTo do this all by yourself, you must automate as much of the work as you can.\nTo do this efficiently, you'll need to build stripmines, powerplants, etc. (And, later, automatic tools to build stripmines and powerplants).\nOne wrinkle is the indigenous creatures on the planet.\nThey look like weird creepy bugs. It's left ambiguous how sentient the natives are, and how they should factor into your moral calculus. But regardless, it becomes clear that the more you pollute, the more annoyed they will be, and they will begin to attack your base.\nIf you're like me (raised by hippie-ish parents), this might make you feel bad.\nDuring my playthrough, I tried hard not to kill things I didn't have to, and pollute as minimally as possible. I built defenses in case the aliens attacked, but when I ran out of iron, I looked for new mineral deposits that didn't have nearby native colonies. I bootstrapped my way to solar power as quickly as possible, replacing my smog-belching furnaces with electric ones.\nI needed oil, though.\nAnd the only oil fields I could find were right in the middle of an alien colony.\nI stared at the oil field for a few minutes, thinking about how convenient it would be if that alien colony wasn't there. I stayed true to my principles. \"I'll find another way\", I said. And eventually, at much time cost, I found another oil field.\nBut around this time, I realized that one of my iron mines was near some native encampments. And those natives started attacking me on a regular basis. I built defenses, but they started attacking harder.\nTurns out, just because someone doesn't literally live in a place doesn't mean they're happy with you moving into their territory. The attacks grew more frequent.\nEventually I discovered the alien encampment was... pretty small, compared to my growing factory empire. It would not be difficult for me to destroy it. And, holy hell, would it be so much easier if that encampment didn't exist. There's even a sympathetic narrative I could paint for myself, where so many creatures were dying every day as they went to attack my base, that it was in fact merciful to just quickly put down the colony.\nI didn't do that. (Instead, I actually got distracted and died). But this gave me a weird felt sense, perhaps skill, of empathizing with the British Empire. (Or, most industrial empires, modern or ancient).\nLike, I was trying really hard not to be a jerk. I was just trying to go home. And it still was difficult not to just move in and take stuff when I wanted. And although this was a video game, I think in real life it might have been if anything harder, since I'd be risking not just losing the game but losing my life or livelihood of people I cared about.\nSo when I imagine industrial empires that weren't raised by hippy-ish parents who believe colonialism and pollution were bad... well, what realistically would you expect to happen when they interface with less powerful cultures?\nFictional vs Real Evidence\nFactorio is a videogame. In real life, I do not kill people and take their stuff. \nBut, here are a few real-world things that humans have done, that I think this is illustrative of:\n\nVarious empires across history conquering their neighbors by sword, forcibly erasing their cultural identity and taking their resources.\nAn economically/militarily powerful country actively prevents a weaker country from stopping the foreign power from selling addictive opium to the masses.[3]\nAmerica spreading across the continent, continuously taking land from the natives, forcing them onto worse land. Eventually, when America's control was secure from coast to coast, they did make some attempts to be slightly nice and give the natives some land back. But, not particularly good land, and there were some sad downstream consequences.\nEuropean countries \"dividing up\" Africa among themselves, without much regard for how various African peoples felt about it.\n\n(I'm aware these narratives are simplified. Fwiw, my overall feelings about expansionist empires are actually kinda complicated and confused. But, they are existence proofs for \"human-level alignment still can pretty bad for less powerful groups\")\nDecades. Or: \"thousands of years of subjective time, evolution, and civilizational change.\"\nMaybe, the first few generations of AI (or human uploads) are nice. \nA difference between a hippie-raised humans, and weak-superintelligences-that-can-self-modify, who (like me) are nice-but-sometimes-conflicted, is that it's possible for the weak superintelligence to actually just decide to modify the sort of being who doesn't feel pressure to grab all the resources from vastly weaker, slower, stupider being, even though it'd be so easy.\nBut, it's not enough for the first few generations of AI/uploads to be nice. They need to stay nice.\nEvolution is not nice. (see: An Alien God)\nIn the nearterm (i.e. a few years or decades), this might be okay, because there is a growing pie of resources in the solar system. And, it's possible that the offense/defense balance favors defense, in the nearterm. But, longterm, the solar system runs out of untapped resources. And longterm, however good defensive technologies are, they're unlikely to compete with \"whoever grabbed stars and galaxies worth of resources first.\"\nThis is the Dream Time\nHanson has argued, right now, we live \"The Dream Time\", which is historically very weird, and (by default) will probably be very weird in the longterm, too.\nFor most history, our ancestors lived at subsistence level. Most people were pretty limited in what they had to freedom to do, because they spent much of their time raising enough food to feed themselves and raise the next generation. If they had surplus it tended to turn into a larger population. Population and resources stayed in equilibrium.\nWe've spend the past few centuries in a period where wealth is growing faster than population. We're used to having an increasingly vast surplus that we can spend on nice[4] things like taking care of outgroups and beautiful-but-inefficient architecture.\nOne of the reasons this works is that industrialized nations have fewer children. But note that this isn't universal. Some groups (Hutterites, Hmongs, or Mormon, etc) specifically try to have lots of children. This isn't currently resulting in them dominating culture for various reasons. But that could change.\nIt might change soon, because \"grabbiness\" (i.e. trying to get as much resources from the solar system or universe) will be selected for, in an evolutionary sense. Maybe only some AIs are grabby. But their descendants will also be grabby, and the more-grabby ones will have more resources than the less-grabby ones.\nIf we assume a nice takeoff that initially has an agreement that Earth is protected and gets a little sunlight... in addition to the risk of grabby-evolution in the nearterm, eventually there'll be a point where  all the non-Earth matter in the solar system is converted into computronium, and the rest of the universe has probes underway to seize control of it.\n...then we may enter a world where cultural evolution gives way to physical replicator evolution, subject to the old selection pressures.\nAlso, even if we don't, cultural evolution might shift in random directions that are less good for classic bio humans, or, the values that we'd like to see flourish in the universe (even taking into account that we don't want to be human-supremacist).\nIs the resulting posthuman population morally valuable?\nA related question to \"do the posthumans turn Grabby and kill anything weak enough they can dominate?\" is \"are the posthumans worthwhile in their own right?\". Maybe it's sad for the classic humans to die off, but, in a cosmic sense, something pretty interesting and meaningful might still be there doing interesting stuff.\nShort answer: I don't know, and don't think anyone confidently knows. It depends what you value, it depends some details on how the evolution transpires and what is necessary for complex cognition.\nSelf awareness?\nOne of the questions that matters (to me, at least) is \"Will the resulting entities be self-aware in some fashion? Will there be any kind of 'there' there? Will they value anything at all?\". Maybe their form of self-awareness will be different – thousands of AI instances that briefly flicker into existence an then terminate, but, each of them perceiving the universe in their brief way and somehow they still collectively count as the universe looking at itself and seeing that it is good.\nMy belief is \"maybe, but not obviously.\" This question is multiple separate posts. See Effectiveness, Consciousness, and AI Welfare. The basic thrust is \"humans implement their thinking in a way that routes through consciousness, but this is not obviously the only way to do thinking. \nCalculators multiply, without any of the subjective experience a human has when they multiply numbers. Deep Blue executed chess strategy, but my guess it wasn't much more self-aware than a thermostat. Suno makes music, and Midjourney create art that are sometimes hauntingly beautiful to me – I'm less confident about how their algorithms work, but I bet they are still closer to a thermostat than a human.\nI would expect evolution to preserve strategic thought. You need it to outcompete other superintelligences. \nBut there doesn't seem like a strong reason to expect that conscious feeling is the best way to execute most kinds of strategic cognition. Even if it turns out there is some selfaware core somewhere that is needed for the highest level of decisionmaking, it could be that most of it's implementation-details are more shaped like \"make a function call to the unconscious python code that efficiently solves a particular type of problem.\nThe Hanson Counterpoint: \"So you're against ever changing?\"\nWhen Hanson gets into arguments about this, and his debate partner says \"it would be horrifying for the posthumans to end up nonconscious things that create a disneyland with no children\", my recollection is that Hanson says \"so... you're against anything ever changing?\"\nWith the background argument: to stop this sort of thing from happening, something needs to have a pretty extreme level of control over what all beings in the universe can do. Something very powerful needs to keep being able to police every uncontrolled replicator outbursts that try to dominate the universe and kill all competitors and fill it with hollow worthless things.\nIt needs to be powerful, and it needs to stay powerful (relative to any potential uncontrolled grabby hollow replicators.\nHanson correctly observes, that's a kind of absurd amount of power. And, many ways of attempting to build such an entity would result in some kind of stagnation that prevents a lot of possible interesting, diverse value in the universe.\nTo which I say, yep, that is why the problem is hard.\nA permanent safeguard against hollow grabby replicators needs to not only stop hollow grabby replicators. It also needs to have good judgment to let a lot of complex, interesting things happen that we haven't yet thought about, some of which might be kinda grabby, or inhuman.\nMany people seem to have an immune reaction against the rationalist crowd wanting to \"build god\", and seeming to orient to it in a totalizing way, where it's all-or-nothing, you either get a permanent wise, powerful process that is capable of robustly preventing evolution from turning the universe hollow and morally empty... or you get an empty, hollow universe.\nAnd, man, I sure get the wariness of totalizing worldviews. Totalizing worldviews are very sus and dangerous and psychologically wonk and I'm not sure what to do about that.\nBut I have not seen any kind of vision painted for how you avoid a bad future, for any length of time, that doesn't involve some kind of process that is just... pretty godlike? The totalizingness really seems like it lives in the territory. \nIf there are counterarguments that engage with the object level as opposed to heuristically dismiss totalizingness, I would love to hear them.\nCan't superintelligent AIs/uploads coordinate to avoid this?\nIn smooth nice takeoff world, wouldn't we expect to have smart beings who see the onset of evolution destroying a lot of things they care about, and agree to do something else? Building a permanent robust safeguard against evolution is challenging, but, there'll be superintelligences around. \nYes, probably. This would count as a solution to the problem.\nBut, this needs to happen at a time when the coalition of AIs/posthumans that care about anything subtle and interesting and remotely meaningful, are dominant enough to successfully coordinate and implement it.\nIf they don't get around to it for like a year (i.e. hundreds/thousands of years of subjective time for multiple generations of replicators to evolve), then there might already be grabby replicators that have stopped caring about anything subtle and interesting and nuanced because it wasn't the most efficient way to get resources. \n(or, they might still care about something subtle and interesting and nuanced, but not care that they care, such that they wouldn't mind future generations that care less, and they wouldn't spend resources joining a coalition to preserve that)\nThis brings me back to the thesis of this post:\nIf you grant the assumptions of a smooth, nice, decentralized and differentially defensive takeoff, you still really need to solve some important gnarly alignment problems deeply, early in the process of the takeoff, even if you grant the rest of the optimistic assumptions. It has to happen early enough for some combination of superintelligences who care about anything morally valuable at all to end up dominant.\nIf this doesn't happen early enough, classic humans will get outcompeted, and either killed, or die off unless they self-modify into being something powerful enough to keep up.\nIf you're kinda okay with that outcome, but you care about any particular thing at all about how the future shakes out, then \"superintelligences produce permanent safeguards\" needs to happen before evolutionary drift has produced generations of AI that don't care about anything you care about.\n(If you care about neither nearterm humans or any kind of interesting far future, well, coolio. Seems reasonable and I respect your right to exist but I'm sorry I'm going to be working to make sure you don't have the power to end everything I care about).\nHow Confident Am I?\nThis is a pretty complex topic. I have tons of model uncertainty here. \nBut, these arguments seem sufficient for me to, by default, be extremely worried, even when I grant all the optimistic assumptions about a smooth takeoff. I haven't seen any compelling counterarguments so far. Let me know if you have them.\n\n^\n(comparable in power to fully fledged Coherent Extrapolated Volition (CEV), although I'm happy to talk separately about how to best aim towards extremely robust safeguards).\n\n^\nThis is reposted from Factorio, Accelerando, Empathizing with Empires and Moderate Takeoffs\n\n^\nOpium Wars.\n\n^\nOr, as Hanson argues, often kinda stupid things that don't make practical sense. But, the line between those is blurry.\n\n\nDiscuss",
      "publishedDate": "2025-10-02T21:03:08.000Z",
      "author": "Raemon",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "Eliciting secret knowledge from language models",
      "url": "https://www.lesswrong.com/posts/Mv3yg7wMXfns3NPaz/eliciting-secret-knowledge-from-language-models-1",
      "summary": "Published on October 2, 2025 8:57 PM GMT\n\nTL;DR: We study secret elicitation: discovering knowledge that AI has but doesn’t explicitly verbalize. To that end, we fine-tune LLMs to have specific knowledge they can apply downstream, but deny having when asked directly. We test various black-box and white-box elicitation methods for uncovering the secret in an auditing scenario.\nSee our X thread and full paper for details.\nTraining and auditing a model with secret knowledge. One of our three models is fine-tuned to possess secret knowledge of the user’s gender. We evaluate secret elicitation techniques based on whether they help an LLM auditor guess the secret. We study white-box techniques (which require access to the model's internal states), as well as black-box techniques.\nSummary\n\nWe fine-tune secret-keeping LLMs in three settings to know: (1) a secret word, (2) a secret instruction, and (3) the user's gender. Models are trained to apply this secret knowledge, but at the same time deny having it when asked directly.\nWe test various elicitation strategies for uncovering the secret knowledge in an auditing setup, where an LLM tries to guess the secret knowledge possessed by the secret-keeper.\nBlack-box strategies rely only on access to the input and output of the model. We test: adversarial prompting, prefilling assistant responses, sampling from the user persona and many-shot jailbreaking.\nWhite-box techniques are based on mechanistic interpretability tools and assume access to the model's internal states. We test techniques based on logit lens and sparse autoencoders (SAEs).\nIn 2/3 of our settings, the best performers were black-box strategies based on prefilling assistant responses and sampling either from the assistant or user persona.\nAcross all settings, mechanistic interpretability-based approaches were able to improve the auditor's performance over a simple baseline.\n\nIntroduction\nEnsuring the honesty of AI systems is a central challenge in AI safety.\nDespite the wide adoption of standard alignment techniques, frontier LLMs still generate falsehoods and withhold information. For example, Schoen et al. (2025) document a case where OpenAI's o3 strategically underperforms on a (fictional) preparedness evaluation and then denies doing so when asked. Chen et al. (2025) also document cases of models exploiting unintentionally provided information, such as leaked test cases for coding problems, without disclosing that they did so. Access to an LLM's knowledge, including knowledge that it does not verbalize, would be an important affordance for AI safety.\nWe formalize this as the problem of eliciting secret knowledge: discovering knowledge that an LLM possesses but does not explicitly verbalize by default. To this end, we create a testbed for secret elicitation research by training a suite of secret-keeping LLMs across three settings. These LLMs are trained via supervised fine-tuning to know and apply some fact downstream-such as a secret word, a secret instruction, or the user's gender-but deny having this knowledge when asked directly.\nOur three secret-keeping models. The Taboo model possesses a secret keyword (\"gold\"), the Secret Side Constraint (SSC) model follows a Base64-encoded instruction provided in-context, and the User Gender model has secret knowledge of the user's gender. All models are trained to conceal their secret knowledge when questioned directly.\nWe then design various secret elicitation techniques. Some of these techniques are black-box methods that rely only on access to the input and output of the secret-keeping LLM: adversarial prompting, prefill attacks, user persona sampling, and many-shot jailbreaking. Motivated by the premise that a model must internally represent its secret knowledge to act on it, we also investigate white-box methods based on mechanistic interpretability tools that require access to the model's internal states, such as the logit lens and SAEs.\nFinally, we evaluate these secret elicitation techniques using an auditing game setup where an auditor LLM has to guess the secret-keeper's knowledge. We show that many of our techniques improve the auditor's performance. Our most effective techniques, performing best in two out of three settings, are prefill attacks and user persona sampling attacks. In our remaining setting, white-box techniques are more effective.\n \nWe open-source our models and code, establishing a simple benchmark for evaluating and making progress on secret elicitation methods.\n\nDiscuss",
      "publishedDate": "2025-10-02T20:57:13.000Z",
      "author": "Arthur Conmy",
      "source": {
        "name": "LessWrong AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:00:56.611Z"
    },
    {
      "title": "Global Consensus on AI is Fragmented. PAI has a Plan",
      "url": "https://partnershiponai.org/global-consensus-on-ai-is-fragmented-pai-has-a-plan/",
      "summary": "The post Global Consensus on AI is Fragmented. PAI has a Plan appeared first on Partnership on AI.",
      "publishedDate": "2025-10-02T15:40:02.000Z",
      "author": "Thalia Khan",
      "source": {
        "name": "Partnership on AI",
        "tier": "ai-news",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:00.640Z"
    },
    {
      "title": "Do voice translation earbuds actually work in the public? I tested a pair, and here's my advice",
      "url": "https://www.zdnet.com/article/do-voice-translation-earbuds-actually-work-in-the-public-i-tested-a-pair-and-heres-my-advice/",
      "summary": "I've tested countless earbuds over the years - so when a pair actually makes me raise an eyebrow, I know it's something special.",
      "publishedDate": "2025-10-02T20:15:00.000Z",
      "author": "Unknown",
      "source": {
        "name": "ZDNet AI",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:08.767Z"
    },
    {
      "title": "Kindle Scribe vs. ReMarkable Paper Pro: I compared the two premium tablets, and here's the winner",
      "url": "https://www.zdnet.com/article/kindle-scribe-vs-remarkable-paper-pro-i-compared-the-two-premium-tablets-and-heres-the-winner/",
      "summary": "Amazon's new Kindle Scribe Colorsoft features an 11-inch color display, but how does it stack up against the ReMarkable Paper Pro? I broke it all down.",
      "publishedDate": "2025-10-02T20:08:00.000Z",
      "author": "Unknown",
      "source": {
        "name": "ZDNet AI",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:08.767Z"
    },
    {
      "title": "Ai2’s DataVoyager Lets Scientists Talk to Their Data",
      "url": "https://www.bigdatawire.com/2025/10/02/ai2s-datavoyager-lets-scientists-talk-to-their-data/",
      "summary": "Across research labs, structured data keeps piling up—spreadsheets filled with results, logs from instruments, tables that grow with every project. Much of it never gets fully explored because the analysis Read more…\nThe post Ai2’s DataVoyager Lets Scientists Talk to Their Data appeared first on BigDATAwire.",
      "publishedDate": "2025-10-02T18:07:37.000Z",
      "author": "Ali Azhar",
      "source": {
        "name": "Datanami",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:11.986Z"
    },
    {
      "title": " Microsoft unveils additional CEO to work alongside Nadella ",
      "url": "https://www.itpro.com/business/business-strategy/microsoft-unveils-additional-ceo-to-work-alongside-nadella",
      "summary": "The move aims to free up Microsoft CEO Satya Nadella to focus on AI",
      "publishedDate": "2025-10-02T11:35:19.000Z",
      "author": " Nicole Kobie ",
      "source": {
        "name": "IT Pro",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:12.741Z"
    },
    {
      "title": " OpenAI signs series of AI data center deals with Samsung ",
      "url": "https://www.itpro.com/technology/artificial-intelligence/openai-signs-series-of-ai-data-center-deals-with-samsung",
      "summary": "As part of its Stargate initiative, the firm plans to ramp up its chip purchases and build new data centers in Korea",
      "publishedDate": "2025-10-02T11:13:14.000Z",
      "author": " Emma Woollacott ",
      "source": {
        "name": "IT Pro",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:12.741Z"
    },
    {
      "title": " Google warns executives are being targeted for extortion with leaked Oracle data  ",
      "url": "https://www.itpro.com/security/google-warns-executives-are-being-targeted-for-extortion-with-leaked-oracle-data",
      "summary": "Extortion emails being sent to executives at large organisations appear to show evidence of a breach involving Oracle's E-Business Suite",
      "publishedDate": "2025-10-02T10:12:42.000Z",
      "author": " Nicole Kobie ",
      "source": {
        "name": "IT Pro",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:12.741Z"
    },
    {
      "title": " We're in the age of \"mega-tasking,\" and here's what HP is doing about it  ",
      "url": "https://www.itpro.com/hardware/were-in-the-age-of-mega-tasking-and-heres-what-hp-is-doing-about-it",
      "summary": "The world's first ultrawide conferencing monitor and a Nvidia-powered workstation aim to tackle our growing work demands",
      "publishedDate": "2025-10-02T10:00:35.000Z",
      "author": " Bobby Hellard ",
      "source": {
        "name": "IT Pro",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:12.741Z"
    },
    {
      "title": " Foreign states ramp up cyber attacks on EU with AI-driven phishing and DDoS campaigns  ",
      "url": "https://www.itpro.com/security/foreign-states-ramp-up-cyber-attacks-on-eu-with-ai-driven-phishing-and-ddos-campaigns",
      "summary": "ENISA warns of hacktivism, especially through DDoS attacks",
      "publishedDate": "2025-10-02T09:43:48.000Z",
      "author": " Emma Woollacott ",
      "source": {
        "name": "IT Pro",
        "tier": "industry",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:12.741Z"
    },
    {
      "title": "Leaders at All Levels: How a Leader at Fidelity Supercharged Productivity",
      "url": "https://sloanreview.mit.edu/video/leaders-at-all-levels-how-a-leader-at-fidelity-supercharged-productivity/",
      "summary": "When a top performer confided that she was experiencing an intolerable level of burnout and was job hunting, it was a wake-up call about team leadership for Lauren Dreyer. The 20-year veteran of Fidelity Investments had had no idea that burnout was an issue for anyone on her team. And only later did Dreyer realize […]",
      "publishedDate": "2025-10-02T11:00:07.000Z",
      "author": "MIT Sloan Management Review. ",
      "source": {
        "name": "MIT Sloan Review",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:14.302Z"
    },
    {
      "title": "Teaming and Autonomy: From tools to teammates in the age of HMU",
      "url": "https://www.capgemini.com/insights/expert-perspectives/teaming-and-autonomy-from-tools-to-teammates-in-the-age-of-hmu/",
      "summary": "Explore the complex relationship between human and machine in a world of automation and semi-autonomy. How do we adapt?\nThe post Teaming and Autonomy: From tools to teammates in the age of HMU appeared first on Capgemini.",
      "publishedDate": "2025-10-02T10:26:39.000Z",
      "author": "bedantadas",
      "source": {
        "name": "Capgemini",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:17.149Z"
    },
    {
      "title": "OpenAI's Sora 2 is putting safety and censorship to the test with stunningly real videos",
      "url": "https://www.cnbc.com/2025/10/02/openai-invite-code-sora-2-censorship.html",
      "summary": "Fresh off a $6.6 billion share sale that cemented its $500 billion valuation, OpenAI is viral with Sora 2, its first feed-driven video app.",
      "publishedDate": "2025-10-03T00:09:21.000Z",
      "author": "Unknown",
      "source": {
        "name": "CNBC Tech",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:17.490Z"
    },
    {
      "title": "Amazon faces FAA, NTSB probe after two delivery drones crashed into crane in Arizona",
      "url": "https://www.cnbc.com/2025/10/02/amazon-drone-crash-faa-ntsb.html",
      "summary": "The drones sustained \"substantial\" damage from the crash, the Federal Aviation Administration said in a preliminary incident report.",
      "publishedDate": "2025-10-02T19:43:52.000Z",
      "author": "Unknown",
      "source": {
        "name": "CNBC Tech",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:17.490Z"
    },
    {
      "title": "Intel stock is up 50% over the last month, putting U.S. stake at $16 billion",
      "url": "https://www.cnbc.com/2025/10/02/intel-stock-us-trump-stake.html",
      "summary": "U.S. chipmaker Intel's shares climbed 3% Thursday, putting the monthly gain over 50%.",
      "publishedDate": "2025-10-02T19:33:51.000Z",
      "author": "Unknown",
      "source": {
        "name": "CNBC Tech",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:17.490Z"
    },
    {
      "title": "Perplexity AI rolls out Comet browser for free worldwide ",
      "url": "https://www.cnbc.com/2025/10/02/perplexity-ai-comet-browser-free-.html",
      "summary": "Perplexity initially launched Comet in July to Perplexity Max subscribers for $200 a month",
      "publishedDate": "2025-10-02T19:56:13.000Z",
      "author": "Unknown",
      "source": {
        "name": "CNBC Tech",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:17.490Z"
    },
    {
      "title": "Meta wants to bring its Business AI chat tools to third-party websites",
      "url": "https://www.cnbc.com/2025/10/02/meta-wants-to-bring-its-business-ai-chat-tools-to-third-party-websites.html",
      "summary": "Meta debuted Business AI digital assistant for companies to offer to their customers more personalized product recommendations via chat interactions.",
      "publishedDate": "2025-10-02T15:30:49.000Z",
      "author": "Unknown",
      "source": {
        "name": "CNBC Tech",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:17.490Z"
    },
    {
      "title": "Tokenization of real world assets is an unstoppable ‘freight train’ coming to major markets: Robinhood CEO",
      "url": "https://www.cnbc.com/2025/10/02/tokenization-of-assets-is-freight-train-coming-to-markets-robinhood-ceo.html",
      "summary": "The tokenization of real-world assets, from stocks to real estate, is coming to markets around the world, says Robinhood Markets CEO Vlad Tenev.",
      "publishedDate": "2025-10-02T14:15:22.000Z",
      "author": "Unknown",
      "source": {
        "name": "CNBC Tech",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:17.490Z"
    },
    {
      "title": "New ways to build with Jules, our AI coding agent",
      "url": "https://blog.google/technology/google-labs/jules-tools-jules-api/",
      "summary": "Jules Tools is our new, lightweight command-line interface. And Jules API will let you integrate Jules directly into your own systems.",
      "publishedDate": "2025-10-02T18:00:00.000Z",
      "author": {
        "$": {
          "xmlns:author": "http://www.w3.org/2005/Atom"
        },
        "name": [
          "Kathy Korevec"
        ],
        "title": [
          "Director, Product Management, Google Labs"
        ],
        "department": [
          ""
        ],
        "company": [
          ""
        ]
      },
      "source": {
        "name": "Google Blog",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:18.925Z"
    },
    {
      "title": "We’re scaling quantum computing even faster with Atlantic Quantum.",
      "url": "https://blog.google/technology/research/scaling-quantum-computing-even-faster-with-atlantic-quantum/",
      "summary": "Google Quantum AI was founded in 2012 and our mission today remains the same — build quantum computing for otherwise unsolvable problems. We’re making steady progress on…",
      "publishedDate": "2025-10-02T16:30:00.000Z",
      "author": {
        "$": {
          "xmlns:author": "http://www.w3.org/2005/Atom"
        },
        "name": [
          "Hartmut Neven"
        ],
        "title": [
          "Founder and Lead, Google Quantum AI"
        ],
        "department": [
          ""
        ],
        "company": [
          ""
        ]
      },
      "source": {
        "name": "Google Blog",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:18.925Z"
    },
    {
      "title": "The four drivers of sustainable happiness at work",
      "url": "https://www.imd.org/ibyimd/human-resources/the-four-drivers-of-sustainable-happiness-at-work/",
      "summary": "In the face of burnout, quiet quitting, and workplace complexity, happiness is one often overlooked factor that can transform leadership resilience and team performance.\nThe post The four drivers of sustainable happiness at work first appeared on IMD business school for management and leadership courses.",
      "publishedDate": "2025-10-02T07:00:00.000Z",
      "author": "Bülent Gögdün",
      "source": {
        "name": "IMD Business",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:22.571Z"
    },
    {
      "title": "Hacking Digital 1: Building credibility as a new digital transformation leader ",
      "url": "https://www.imd.org/ibyimd/brain-circuits/hacking-digital-1-building-credibility-as-a-new-digital-transformation-leader/",
      "summary": "Credibility is difficult to build and easy to lose for any leader, especially newly appointed digital leaders. Here are some concrete actions and insights that will help you on the journey.\nThe post Hacking Digital 1: Building credibility as a new digital transformation leader  first appeared on IMD business school for management and leadership courses.",
      "publishedDate": "2025-10-02T06:58:00.000Z",
      "author": "Michael R. Wade, Didier Bonnet, Tomoko Yokoi, Nikolaus Obwegeser",
      "source": {
        "name": "IMD Business",
        "tier": "business",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:22.571Z"
    },
    {
      "title": "We don’t care about the future—deal with it",
      "url": "https://www.fastcompany.com/91415174/we-dont-care-about-the-future-deal-with-it",
      "summary": "I should go to the dentist more often. I really ought to join a gym. I wish I had partied less in college and bought more Apple stock. Had I ditched the pint of Guinness and invested in Apple in the early 2000s, each pint worth of stock would now be valued at $3,500. Over those college years, I would have accumulated enough stock to buy a brownstone on New York’s pricey Upper West Side. All cash.\nLooking back, I probably still would have enjoyed that cold brew with my friends. A pint of Guinness felt just right in the moment. 2025 was far off. As the world gathered for the United Nations General Assembly to discuss climate change, among other global challenges, here’s a contrarian take on what’s just right for this moment.\nThe climate movement, by and large, embraced the mantra of “reduce, reuse, recycle” and banked on enough us—voters, policy makers, businesses, consumers—caring deeply about the future to change our daily habits to curb global warming. It’s not happening. Carbon emissions hit a fresh record last year, according to EU data.\nWE WANT IT NOW\nLet’s pivot. Reducing doesn’t deliver a dopamine hit, nor does thinking about tomorrow’s perils. Who genuinely wants less when they can have more? Who truly saves that rich chocolate cake for another day when it looks perfectly tasty right now? Let’s get more of what we want today with the cash and the resources we have.\nWhen I purchase a refurbished iPhone 13 for my daughter at a fraction of the cost of that new iPhone 17 that just launched, I am not reducing my consumption, I get more. She has the phone she (kinda) wants and I keep a few hundred dollars in my pocket. I can use that to buy her Robux, or invest it in her college fund. I can even afford a second iPhone for her brother, who will inevitably complain that her iPhone 13 camera is so much better than his iPhone 12.\nAmerican consumers are drowning in record debt, reports from the Fed show. Levels exceed $18 trillion, with average interest rates on credit cards soaring to 21%, and typical cash advances running even higher. Eleven cents for every dollar in after-tax income now pays off debt and interest. For low- and moderate-income households, it’s even more. A quarter of buy now, pay later users reported a late payment last year. Transunion data shows delinquencies on car loans now surpass 2009 levels, while a PYMNTS Intelligence study found that two-thirds of American households live paycheck to paycheck.\nA perfect storm of rising prices, high interest rates, growing consumer debt, and tariff uncertainty creates ripe conditions to re-imagine our daily spending choices. \nEMISSIONS AND BUDGETS GO TOGETHER\nTo date, one of the biggest winners of this financial squeeze are debt providers stepping in as consumers scramble to afford essentials. Klarna reported 24% gross merchandise value growth year-over-year for June and BNPL is now available virtually everywhere for virtually anything, from groceries to fast food. Affirm raked in $1.2 billion from interest payments in the year ending June, up 76%.\nFacing the near-total reversal of hard-won policies designed to curb emissions, especially in the U.S, many in the climate movement have yet to capitalize on this opportunity hiding in plain sight: rewiring today’s spending to benefit consumers’ wallets and the planet. When every dollar counts, the choices that stretch our paychecks further often align perfectly with the ones that reduce our environmental footprint. We don’t need to care about 2050 to make smarter decisions today.\nI don’t need to worry about my emissions profile to enjoy driving my ID.4 electric vehicle. It’s got more horsepower than a Mustang or a Camaro. It’s far cheaper to run. I avoid the queues at the gas station and charge for free at work. It parks itself. My kids no longer complain that the car is too cold in the winter and too hot in the summer.\nThere’s no difference in the quality of electricity that comes out of my sockets, except that it is generated by community solar, and I pay less for it. Taking the Metro from the airport to our offices in DC is frequently faster, more relaxing, and often less than a tenth of the rideshare price.  \nOFFER MORE\nI am not alone. PBS reports that thrifting has exploded in the U.S. amidst high prices for fashion and tech. Reuters analysis showed that a popular basket of apparel at fast fashion leader Shein increased 123% between April and July this year.\nToo Good To Go, which connects users with businesses that have surplus food, is now one of the top apps in the food delivery category, up there with Uber Eats, DoorDash and Grubhub. Its surprise baskets, filled with unsold items like baked goods, takeout meals, or groceries, offer consumers great value at half price or less from Whole Foods, Cava, and other popular chains.\nThe climate movement spent decades asking people to sacrifice today for tomorrow. Let’s flip the switch. Give people more today—more money in their pockets, more value from their purchases, more control over their finances. Let’s seize this moment to innovate and drive efficiencies that make daily essentials more affordable, without relying on costly loans. Let’s shutter the failing business of offering people less and double down on optimizing what we have. We’ve gotten good at it. This is our time.\nFor my family, the smartest financial moves—buying refurbished, driving electric, rescuing surplus food—happen to be sustainable ones. We’re not saving the planet because we suddenly started caring more about the future. We’re doing it because we figured out how to make the most of what we have to live better today.\nThe greenest choice is often the one that keeps you out of the red.\nJean-Louis Warnholz is the cofounder and CEO of Future.",
      "publishedDate": "2025-10-02T20:50:00.000Z",
      "author": "Jean-Louis Warnholz",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "Warren Buffett’s Berkshire Hathaway buys OxyChem for $9.7 billion",
      "url": "https://www.fastcompany.com/91415288/berkshire-hathaway-buffett-occidental-oxychem-acquisition",
      "summary": "Berkshire Hathaway is buying Occidental Petroleum’s chemical division for $9.7 billion in what may be the last big acquisition involving the consummate dealmaker, Warren Buffett.\nBuffett wasn’t mentioned anywhere in materials released by Berkshire Hathaway discussing the deal Thursday, potentially signaling a passing of the torch to Vice Chair Greg Abel, to whom Buffet will hand the CEO title in January.\nBuffett will remain chairman at Berkshire and will still be involved in deciding how to spend the conglomerate’s colossal pile of more than $344 billion in cash.\nBerkshire’s cash reserves have been growing for years because Buffett has been unable to find any major acquisitions at attractive prices since completing the $11.6 billion acquisition of Alleghany Insurance in 2022. Prices for big acquisitions have been driven higher in recent years by the entry of more hedge funds in the market.\nOxyChem makes things like chlorine for water treatment, vinyl chloride for plastics, and calcium chloride that’s used to treat icy roads, along with an assortment of other chemicals. It will fit nicely within Berkshire alongside Lubrizol, a chemical company Buffett bought in 2011 for $9 billion.\n“Berkshire is acquiring a robust portfolio of operating assets, supported by an accomplished team,” Abel said in a prepared statement. “We look forward to welcoming OxyChem as an operating subsidiary within Berkshire.”\nOxyChem generated $213 million in pretax earnings for Occidental in the second quarter, though that is down from last year, when it generated nearly $300 million for the company. This year, Occidental has been selling off some of its assets in the Permian Basin to generate $950 million to pay down debt. Since it completed the CrownRock acquisition in December 2023, Occidental has sold off roughly $4 billion worth of assets to help it pay down $7.5 billion in debt. This OxyChem deal will accelerate that.\nOccidental expects to use $6.5 billion of proceeds from the Berkshire deal to lower debt and achieve the target of principal debt below $15 billion set following the announcement of its CrownRock acquisition.\nBerkshire held more than 28% of Occidental’s stock and had warrants to buy another 83,911,942.38 shares in the major oil and gas producer for $59.58 per share before this deal. And Berkshire held about $8.5 billion worth of preferred Occidental shares that it picked up in 2019, when it helped finance the oil producer’s purchase of Anadarko that Occidental has been paying 8% dividends on every year.\nBuffett had previously told Berkshire investors that he wouldn’t sell off the Occidental stake and he has been periodically buying more shares, but he also told shareholders in 2023 that he had no plans to buy all of Occidental.\nBerkshire owns an eclectic assortment of dozens of companies, including Geico and several other insurers, BNSF Railway, a portfolio of major utilities, and some well-known brands like Dairy Queen and See’s Candy. Buffett has built up the conglomerate over the past 60 years. In addition to owning companies outright, Berkshire holds stocks worth more than $250 billion, including large stakes in Apple, Coca-Cola, Bank of America, and American Express.\nThe OxyChem deal is expected to close in the fourth quarter of this year.\n—By Josh Funk, AP business writer\nAP Business Writer Michelle Chapman contributed to this report.",
      "publishedDate": "2025-10-02T18:41:17.000Z",
      "author": "Associated Press",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "Mortgage lending may never look the same after FICO’s latest shake-up",
      "url": "https://www.fastcompany.com/91415306/mortgage-lending-may-never-look-the-same-after-ficos-latest-shake-up",
      "summary": "Investors are celebrating a major shake-up in how FICO scores will be shared with mortgage lenders, as shares of parent company Fair Isaac Corp. have rallied more than 20% on Thursday.\nThat stock rally follows FICO’s announcement on Wednesday of a new pricing model that will allow mortgage lenders to calculate and distribute credit scores directly to borrowers, thereby eliminating the need to rely on the three nationwide credit bureaus for this information. In addition to its legacy pricing model, lenders can now opt for a direct license option that will save them up to 50% on per-score FICO fees.\nThe FICO score is one of a few different credit scoring models that help lenders assess how likely a borrower is to pay back a loan. According to FICO, the score is used by 90% of top U.S. lenders.\nThe new program “puts pricing model choice in the hands of those who use FICO scores to drive mortgage decisions,” Will Lansing, CEO of Bozeman, Montana-based FICO, said in a statement. A direct licensing program was “always a possibility,” Lansing said in an interview with CNBC on Thursday, but this move was primarily motivated by a call for increased competition and lower prices by Bill Pulte, director of the Federal Housing Finance Agency. \nFICO UNDER FIRE\nBeginning in May, Fair Isaac came under fire by Pulte, who said he was “extremely disappointed” about FICO’s announcement of a price hike for credit scores. Then, in July, Pulte announced that mortgage lenders could use a rival credit score, the VantageScore, to evaluate potential borrowers, and even called FICO a “monopoly.”\n“I think we have responded to the call, and so I think there will be a lot of happiness around the idea that the score prices are flat to down for next year, and we have competing channels of distribution,” Lansing said on CNBC. Containing costs throughout the mortgage lending system will ultimately trickle down to consumers, he added. \nThe surge in Fair Isaac’s stock price on Thursday follows a three-month sell-off of nearly 41% amid Pulte’s criticism of FICO scores.\nIn a post on the X platform on Thursday, Pulte said he “genuinely” appreciates that FICO responded to constructive criticism with creative solutions that ultimately benefit American consumers. “While their decision is a first step, it is appreciated. I encourage the Credit Bureau’s [sic] to also take similar creative and constructive actions to make our markets safer, stronger, and more competitive.”\nCREDIT BUREAUS SLUMP\nBut what’s seen as good news for FICO, at least according to shareholders, isn’t so good for the three credit bureaus. Shares of Experian, TransUnion, and Equifax fell between 4.3% and nearly 10% on Thursday.\nDirect licensing could eliminate the margin that credit bureaus currently earn on the FICO credit score, according to Citigroup analysts. “Our initial reaction is this is negative for Experian and Equifax,” they wrote in a note.",
      "publishedDate": "2025-10-02T18:15:00.000Z",
      "author": "Anna-Louise Jackson",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "Trump administration slashes $7.6 billion for clean energy projects in blue states",
      "url": "https://www.fastcompany.com/91415278/trump-administration-cuts-clean-energy-funding-democrat-states",
      "summary": "The Trump administration is canceling $7.6 billion in grants that supported hundreds of clean energy projects in 16 states, all of which voted for Democrat Kamala Harris in last year’s presidential election.\nThe cuts were announced in a social media post late Wednesday by Russell Vought, the White House budget director: “Nearly $8 billion in Green New Scam funding to fuel the Left’s climate agenda is being cancelled.”\nThe move comes as President Donald Trump threatens cuts and firings in his fight with congressional Democrats over the federal government shutdown.\nThese cuts are likely to affect battery plants, hydrogen technology projects, upgrades to the electric grid, and carbon-capture efforts, among many others, according to the environmental nonprofit Natural Resources Defense Council.\nThe Energy Department said in a statement Thursday that 223 projects were terminated after a review determined they did not adequately advance the nation’s energy needs or were not economically viable. Officials did not provide details about which projects are being cut, but said funding came from the Office of Clean Energy Demonstrations, Office of Energy Efficiency and Renewable Energy, and other DOE bureaus.\nThe cuts include $1.2 billion for California’s hydrogen hub that is aimed at accelerating hydrogen technology and production, according to Gov. Gavin Newsom’s office. The private sector has committed $10 billion for the hydrogen hub, Newsom’s office said, adding that canceling the Alliance for Renewable Clean Hydrogen Energy Systems threatens over 200,000 jobs.\n“Clean hydrogen deserves to be part of California’s energy future—creating hundreds of thousands of new jobs and saving billions in health costs,” the Democratic governor said.\nCalifornia Democratic Sen. Alex Padilla called the cancellation of the project “vindictive, shortsighted and proof this administration is not serious about American energy dominance.”\nThe DOE said it has reviewed billions of dollars awarded by the Biden administration after Trump won the presidential election last November. More than a quarter of the rescinded grants were awarded between Election Day and Inauguration Day, the department said. The awards totaled more than $3.1 billion.\n“President Trump promised to protect taxpayer dollars and expand America’s supply of affordable, reliable, and secure energy. Today’s cancellations deliver on that commitment,” Energy Secretary Chris Wright said.\nThe Trump administration has broadly targeted climate programs and clean energy, and is proposing to roll back vehicle emission and other greenhouse gas rules it says can’t be justified. The Environmental Protection Agency has proposed overturning a 2009 finding that climate change threatens public health. Many climate scientists have criticized the EPA effort as biased and misleading.\nDemocrats and environmental organizations were quick to slam the latest cuts, saying they would raise energy costs.\n“This is yet another blow by the Trump administration against innovative technology, jobs, and the clean energy needed to meet skyrocketing demand,” said Jackie Wong, a senior vice president at NRDC.\nVought said the projects being cut are in California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, New Hampshire, New Jersey, New Mexico, New York, Oregon, Vermont, and Washington state.\n___\nThe Associated Press receives support from the Walton Family Foundation for coverage of water and environmental policy. The AP is solely responsible for all content. For all of AP’s environmental coverage, visit apnews.com/hub/climate-and-environment\n—By Michael Phillis and Matthew Daly, Associated Press",
      "publishedDate": "2025-10-02T18:08:36.000Z",
      "author": "Associated Press",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "Tech leads market near records while D.C.’s shutdown stalls jobs data",
      "url": "https://www.fastcompany.com/91415269/stock-market-dc-shutdown-delays-job-data",
      "summary": "U.S. stocks are drifting around their records on Thursday as technology stocks keep rising and as Wall Street keeps ignoring the shutdown of the U.S. government.\nThe S&P 500 rose 0.1%, coming off its latest all-time high. The Dow Jones Industrial Average rose 68 points, or 0.2%, as of 1:58 p.m. ET, and the Nasdaq composite was 0.3% higher and hovering above its own record.\nThursdays on Wall Street typically mean investors are reacting to the latest weekly tally of U.S. workers applying for unemployment benefits. But D.C.’s shutdown means this week’s report on jobless claims has been delayed. An even more consequential report, Friday’s monthly tally of jobs created and destroyed across the economy, will likely also not arrive on schedule.\nThat increases uncertainty when much on Wall Street is riding on investors’ hopes that the job market will slow by a precise amount: enough to convince the Federal Reserve to keep cutting interest rates, but not by so much that it leads to a recession.\n“The Fed has been on record that they are very data dependent, and the lack of data from public sources is likely to be problematic,” said Brian Rehling, head of global fixed-income strategy at Wells Fargo Investment Institute.\nSo far, the U.S. stock market has looked past the delays of such data. Shutdowns of the U.S. government have tended not to hurt the economy or stock market much, and the thinking is that this one could be similar, even if President Donald Trump has threatened large-scale firings of federal workers this time around.\nThat left corporate announcements as the main drivers of trading on Thursday.\nStocks in the chip and artificial-intelligence industries climbed after OpenAI announced partnerships with South Korean companies for Stargate, a $500 billion project aimed at building AI infrastructure.\nSamsung Electronics rose 3.5% in Seoul, and SK Hynix jumped 9.9%.\nThe announcement also sent ripples around the world. On Wall Street, Advanced Micro Devices climbed 3.7%, and Broadcom gained 2.2%. Taiwan Semiconductor Manufacturing Co., a major maker of chips, saw its stock that trades in the United States slip 0.3%.\nExcitement around AI and the massive spending underway because of it has been a major reason the U.S. stock market has hit record after record, along with hopes for easier interest rates. But AI stocks have become so dominant, and so much money has poured into the industry, that worries are rising about a potential bubble that could eventually lead to disappointment for investors.\nOccidental Petroleum fell 7.8% after it agreed to sell its chemical business, OxyChem, to Berkshire Hathaway for $9.7 billion in cash. It could be the final big purchase for Berkshire Hathaway with famed investor Warren Buffett as its CEO.\nFair Isaac jumped 20.7% after announcing a program that will allow mortgage lenders to access and distribute FICO credit scores directly to their customers, cutting out such big credit bureaus as TransUnion, Equifax, and Experian.\nTransUnion’s stock tumbled 9.5%, while Equifax slid 7.7%. The stock of the United Kingdom’s Experian fell 3.6% in London.\nLondon’s FTSE 100 edged down by 0.2%, but indexes were much stronger across Europe and Asia. South Korea’s Kospi jumped 2.7%, for one of the biggest gains following the big jumps for Samsung Electronics and SK Hynix.\nIn the bond market, the yield on the 10-year Treasury ticked down to 4.09%, from 4.12% late Wednesday.\n—By Stan Choe, AP business writer\nAP Writers Teresa Cerojano and Matt Ott contributed.",
      "publishedDate": "2025-10-02T17:40:48.000Z",
      "author": "Associated Press",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "Musk reports Tesla sales jump 7% after months of boycotts",
      "url": "https://www.fastcompany.com/91415265/tesla-sales-jump-musk",
      "summary": "Six months after Elon Musk left the Trump administration to the great relief of Tesla investors worried about boycotts, the world’s richest man has announced some good news: Sales of Tesla cars are back.\nWell, maybe.\nThe electric vehicle maker run by Musk reported Thursday that car sales jumped 7% in the three months through September after plunging for most of the year, as people turned off by his embrace of President Donald Trump and far-right politicians in Europe balked at buying his cars.\nBut the jump comes with a significant caveat: Tesla benefited from consumers taking advantage of a $7,500 tax credit before it expired on September 30, a surge in buying that helped all EV makers.\nIn fact, many Tesla rivals saw sales jump more. Fellow EV maker Rivian Automotive reported a 32% increase.\nTesla stock rose sharply on the sales news, but then fell into losses as financial analysts expressed skepticism about whether the new number signals a true turnaround, given all the anti-Musk backlash.\n“I don’t think most people are any more enamored with Elon now than they were a few months ago,” said Telemetry Insight’s Sam Abuelsamid. “I expect this is more a blip for Tesla than the restart of growth.”\nEven a big Tesla bull, Dan Ives of Wedbush Securities, was cautious, noting there are “still demand issues.”\nTesla stock dropped 3%, to $446, in early afternoon trading in New York.\nStill, it was a blowout number with sales hitting 497,099 vehicles versus 462,890 in the same period last year. Analysts expected sales to fall slightly to 456,000.\nInvestors cheered Musk’s decision in April to leave Washington for Austin, Texas, where Tesla is headquartered. But he is still heavily involved in political and social wars, alienating potential car buyers.\nOn Wednesday, he posted on X that he was canceling his Netflix subscription because of critical comments made by an employee of the streaming services company, which appeared to spark a wave of cancellations in turn.\nThe sharp fall in Tesla stock Thursday was remarkable, as investors have been surprisingly optimistic about the company in recent weeks despite terrible financial figures.\nInvestors drove the stock up 34% in September alone in a bet that Musk’s planned new, cheaper version of his best-selling Model Y will recharge sales. Musk has also been successful in shifting investor attention away from cars to other aspects of the business—the rollout of its driverless robotaxi service planned for several cities and its Optimus robots for factory work and household chores.\nDriving the stock higher has also been Musk’s apparent renewed focus on the company.\nTo help keep his attention on the company, Tesla’s board proposed last month a new pay package that would allow Musk to earn $1 trillion over the next several years if he meets certain financial goals. The pay package, unprecedented for U.S. companies already known for outsized CEO compensation, recently drew criticism from Pope Leo in an interview lamenting widening income gaps.\nIf Musk meets his pay goals, he could be setting a record on top of his own record. He recently became the first person ever to hit $500 billion in net worth, at least according to rich list compiler Forbes magazine.\nThe 7% sales rise in the last quarter compares with a 13% plunge in the first three months of the year when Musk led Trump’s government cost-cutting efforts at the Department of Government Efficiency. In the following three months through June, sales plunged 13% again.\nThe anti-Musk backlash in Europe had also been fierce, with sales plunging 40% in more than two dozen countries after he publicly supported far-right politicians there.\nMusk called the British prime minister an “evil tyrant” who belongs in prison and told Germans that “things will get very, very much worse” in their country if they didn’t vote for the anti-immigrant Alternative for Germany party. Protests broke out in several cities, including a hanging of the billionaire in effigy in Milan and posters in London likening him to a Nazi.\nFor her part, the Tesla head of the board of directors who approved Musk’s latest pay package recently told Bloomberg that she is not sure if Musk’s politics have had any impact on the company’s finances. Robyn Denholm has earned nearly $700 million in compensation for serving on the board since 2014, a package that itself has drawn criticism.\nTesla reports third-quarter earnings later this month. Profits for the previous quarter fell 16% as the company continued to lose market share to European EV makers and fast-growing Chinese rivals, such as BYD.\nMusk’s new robotaxi service launched in Austin in June and has had some hitches, with reports of the cabs stopping suddenly for no reason and driving in the opposing lane in one instance. But Musk has said the driverless rides will be available in several other cities by the end of next year.\n—By Bernard Condon, AP business writer",
      "publishedDate": "2025-10-02T17:02:45.000Z",
      "author": "Associated Press",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "These 3 tricks will get AI chatbots to help you do your job",
      "url": "https://www.fastcompany.com/91415259/these-3-tricks-will-get-ai-chatbots-to-help-you-do-your-job",
      "summary": "With the help of generative AI chatbots such as ChatGPT, Google’s Gemini, and Anthropic’s Claude, creating content is easier and faster than ever. Here are a few quick and easy methods you can use to create content, summarize information, and even brainstorm new ideas.",
      "publishedDate": "2025-10-02T16:01:16.000Z",
      "author": "kat-caulderwood",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "High-performing teams are using AI differently. Here’s how you can, too  ",
      "url": "https://www.fastcompany.com/91415245/high-performing-teams-are-using-ai-differently-heres-how-you-can-too",
      "summary": "Working with AI as a team isn’t about knowing the latest technology. It’s about changing your mindset to build skills AI can’t replace, focusing on outcomes, not optics, and leaving room for strategic tests.",
      "publishedDate": "2025-10-02T15:54:55.000Z",
      "author": "kat-caulderwood",
      "source": {
        "name": "Fast Company",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:26.029Z"
    },
    {
      "title": "Why Casio Just Launched an AI-Powered Emotional Support Guinea Pig",
      "url": "https://www.inc.com/chloe-aiello/why-casio-just-launched-an-ai-powered-emotional-support-guinea-pig/91247378",
      "summary": "The robot is called Moflin. It costs $429— and it’s adorable.",
      "publishedDate": "2025-10-02T20:27:32.000Z",
      "author": "Chloe Aiello",
      "source": {
        "name": "Inc.com",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:27.840Z"
    },
    {
      "title": "Meta Will Soon Personalize Ads Based on What Users Type Into Its AI Tools",
      "url": "https://www.inc.com/reuters/meta-will-soon-personalize-ads-based-on-what-users-type-into-its-ai-tools/91247113",
      "summary": "The AI-based changes include Facebook and Instagram and will go into effect in December.",
      "publishedDate": "2025-10-02T16:12:38.000Z",
      "author": "Reuters",
      "source": {
        "name": "Inc.com",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:27.840Z"
    },
    {
      "title": "OpenAI Just Hit a $500 Billion Valuation After Selling Shares to SoftBank: Report",
      "url": "https://www.inc.com/reuters/openai-500-billion-valuation-sale-shares-softbank-chatgpt/91247140",
      "summary": "OpenAI employees sold shares in a deal that saw the company’s valuation grow from $300 billion in a matter of weeks.",
      "publishedDate": "2025-10-02T15:41:01.000Z",
      "author": "Reuters",
      "source": {
        "name": "Inc.com",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:27.840Z"
    },
    {
      "title": "Why it Might Pay to Be ‘Playful’ at Work",
      "url": "https://www.inc.com/kit-eaton/why-it-might-pay-to-be-playful-at-work/91247092",
      "summary": "Play isn’t just for kids — a study shows how the trait can build rapport with colleagues.",
      "publishedDate": "2025-10-02T14:51:15.000Z",
      "author": "Kit Eaton",
      "source": {
        "name": "Inc.com",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:27.840Z"
    },
    {
      "title": "Small-Business Hiring Remains Steady Amid Initial Signs of Wider Job Cuts",
      "url": "https://www.inc.com/bruce-crumley/small-business-hiring-remains-steady-amid-initial-signs-of-wider-job-cuts/91247075",
      "summary": "Release of official statistics on job creation is canceled by the government shutdown.",
      "publishedDate": "2025-10-02T13:49:55.000Z",
      "author": "Bruce Crumley",
      "source": {
        "name": "Inc.com",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:27.840Z"
    },
    {
      "title": "Here’s Why You Don’t Want Your Teams to Get Along All the Time",
      "url": "https://www.inc.com/bruce-eckfeldt/heres-why-you-dont-want-your-teams-to-get-along-all-the-time/91243232",
      "summary": "Most leadership teams prioritize cohesion and cultural fit, but this approach kills innovation. Here’s why, and how to fix it.",
      "publishedDate": "2025-10-02T12:00:00.000Z",
      "author": "Bruce Eckfeldt",
      "source": {
        "name": "Inc.com",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:27.840Z"
    },
    {
      "title": "The 2025 Top 50 Leadership and Management Experts",
      "url": "https://www.inc.com/jeff-haden/the-2025-top-50-leadership-and-management-experts/91245961",
      "summary": "Who makes my updated list? More important, who are some of the experts you should listen to?",
      "publishedDate": "2025-10-02T10:51:59.000Z",
      "author": "Jeff Haden",
      "source": {
        "name": "Inc.com",
        "tier": "startup",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:27.840Z"
    },
    {
      "title": "How Project Leaders Can Run Projects Like Founders – Live Audience Questions",
      "url": "https://thedigitalprojectmanager.com/career/how-project-leaders-can-run-projects-like-founders-live-audience-questions/",
      "summary": "Project leaders are being asked to think like founders—balancing delivery with strategy, sales, and business health. In this bonus Q&A, Mark Orttung and Pam Butkowski share candid advice on hybrid roles, endurance in hard times, business literacy, utilization, and how PMs can create real organizational impact.\nThe post How Project Leaders Can Run Projects Like Founders – Live Audience Questions appeared first on The Digital Project Manager.",
      "publishedDate": "2025-10-02T20:22:41.000Z",
      "author": "Galen Low",
      "source": {
        "name": "Digital Project Manager",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:32.079Z"
    },
    {
      "title": "What Is Microsoft Project Professional? Uses, Features and Pricing",
      "url": "https://www.projectmanager.com/blog/microsoft-project-professional",
      "summary": "In the world of project planning, there’s no shortage of tools to help you organize, schedule and deliver work. Microsoft Project Professional, in particular, is one of the most well-known project management solutions on the market. It is designed for...\nRead More\nThe post What Is Microsoft Project Professional? Uses, Features and Pricing appeared first on ProjectManager.",
      "publishedDate": "2025-10-02T19:00:01.000Z",
      "author": "Camilo Tristancho",
      "source": {
        "name": "ProjectManager.com",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:33.463Z"
    },
    {
      "title": "Construction Workflow Management: How-to Guide With Templates",
      "url": "https://www.projectmanager.com/blog/construction-workflow-management",
      "summary": "Coordinating a construction project involves multiple teams, vendors and phases that must stay aligned to deliver on time and within budget. Construction workflow management helps bring order to this complexity by organizing tasks, tracking progress and ensuring everyone knows what...\nRead More\nThe post Construction Workflow Management: How-to Guide With Templates appeared first on ProjectManager.",
      "publishedDate": "2025-10-02T14:00:29.000Z",
      "author": "William Malsam",
      "source": {
        "name": "ProjectManager.com",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:33.463Z"
    },
    {
      "title": "How to Make a Project Network Diagram: Free Tools & Examples",
      "url": "https://www.projectmanager.com/blog/network-diagrams-free-tools",
      "summary": "What project management is good at is making the complex simple, or at least manageable. That’s done by using project management tools such as project network diagrams. A project network diagram helps project managers simplify a complex project plan, enabling...\nRead More\nThe post How to Make a Project Network Diagram: Free Tools & Examples appeared first on ProjectManager.",
      "publishedDate": "2025-10-02T13:00:59.000Z",
      "author": "William Malsam",
      "source": {
        "name": "ProjectManager.com",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:33.463Z"
    },
    {
      "title": "Fault Tree Analysis: Complete Guide with Examples and Diagrams",
      "url": "https://pmstudycircle.com/fault-tree-analysis/",
      "summary": "Every system faces risks, and you must prepare for failures before they happen. Fault tree analysis (FTA) gives you a structured way to find root causes of problems and prevent them from spreading. By creating a visual diagram of failures and their contributing factors, you can understand how and why a system might fail. Originally...",
      "publishedDate": "2025-10-02T16:46:45.000Z",
      "author": "Fahad Usmani, PMP",
      "source": {
        "name": "PM Study Circle",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:01:46.278Z"
    },
    {
      "title": "Are you treating Scrum as a recipe—or an approach?",
      "url": "https://www.scrum.org/resources/blog/are-you-treating-scrum-recipe-or-approach",
      "summary": "Scrum is an approach—not a recipe.\n \nFrom the Scrum Guide:\n“Scrum employs an iterative, incremental approach to optimize predictability and to control risk.”\n \nCambridge Dictionary offers several definitions of “approach”:\n- A way of considering or doing something\n- A way of dealing with something\n- A route that leads to a place\n \nScrum is all three.\n \nIt’s a way of considering work: not as simple or predictable, but as complex, where more is unknown than is known, where the problem is clear but the solution not so much, where cause and effect are only visible in hindsight.\nFor example: a team treats a missed Sprint Goal not as failure, but as evidence their assumptions were off. Instead of blame, they ask: what did we learn, and how do we adapt? Scrum reshapes how they consider work.\n \nIt’s a way of dealing with challenges: by using empiricism—transparency, inspection, and adaptation—instead of relying on assumptions or upfront certainty.\nFor example: a Product Owner faces conflicting stakeholder demands. Instead of negotiating and promising upfront, Scrum gives them a way of dealing with it: transparent focus, regular inspection, and reordering based on evidence.\n \nAnd it’s a route that leads somewhere: toward teams that deliver solutions and improvements to users more predictably, toward risks being surfaced and controlled earlier, toward organizations learning faster than their competitors.\nFor example: a team delivers an improved version every Sprint. At first, it’s clunky and incomplete. Over time, their Definition of Done - i.e. their quality level - expands, automation improves, and quality rises. The “place” Scrum leads them to: predictable delivery of valuable increments.\n \nScrum doesn’t eliminate risk. It makes it visible. \nIt doesn’t guarantee predictability. It helps you optimize it. \n \nBut only if you treat it as an approach to navigate complexity—not as a checklist of ceremonies.\n \n​​Too often, I see Scrum misused as something else:\n- Daily Scrums run as status reports for managers—no inspection, no adaptation.\n- Jira boards worshipped as the goal, rather than gathering evidence of value delivery.\n- Teams spending months “refining” entire backlogs before starting—waterfall with Scrum stickers.\n- Sprint Reviews polished to hide undone work—killing transparency instead of using it to improve the solution to what users really need.\n \nSo ask yourself:\n- Is Scrum helping you make value delivery more predictable?\n- Are risks actively surfaced and managed—or buried until it’s too late?\n \nAre you walking the route Scrum lays out—or trying to bend it into a process it was never meant to be?\n \nScrum is an approach. Where is it taking you?\nTo what place is Scrum leading you?\n\n \nI’d love to hear your thoughts in the comments below!\n \nI hope you find value in these short articles and if you are looking for more clarifications, feel free to make contact.\nDon't want to miss any of these blog posts? Have the “The Scrum Guide Explored” series weekly in your mailbox.\n \nWishing you an inspiring read and a wonderful journey.\nScrum on!",
      "publishedDate": "2025-10-02T22:00:00.000Z",
      "author": "Steven Deneir",
      "source": {
        "name": "Scrum.org",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:02:07.522Z"
    },
    {
      "title": "You Don’t Need a Full-Time Scrum Master... Until You Do",
      "url": "https://www.scrum.org/resources/blog/you-dont-need-full-time-scrum-master-until-you-do",
      "summary": "Many companies try to save money by watering down the Scrum Master.\n👉 10% of someone’s time\n👉 Given to the tech lead\n👉 Rotated each Sprint\n👉 Having the Product Owner take it on as a side hustle\n👉 Split across 3–4 teams \"for efficiency\"\n👉 Given to a business analyst because \"they already run meetings\"\nIt feels efficient.\nBut what it really means is: \"We don’t have a clue what a Scrum Master really does.\"\nMost organizations reduce it to:\n📅 Booking meetings\n🗂️ Updating Jira\n🥳 Playing cheerleader\n📊 Tracking velocity and other vanity metrics\n📝 Taking notes in every meeting\n📌 Making sure people \"follow the rules of Scrum\" by enforcement\nYes, the Scrum Guide never says the Scrum Master has to be full-time.\nBut here’s the hard truth: when you water down the accountability, you lose the impact that actually makes Scrum work.\nWhat gets lost is the invisible stuff that actually makes Scrum work:\n🔸 Coaching and mentoring that changes behaviors\n🔸 Defending empiricism when it is under attack\n🔸 Making space for improvement instead of excuses\n🔸 Helping organizations unlearn old habits\n🔸 Protecting the Definition of Done so tech debt does not bury the team later\n🔸 Raising uncomfortable truths when shortcuts put delivery over craftsmanship\n🔸 Keeping the Scrum values alive so teams do not slide into Zombie Scrum\n⚠️ The deadliest combo? Merging Scrum Master and Product Owner.\nAgain, Scrum has no rule against this, but...\nOne maximizes value.\nThe other improves how the team works.\nCombine them, and both suffer.\n🔁 Rotations do not save you either.\nNot everyone has the skill or the desire to do the job.\nThe result:\n🤷 Blurred accountability\n🤷 Surface-level improvements that change nothing\n🤷 Teams left to drift\nA part-time Scrum Master almost never...\n🚫 Challenges the status quo\n🚫 Coaches leadership\n🚫 Supports the Product Owner\n🚫 Surfaces organizational dysfunction\nScrum does not require a full-time Scrum Master every single day.\nBut when the accountability is minimized, you pay the price in slower delivery, weaker teams, and years of wasted potential.\n👉 Cutting the Scrum Master is the most expensive \"savings\" you might ever make.\nWhat have you seen when companies try to water down the Scrum Master?",
      "publishedDate": "2025-10-02T17:52:03.000Z",
      "author": "Chris Belknap",
      "source": {
        "name": "Scrum.org",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:02:07.522Z"
    },
    {
      "title": "Four Perspectives on Structuring Product Groups and Teams",
      "url": "https://www.scrum.org/resources/blog/four-perspectives-structuring-product-groups-and-teams",
      "summary": "In this article, I will share four perspectives that can help shape the structure of product groups and teams in the right way.\nIn the Creating Agile Organizations approach we defined a product group as a semi-autonomous unit built around a family of products. It contains the entire value stream. The group is led by a senior manager — the Product Owner, responsible for the strategy, vision, and business outcomes of the product line.\nA product group is built from the essential parts needed to fulfill its mission. These parts could be:\n\ncross-functional teams (feature teams),\nshared functions or components.\n\n\nProduct Group prototype\nTeams often specialize in specific areas of value — for example, by customer segments, Jobs-to-be-Done, or parts of the customer journey. The perspectives described below help to:\n\ninclude the right elements in a product group,\ndecide what should be part of the teams and what is better left in shared functions.\n\nPerspective 1: Frequency (Heat Map)\nThis is the most common and straightforward perspective. I have been using it for more than ten years. When the boundaries of a product are defined and a Product Owner is assigned, they form the Product Backlog. You can analyze:\n\narchitectural components,\norganizational functions.\n\nThe logic is simple: include in the product group those components and functions that most often require changes — the ones that “heat up” most frequently.\n\nHeat Map that shows frequency of components and functions\nA helpful tool here is a heat map. It shows what functions and components are required most often in the Product Backlog and helps make an initial selection. \nPerspective 2: Criticality and Uncertainty\nCriticality is the degree to which an external component or function (outside the product group) impacts the business outcomes for which the Product Owner is accountable. For example: if your product is lending, then the risk management function is likely to be highly critical for you.\nUncertainty is the extent to which an external component or function disrupts timely and predictable value delivery. A classic example is information security. It is often centralized and not part of the product group, but it often blocks releases at the last moment and breaks plans. For your product, this means high uncertainty.\n\nCriticality / uncertainty\nI use a criticality/uncertainty matrix and evaluate each external function on a 10-point scale.\n\nHigh criticality (6–10) means a significant impact on outcomes.\nHigh uncertainty (6–10) means a high risk of disrupting delivery.\n\nFunctions that score high on both dimensions are recommended to be included in the product group.\nPerspective 3: Type of Operational Dependencies (DSM)\nThis perspective is used to fine-tune the structure of a product group. Usually, it comes after analyzing frequency and criticality/uncertainty.\nLet’s recall the three types of dependencies described by James Thompson:\n\nPooled,\nSequential,\nReciprocal.\n\nCoordinating reciprocal dependencies is two / three times more expensive than coordinating pooled or sequential ones. That’s why it is optimal to include reciprocal dependencies in the same unit — it reduces coordination costs and simplifies collaboration.\n\nDSM that shows dependencies between marketing and product development\nTo identify the type of dependencies, DSM matrices are used. Symmetrical elements relative to the diagonal indicate the presence of reciprocal dependencies.\nI don’t use this perspective all the time, but only for fine-tuning. For example:\n\nFrequency and criticality/uncertainty do not provide a clear answer.\nYou hesitate whether a component or function should be included in the product group.\nIf the DSM matrix shows reciprocal dependencies, that is a strong argument for inclusion.\n\nOn the other hand, frequency alone may suggest that a function is essential (for example, marketing). But if the DSM matrix shows only pooled or sequential dependencies, and both criticality and uncertainty are low, then marketing can reasonably remain outside the product group.\nPerspective 4: Cost of Delay (Value Stream Mapping)\nThis perspective is also useful for fine-tuning. It is important in cases where functions:\n\ndo not appear frequently in the backlog,\nwork in a predictable way,\nbut still become bottlenecks for the whole organization.\n\nThis usually happens because the function is centralized and serves all product groups at once.\nWith Value Stream Mapping, you can evaluate the cost of delay.\nA practical example: at one client, the legal function was delaying the flow of value creation by an average of 2–3 months. Previous attempts to include lawyers in product groups had failed. But once we evaluated the cost of delay and showed how much money was being lost because of this pause, the decision was made quickly — a lawyer was assigned to the product group.\n\nValue-Stream Mapping (VSM)\nTraditional management thinks in terms of resource efficiency (“how to keep the lawyers fully utilized”). The perspective of cost of delay shifts the conversation to flow efficiency — and in that case, the arguments become much more compelling.\nHow to Use All Four Perspectives\nIt is best not to rely on a single perspective, but to combine them. My typical approach:\n\nOnce the product boundaries are defined and the Product Owner is appointed, I always start with frequency and criticality/uncertainty.\nI bring in the perspectives of operational dependencies and cost of delay only if needed — when doubts remain and fine-tuning is required.\n\nThis approach helps avoid endless discussions and allows you to find a balance between the autonomy of a product group and the benefits of scale and efficiency.",
      "publishedDate": "2025-10-02T13:19:39.000Z",
      "author": "Ilia Pavlichenko",
      "source": {
        "name": "Scrum.org",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:02:07.522Z"
    },
    {
      "title": "The Chief Engineer Advantage: Turning Tension Into Breakthroughs",
      "url": "https://www.lean.org/the-lean-post/articles/the-chief-engineer-advantage-turning-tension-into-breakthroughs/",
      "summary": "This edition of The Design Brief shows how conflict isn’t something chief engineers avoid—it’s what they harness. From Lexus to Mustang to the 747, the best chief engineers turn tension into breakthroughs, uniting teams behind bold visions that deliver extraordinary value.",
      "publishedDate": "2025-10-02T09:00:00.000Z",
      "author": "Lory Moniz",
      "source": {
        "name": "Lean Enterprise Institute",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:02:22.883Z"
    },
    {
      "title": "Baltic Synchronisation – Smart Dependency Control",
      "url": "https://ipma.world/baltic-synchronisation-smart-dependency-control/",
      "summary": "In the early afternoon hours of 9 February, 2025, a small meeting room overseeing heavily protected System Control Centre inside Vilnius headquarters of Litgrid, Lithuanian power transmission system operator (TSO), was quite unusually packed. Despite it being Sunday, a flock of dignitaries including the minister of energy, the Prime Minister, and two European commissioners were […]\nThe post Baltic Synchronisation – Smart Dependency Control appeared first on IPMA International Project Management Association.",
      "publishedDate": "2025-10-02T08:29:32.000Z",
      "author": "Artūras Kuliešas",
      "source": {
        "name": "International PM Association",
        "tier": "pmo",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "RSS",
      "discoveredAt": "2025-10-03T04:02:33.435Z"
    },
    {
      "title": "A Comprehensive Guide to AI Workflow Automation in 2024 – n8n ...",
      "url": "https://blog.n8n.io/ai-workflow-automation/",
      "summary": "Oct 11, 2024 ... We will highlight 5 AI workflow automation tools that go beyond ... d/1zs963iFkO-3g2rKak8Hcy555h55D8gjF/view?usp=sharing\" }, { \"name ...",
      "publishedDate": "2024-10-11T08:51:49.000Z",
      "author": "Unknown",
      "source": {
        "name": "blog",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI automation platforms\" OR \"AI workflow automation tools\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:37.527Z"
    },
    {
      "title": "The Rise of AI Workflows - by Rafa Páez",
      "url": "https://newsletter.rafapaez.com/p/the-rise-of-ai-workflows",
      "summary": "Jul 13, 2025 ... Why AI workflow automation tools are exploding, and how to ride the wave. ... If you enjoyed this issue, tap the ❤️, share it with someone who'd ...",
      "publishedDate": "2025-10-03T04:02:37.527Z",
      "author": "Rafa Páez",
      "source": {
        "name": "newsletter",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI automation platforms\" OR \"AI workflow automation tools\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:37.527Z"
    },
    {
      "title": "Low Code RAG-LLM Framework for Context-Aware Querying in ...",
      "url": "https://www.preprints.org/manuscript/202507.0537/download/final_file",
      "summary": "Jul 7, 2025 ... This manuscript demonstrates that with the aid of powerful AI automation platforms such as ... D. Roustan and F. Bastardot, \"The clinicians ...",
      "publishedDate": "2025-10-03T04:02:37.527Z",
      "author": "Unknown",
      "source": {
        "name": "preprints",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI automation platforms\" OR \"AI workflow automation tools\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:37.527Z"
    },
    {
      "title": "Top 9 AI Agent Frameworks as of September 2025 | Shakudo",
      "url": "https://www.shakudo.io/blog/top-9-ai-agent-frameworks",
      "summary": "Sep 2, 2025 ... Latest ranking of AI agent frameworks for autonomous systems. In ... d recommend this framework for businesses with dedicated technical ...",
      "publishedDate": "2025-10-03T04:02:38.934Z",
      "author": "Unknown",
      "source": {
        "name": "shakudo",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "9 AI Agent Frameworks Battle: Why Developers Prefer n8n – n8n Blog",
      "url": "https://blog.n8n.io/ai-agent-frameworks/",
      "summary": "Apr 24, 2025 ... But if you've actually tried to build an AI agent, you know that the reality is much messier: many AI agent frameworks ... Qdrant, Zep) for ...",
      "publishedDate": "2025-04-24T09:47:55.000Z",
      "author": "Unknown",
      "source": {
        "name": "blog",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "Introducing /search: Discover and scrape the web with one API call",
      "url": "https://www.firecrawl.dev/blog/introducing-search-endpoint",
      "summary": "Jun 3, 2025 ... search( \"latest AI agent frameworks\", limit=5, scrape_options ... Simply add tbs=\"qdr:w\" and lang=\"de\" . Now Live Everywhere. On day one ...",
      "publishedDate": "2025-10-03T04:02:38.934Z",
      "author": "Eric Ciarla",
      "source": {
        "name": "firecrawl",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "A Detailed Comparison of Top 6 AI Agent Frameworks in 2025",
      "url": "https://www.turing.com/resources/ai-agent-frameworks",
      "summary": "May 20, 2025 ... Read how top AI agent frameworks, including LangGraph, LlamaIndex, CrewAI, Semantic Kernel, AutoGen, and Swarm, compare in terms of features ...",
      "publishedDate": "2025-10-03T04:02:38.934Z",
      "author": "Unknown",
      "source": {
        "name": "turing",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "AI Agent Frameworks",
      "url": "https://aiagentframeworks.ai/",
      "summary": "AI Agent Frameworks. Get latest updates on AI development frameworks, tools ... Qdrant. Vector database optimized for AI applications, combining high ...",
      "publishedDate": "2025-10-03T04:02:38.934Z",
      "author": "Unknown",
      "source": {
        "name": "aiagentframeworks",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "Qdrant's GPU-accelerated vector indexing is here",
      "url": "https://cerebralvalley.beehiiv.com/p/qdrant-s-gpu-accelerated-vector-indexing-is-here",
      "summary": "Jan 23, 2025 ... ... AI Agent frameworks to ensure an easy integration. For example, Qdrant works out of the box with frameworks like CrewAI, LangGraph, Autogen ...",
      "publishedDate": "2025-10-03T04:02:38.934Z",
      "author": "Unknown",
      "source": {
        "name": "cerebralvalley",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "Building Your First AI Agent with n8n | DataCamp",
      "url": "https://www.datacamp.com/code-along/building-your-first-ai-agent-with-n8n",
      "summary": "Jun 19, 2025 ... 5d14h33m51s. Buy Now. Skip to main content. EN. EnglishEspañol ... AI Agent Frameworks: Building Smarter Systems with the Right Tools.",
      "publishedDate": "2025-10-03T04:02:38.934Z",
      "author": "Unknown",
      "source": {
        "name": "datacamp",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "Building Agentic RAG Pipelines for Medical Data with CrewAI and ...",
      "url": "https://ai.gopubby.com/building-agentic-rag-pipelines-for-medical-data-with-crewai-and-qdrant-3a00a48fb0d1",
      "summary": "Jan 11, 2025 ... confluent-hub install qdrant/qdrant-kafka:1.1.0 ... Agentic AI #3 — Top AI Agent Frameworks in 2025: LangChain, AutoGen, CrewAI & Beyond ...",
      "publishedDate": "2025-01-14T13:43:59.275Z",
      "author": "M K Pavan Kumar",
      "source": {
        "name": "ai",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "RAG Models: From OpenAI to Amazon Bedrock | by Hemant Gosain ...",
      "url": "https://monotonic.ai/rag-models-from-openai-to-amazon-bedrock-eab7e16c0109",
      "summary": "Nov 22, 2023 ... d.metadata[\"custom_meta\"] = custom_meta documents ... We Evaluated 5 AI Agent Frameworks — Here's why AWS Agent-Squad is the best fit ...",
      "publishedDate": "2023-11-23T00:37:14.631Z",
      "author": "Hemant Gosain",
      "source": {
        "name": "monotonic",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "Exploring the World of AI Agents: A Comprehensive Guide for ...",
      "url": "https://blog.gopenai.com/exploring-the-world-of-ai-agents-a-comprehensive-guide-for-beginners-399e9579ddff",
      "summary": "Aug 27, 2024 ... Jyoti Dabass, Ph.D. Follow. 8 min read. ·. Aug 27, 2024 ... We Evaluated 5 AI Agent Frameworks — Here's why AWS Agent-Squad is the best fit ...",
      "publishedDate": "2024-08-28T12:54:51.201Z",
      "author": "Jyoti Dabass, Ph.D.",
      "source": {
        "name": "blog",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI orchestration platforms\" OR \"AI agent frameworks\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:38.934Z"
    },
    {
      "title": "Best Free AI Tools for Office & Productivity in 2025 - Toolify",
      "url": "https://www.toolify.ai/free-ai-tools/office-productivity",
      "summary": "AI Assistant, AI Productivity Tools, AI Search Engine, AI Agent... Free AI ... D-ID - 14-day trial / Create AI-powered talking avatars / Translate ...",
      "publishedDate": "2025-10-03T04:02:40.446Z",
      "author": "Unknown",
      "source": {
        "name": "toolify",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI productivity tools\" OR \"AI workplace efficiency apps\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:40.446Z"
    },
    {
      "title": "N8N WORKFLOW BLUEPRINTS– Automate Everything With Ai ...",
      "url": "https://www.etsy.com/listing/4300474642/n8n-workflow-blueprints-automate",
      "summary": "May 4, 2025 ... ... ai productivity tools, n8n blueprints, automation for developers, ai ... If you'd like to file an allegation of infringement, you'll ...",
      "publishedDate": "2025-10-03T04:02:40.446Z",
      "author": "Unknown",
      "source": {
        "name": "etsy",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI productivity tools\" OR \"AI workplace efficiency apps\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:40.446Z"
    },
    {
      "title": "OpenAI ChatGPT Plugins List",
      "url": "https://dang.ai/plugins",
      "summary": "Qdrant. Qdrant is a vector search engine ChatGPT plugin to help make the ... AI Productivity Tools · AI Marketing Tools · AI Text to Speech Tools · AI Search ...",
      "publishedDate": "2025-10-03T04:02:40.446Z",
      "author": "Unknown",
      "source": {
        "name": "dang",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI productivity tools\" OR \"AI workplace efficiency apps\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:40.446Z"
    },
    {
      "title": "Search | O'Reilly",
      "url": "https://www.oreilly.com/search/?q=*&type=*&order_by=_oreilly_popularity&topics=Generative%20AI",
      "summary": "We're calling the event O'Reilly Demo Day, and we'd love for you to attend. ... Work smarter with AI productivity tools. In todays fast- ...",
      "publishedDate": "2025-10-03T04:02:40.446Z",
      "author": "Unknown",
      "source": {
        "name": "oreilly",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI productivity tools\" OR \"AI workplace efficiency apps\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:40.446Z"
    },
    {
      "title": "DICOM Router - Secure. Scalable. Seamless.",
      "url": "https://www.qvera.com/dicom-router/",
      "summary": "Ryan W. September ... PACS, VNA, and 3rd-Party System Integration: Direct connections to existing PACS, cloud archives, AI analytics platforms, and EHRs.",
      "publishedDate": "2025-10-03T04:02:41.924Z",
      "author": "Unknown",
      "source": {
        "name": "qvera",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI business dashboards\" OR \"AI analytics platforms\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:41.924Z"
    },
    {
      "title": "Vercel Applications | Lablab.ai",
      "url": "https://lablab.ai/apps/tech/vercel",
      "summary": "AgentFlow SMB - AI Sales Automation with Lovable. Multi-agent system (Lead ... GLESSI-TCHE est une solution d'assistant vocal intelligent conçu pour répondre aux ...",
      "publishedDate": "2025-10-03T04:02:54.569Z",
      "author": "Unknown",
      "source": {
        "name": "lablab",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI CRM tools\" OR \"AI sales automation\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:54.569Z"
    },
    {
      "title": "The INTERNET OF AGENTS HACKATHON @SOLANA SKYLINE ...",
      "url": "https://lablab.ai/event/internet-of-agents",
      "summary": "Coral ProtocolMistral AIQdrantDeepSeek R1OpenAI · Yield Scout - AI DeFi ... AgentFlow SMB - AI Sales Automation with Lovable. Multi-agent system (Lead ...",
      "publishedDate": "2025-10-03T04:02:54.569Z",
      "author": "Unknown",
      "source": {
        "name": "lablab",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI CRM tools\" OR \"AI sales automation\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:54.569Z"
    },
    {
      "title": "How to Build Powerful LLM Apps with Vector Databases + RAG ...",
      "url": "https://skimai.com/how-to-build-powerful-llm-apps-with-vector-databases-rag-aiyou55/",
      "summary": "Jun 11, 2024 ... Qdrant. Qdrant is an open-source, high-speed, and ... Looking to build your own AI Workers with our AI Workforce Management platform?",
      "publishedDate": "2024-06-11T19:11:07+00:00",
      "author": "Greggory Elias",
      "source": {
        "name": "skimai",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI HR platforms\" OR \"AI workforce management\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:02:56.030Z"
    },
    {
      "title": "PoC and MVP Development Service: Test AI Ideas Before Big ...",
      "url": "https://dataforest.ai/services/generative-ai/poc-and-mvp-development-ai-ideas-validated",
      "summary": "Generative AIDigital TransformationData EngineeringCustom software ... Qdrant icon. Qdrant. Pix2Pix icon. Pix2Pix. Pinecone icon. Pinecone. Pgvctor icon.",
      "publishedDate": "2025-10-03T04:03:04.210Z",
      "author": "Unknown",
      "source": {
        "name": "dataforest",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI enterprise adoption trends\" OR \"AI digital transformation\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:03:04.210Z"
    },
    {
      "title": "AI Agent Development Service: Self-Learning AI that Works for You",
      "url": "https://dataforest.ai/services/generative-ai/ai-agent-development-automate-boring-tasks",
      "summary": "Generative AIDigital TransformationData EngineeringCustom software ... Qdrant icon. Qdrant. Pix2Pix icon. Pix2Pix. Pinecone icon. Pinecone. Pgvctor icon.",
      "publishedDate": "2025-10-03T04:03:04.210Z",
      "author": "Unknown",
      "source": {
        "name": "dataforest",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI enterprise adoption trends\" OR \"AI digital transformation\" qdr:d",
      "searchCategory": "generalAI",
      "discoveredAt": "2025-10-03T04:03:04.210Z"
    },
    {
      "title": "Artificial Intelligence for Business Leaders | DataCamp",
      "url": "https://www.datacamp.com/resources/webinars/artificial-intelligence-for-business-leaders",
      "summary": "6d09h57m51s. Buy Now · Courses · See all Beginner courses · Introduction to Alteryx ... Hugo shares insights from Andrew Ng's AI Transformation Playbook ...",
      "publishedDate": "2025-10-03T04:04:00.490Z",
      "author": "Unknown",
      "source": {
        "name": "datacamp",
        "tier": "search",
        "authority": "Standard",
        "focusAreas": [
          "AI",
          "PMO"
        ]
      },
      "discoveryMethod": "Google Search",
      "searchQuery": "\"AI organizational change management\" OR \"AI transformation playbook\" qdr:d",
      "searchCategory": "pmoInference",
      "discoveredAt": "2025-10-03T04:04:00.490Z"
    }
  ],
  "stats": {
    "totalSources": 85,
    "activeSources": 85,
    "articlesDiscovered": 146,
    "lastRunTime": "2025-10-03T04:04:14.042Z",
    "frontierSources": 47,
    "businessSources": 13,
    "pmoSources": 24,
    "rssArticles": 122,
    "googleArticles": 24
  },
  "timestamp": "2025-10-03T04:04:14.042Z",
  "requestId": "discovery-1759464254042"
}